{
  "term": "اتى",
  "previous_term": "اتومبيل",
  "next_term": "ماتى",
  "definition": "اتى atā i (اتيان ityān, اتى aty, مأتاة to come (ه or الى to; على over s.o.), arrive (هـ or الى at); ب اتى to bring, bring forward, produce, advance, accomplish or achieve s.th.; اتى ه ب to bring, give or offer s.o. s.th.; to do, perform (هـ a deed), carry out, execute (هـ e.g., movements); to commit, perpetrate (هـ a sin, a. crime); to mention (على s.th.); to finish off (على s.th., also s.o.); to finish, complete, carry through, dispose, settle, wind up, conclude, terminate, bring to a close (على s.th.); to destroy, annihilate, eradicate, wipe out (على s.th.); to eliminate, carry away, sweep away (على s.th.), do away (على with); to use up, exhaust (also a subject), present exhaustively, in great detail (على s.th.), elaborate (على on s.th.) │ كما يأتي as follows; اتى على آخره (ākhirihī) to complete, finish s.th.; to spend or use up the last of s.th.; اتى على الأخضر واليابس to destroy everything, wreak havoc; اتى البيوت من ابوابها s.th. in the right way, knock on the right door;يؤتى من قبل yu’ta min qibali is undermined, weakened, ruined by <b>III</b> to offer furnish, give, afford (ب to s.o. s.th.), provide, supply (ب s.o. with); to be propitious, be favorable (ه for s.o.), favor (ه s.o.); to turn out well (. for s.o.), be in favor (ه of); to suit, befit, become (ه s.o.), be appropriate (ه for s.o.); to agree (ه with s.o.; food) │اتاه كل شيء (kullu šai’in) everything was in his favor, turned out well for him, came his way <b>IV</b> to bring (هـ s.o. s.th.); to give (هـ s.o. s.th.); to grant (هـ ه to s.o. s.th.), bestow (هـ upon s.o. s.th.) │آتى الزكاة (zakāta) to give alms <b>V</b> to originate, stem, derive, spring, arise, result (عن from); to end (عن with), result (عن in); to get (الى to), arrive (الى at); to be easy to do, be feasible without difficulty, be attainable, go well, progress; to go about s.th. (فى) gently, cautiously <b>X</b> to ask to come, induce to come (ه s.o.)"
}