{
  "term": "اثر",
  "previous_term": "تاثيث",
  "next_term": "اثري",
  "definition": "اثر aṯara u i (aṯr, اثارة aṯāra) to transmit, pass along, report, relate (هـ s.th., عن from, or based on the authority of, s.o.) <b>II</b> to affect, influence (في or على s.o., s.th.), act (في or على upon), produce an effect, make an impression, have influence (في or على on); to induce (phys.) <b>IV</b> to prefer (هـ على s.th. to), like (هـ s.th.) more (على than); to have a predilection, a liking (هـ for), like (هـ s.th.), be fond (هـ of); to choose, deem wise or advisable (ان to do s.th.); to adore (هـ, ه s.o., s.th.) │آثر نفسه بالخير (nafsahū bi-l-kair) to wish o.s. well, hope for the best for o.s. <b>V</b> to be impressed, be influenced; to let o.s. be impressed, be impressible; to be moved, be touched (ب or ل by, also من); to be excited, be stimulated; to be affected (ب by, said of materials, e.g., iron by acid); to be induced (phys.); to follow in s.o.’s (ه) tracks, follow s.o.’s example, emulate (ه s.o.); to pursue, follow up (هـ a question, a problem); to perceive, feel (هـ s.th.) <b>X</b> to claim a monopoly; to possess alone, with the exclusion of others, monopolize (ب s.th.); to appropriate (ب s.th.), take exclusive possession (ب of); to preoccupy (هـ s.th.), engross (هـ the attention) │استأثر الله به the Lord has taken him unto Himself\n\n\nاثر aṯar pl. آثار āṯār track, trace, vestige; sign, mark; touch; impression, effect, action, influence (في on); tradition (relating the deeds and utterances of Mohammed and his Companions); work (of art, esp. of literature); ancient monument; آثار antiquities; remnants, vestiges; (religious) relics │علم الآثار ‘ilm al-a. archeology; دار الآثار museum of antiquities; لا اثر له (aṯara) ineffective, ineffectnal; بأثر رجعي (raj‘ī) with retroactive force (jur.); اصبح اثرا بعد عين aṣbaḥa aṯaran ba‘da ‘ainin to be destroyed, be wiped out, leave nothing but memory behind; اعاده اثرا بعد عين (a‘adahū) to destroy s.th. completely ; على اثره, في اثره (also fī iṯrihī) on his (its) track, at his heels, after him; immediately afterwards, presently, thereupon; ;‘11 j. immediately afterwards, presently\n\n\nاثر iṯra (prep.) immediately after, right after\n\n\nاثر aṯir egoistic, selfish"
}