{
  "arabic": "اخذ",
  "definition": "اخذ aḳaḍa u (aḳḍ) to take (من هـ s.th. from or out of): to take (هـ s.th.) along: to get, receive, obtain (من هـ s.th. from); to take up, seize (هـ s.th.); to grab (ب s.o., s.th.), take hold of (ب): to perceive, notice (ه s.o., said of the eye); to gather, understand, infer, deduce (من هـ s.th. from), read (هـ s.th.) between the lines (من of); to grip, captivate, thrill, spellbind (ب s.o.); to take up, acquire, make one‘s own (ب s.th., e.g., a method); to keep, adhere (ب to), observe, take over, adopt, embrace, follow, copy, imitate (ب s.th.); to accept (ب s.th.); to take, lead (الى ب s.o. to); to admonish, urge, drive (ب ه s.o. to do s.th.); to enjoin, impose (ب ه on s.o. s.th.); to take away (ه على from s.o. s.th.), strip, deprive (ه على s.o. of), cut off, bar (ه على s.o. from); to reproach, hlame (ه على s.o. for); to hold against s.o. (على) that ... (ان), fix the blame (على on s.o., ان for the fact that); to obligate (ب على s.o. to); to learn (على or عن from s.o., هـ s.th.), acquire knowledge (على or عن from s.o.), أخذ العلم عنه (‘ilm) to study under s.o.; to begin, start (في or ب with s.th. or s.th., with foll. imperf.: to do s.th.), prepare, set out, be about (في or ب to do s.th.) │ أخذ أبهته (uhbatahū) to make preparations, prepare o.s., get ready; أخذ مأخذ فلان (ma’ḳad) to adopt the same course as s.o. else, follow s.o.’s example; أخذ منه مأخذا to seize s.o., take possession of s.o. (a sensation, or the like); أخذ مجراه (majrāhu) to take its course; أخذ مجلسه (majlisahū) to take one‘s seat, sit down; أخذ خذره (ḥidrahū) to be on one‘s guard; أخذه بالحسنى (ḥusnā) to be friendly, be nice to s.o.; أخذ بخاطره (bi-ḳāṯirihī) to show o.s. complaisant toward s.o., try to please s.o.; أخذ بذنبه (bi-danbihi) to punish s.o. for his offense; أخذ رأيه (ra‘yahū) to ask s.o.’s opinion, consult s.o.; أخذ الرأي عليه (uḳida r-ra‘yu) the matter was put to a vote; أخذ بأسباب (bi-asbābi) to embrace, adopt s.th., e.g., أخذ بأسباب الحضارة الأروبية (ḥaḍāra) to adopt European culture; أخذ بالشدة (šidda) to deal with s.o. severely, give s.o. a rough time; أخذ عليه طريقه to obstruct s.o.’s way, hinder s.o. from moving on; أخذ على عاتقه to shoulder s.th., take s.th. upon o.s.; أخذ العدة ل (‘udda) to prepare, set out, get ready to do s.th.; أخذ عليه عهدا (‘ahdan) to put s.o. under an obligation, impose a commitment on s.o.; أخذ على (حين) غرة uḳida ‘alā (ḥīni) girratin to be taken by surprise, be caught unawares; أخذ بالمقابلة (muqābala) to repay like for like; شيء يأخذ القلوب s.th. which captivates the heart, a fascinating, thrilling thing; أخذنا المطر (maṯarū) we got caught in the rain; أخذ بناصره (bi-nāṣirihi) to help s.o., stand by s.o., take care of s.o., look after s.o.; أخذ نفسه (nafasahū) to draw breath; أخذ عليه أنفاسه to take s.o.’s breath away; أخذ النوم (naum) sleep overwhelmed him; أخذ بيده (bi-yadihī) to help s.o., stand by s.o. <b>II</b> to lay under a spell, enchant, bewitch (ه s.o.) <b>III</b> to censure, blame (ب, على ه s.o. for s.th.); to punish (ب, على ه s.o. for); to hold s.th. (على) against s.o. (ه), resent (على s.th. ه, in s.o.)│ لا تؤاخذني lā tu’āḳidnī pardon me! forgive me! no offense, I hope! <b>VIII</b> اتخذ ittaḳada to take (ه s.th.); to take on, assume (هـ s.th.); to take up, occupy (هـ s.th.); to pass, adopt (هـ e.g., a resolution); to take, single out, have in mind (هـ هـ, ه ه s.o. or s.th. as); to make use (هـ of s.th.), use (هـ s.th.); to imitate, affect (هـ e.g., s.o.’s manner of speaking); to make (من هـ s.th. out of s.o. or s.th.)│ اتخذ شكلا (šaklan) to take on a form or shape; اتخذ موقفا (mauqifan) to take an attitude, assume a position; اتخذ التدابير الازمة to take the necessary measures; اتخذ قرارا (qarāran) to pass or adopt a resolution; اتخذ المواقع الجديدة to take up new positions (troops)\n\n\nأخذ aḳd acceptance, reception; seizure; taking out, taking away, removal, etc.│ أخذ الرأي a. ar-ra‘y voting, vote; أخذ ورد (wa-radd) discussion, debate, dispute, argument; شيء لا يقبل أخذا ولا ردا (yaqbalu) an indisputable matter; أخذ وعطاء (wa-‘aṯā’) give-and-take; traffic, trade; dealings, relations (esp. business, commercial); discussion, debate; fight, battle\n\n\nأخذ ma’ḳūd taken, seized; taken by surprise, caught, trapped; surprised; taken (ب with), fascinated (ب by); مأخوذ به in force, valid"
}