{
  "term": "بعد",
  "previous_term": "منبعج",
  "next_term": "بعدئذ",
  "definition": "بعد ba‘uda u (bu‘d) to be distant, far away, far off; to keep away, keep one’s distance (عن from); to go far beyond (عن), exceed by far (عن s.th.); to be remote, improbable, unlikely│بعد به عن he kept him away from; لا يبعد ان it is not unlikely that ... <b>II</b> to remove (ه s.o.); to banish, exile, expatriate (ه s.o.) <b>III</b> to cause a separation (بين between)│باعد بين فلان وبين الشيء to prevent s.o. from attaining s.th.; باعد بين اجفانه (ajfānihī) to stare wide-eyed <b>IV</b> to remove (هـ s.th.); to take away (هـ s.th.); to eliminate (هـ s.th.), do away with (هـ); to send away, dismiss (ه s.o.); to expatriate, banish, exile (ه s.o.); to exclude, make unlikely, improbable, impossible (هـ s.th.); to go or move far away; to go very far (فى in or with s.th.) <b>VI</b> to be separated, lie apart, lie at some distance from one another; to separate, part company, become estranged; to move away, go away, withdraw, depart (عن from); to keep away, keep one’s distance (عن from); to quit, leave, avoid (عن s.th.); to follow in regular intervals <b>VIII</b> to move or go away; to keep away, withdraw (عن from); to quit, leave, avoid (عن s.th.); to leave out of consideration, disregard (عن s.th.) <b>X</b> to single out, set aside (هـ s.th.); to think remote, farfetched (هـ s.th.); to regard as unlikely (هـ s.th.); to disqualify (ه s.o.)\n\n\nبعد bu‘d remoteness, farness; (pl. ابعاد ab‘ād) distance; dimension; interval (mus.)│ على بعد and على البعد in the distance, far off; على بعد مئة متر at a distance of 100 meters; عن بعد and من بعد from a distance, from afar; ذو ثلاثة ابعاد three-dimensional; قياس الابعاد qiyās al-a. linear measure; بعد الهمة b. al-himma high aspirations, loftiness of purpose; بعد الشقة b. aš-šiqqa wide interval, wide gap; بعد الصيت b. aṣ-ṣīt renown, fame, celebrity; بعد الصوت b. aṣ-ṣaut do.; بعد النظر b. an-naẓar far sightedness, foresight; بعدا bu‘dan li away with ... !\n\n\nبعد ba‘du then, thereupon; afterwards, later, after that, in the following; still, yet│ فيما بعد afterwards, later; اما بعد see 1اما; هو بعد صغير he is only a small boy, be is still young; لم يأت بعد (ya’ti) he hasn’t come yet\n\n\nبعد ba‘da (prep.) after; in addition to, beside; aside from│ بعد كونه ... (kaunihī) aside from the fact that he is ... ; بعد ذلك afterwards, after that, later (on); besides, moreover; بعد ذاك besides, moreover; بعد ان ba‘da an (conj.) after; اذ (id), بعد ما and من بعد ما (ba‘di) do.; سفه ما بعده سفه (safahun) the height of stupidity"
}