{
  "term": "بلغ",
  "previous_term": "بلعم",
  "next_term": "سمعا لا بلاغا",
  "definition": "بلغ balaga u (بلوغ bulūg) to reach (ه s.o. هـ s.th.), get (هـ, ه to), arrive (هـ at); to come, amount (هـ to), be worth (هـ so and so much); to come to s.o.’s (ه) ears; to attain puberty (boy); to ripen, mature (fruit, or the like); to come of age; to exhaust, wear out (من s.o.); to act (من upon s.o.), have its effect (من on), affect (من s.o.); to go far (فى, من in s.th.), attain a high degree (فى, من of s.th.)│ بلغ به الىto make s.o. or s.th. get to or arrive at, lead or take s.o. or s.th. to, get s.o. or s.th. to the point where, بلغ به الترنح ان (tarannuḥ) he began to reel so violently that ... ; بلغ الامر مبلغ الجد (mablaga l-jidd) the matter became serious; بلغ السيل الزبى b. s-sailu z-zubā the matter reached a climax, things came to a head; بلغ مبلغ الرجال (mablaga r-rijāl) to be sexually mature, attain manhood, come of age; بلغ اشده (ašuddahū) to attain full maturity, come of age; to reach its climax; بلغ فى الشيء مبلغا (mablagan) to attain a high degree of s.th.; حين بلغت بذكرياتي هذا المبلغ (ḥīna, dikrayātī, mablaga) when I had come to this point in my reminiscences; بلغ منه كل مبلغ (kulla mablagin) to work havoc on s.o.; بلغ منتهاه (muntahāhū) to reach its climax, come to a head <b>II</b> to make (ه s.o.) reach or attain (هـ s.th.); to take bring (الى هـ s.th. to s.o.) see that s.th. (هـ) gets (الى to); to convey, transmit, impart, communicate, report (هـ ه to s.o. s.th.); to inform, notify (هـ ه s.o. of s.th.), tell, let know (هـ ه s.o. about); to report (عن about), give an account of (عن); to inform (عن against s.o.), report, denounce (عن s.o.)│ بلغ رسالة to fulfill a mission, بلغه سلامى ballighu salāmī give him my best regards! <b>III</b> to exaggerate (فى in s.th.); to overdo. do too long (فى s.th.); to go to greatest lengths, do one’s utmost (فى in) <b>IV</b> to make (هـ, ه s.o., s.th.) reach or attain (الى s.th.); to make (هـ s.th.) amount (الى to), raise (هـ an amount, a salary, الى to); to inform, notify (ب or عن s.o. of s.th.), tell, let know (ب or عن ه s.o. about); to announce, state, disclose (هـ s.th.); to inform (عن against s.o.), report, denounce (عن s.o.)│ابلغ البوليس ب to report s.th. to the police <b>V</b> to content o.s., be content (ب with); to eke out an existence; to still one’s hunger (ب with), eat (ب s.th.): to b. delivered, be transmitted"
}