{
  "term": "بين",
  "previous_term": "بيمارستان",
  "next_term": "ما بين",
  "definition": "بان (بين) bāna i (بيان bayān) to be or become plain, evident, come out, come to light; to be clear (ل to s.o.); (بين bain, بينونة bainūna) to part, be separated (من from) <b>II</b> to make clear, plain, visible, evident (هـ s.th.); to announce (هـ s.th.); to state (هـ s.th.); to show, demonstrate (هـ s.th.); to explain, expound, elucidate (هـ s.th.), throw light (هـ on) <b>III</b> to part, go away (ه from), leave (ه s.o.); to differ, be different (هـ, ه from), be unlike s.th. (هـ); to contradict (هـ s.th.), be contrary (هـ to); to conflict, be at variance, be inconsistent (هـ with s.th.) <b>IV</b> to explain, expound, elucidate (ل هـ s.th. to s.o.); to separate, sift, distinguish (من هـ s.th. from); to be clear, plain, evident <b>V</b> to be or become clear, intelligible (ل to s.o.); to turn out, prove in the end, appear, become evident; to follow (من from), be explained (من by); to be clearly distinguished (من from); to seek to ascertain (هـ s.th.), try to get at the mct8 (هـ of); to eye or examine critically, scrutinize (هـ, ه s.o., s.th.); to look, peer (هـ at); to see through s.th. (هـ), see clearly, perceive, notice, discover, find out (هـ s.th.); to distinguish (من هـ s.th. from) <b>VI</b> to differ, be different, be opposed, be contrary; to vary greatly, differ widely; to vary, differ, fluctuate (بين between two amounts or limits) <b>X</b> to be or become clear, plain, evident; to Bee, know, perceive, notice (هـ s.th.); pass. ustubīna to follow clearly, be clearly seen (من from)\n\n\nبين bain separation, division; interval; difference│ذات البين enmity, disunion, discord; فى البين meantime, meanwhile\n\n\nبين baina (prep.) or فيما بين fī-ma b. between; among, amidst│بين – و – either -- or, partly -- partly, e.g., كان القوم بين صامت ومتكلم (ṣāmitin wa-mutakallimin) the crowd was divided among those who were silent and those who talked; بين يديه (yadaihi) in front of him, before him, in his presence; with him. on him, in his possession, e.g., لا سلاح بين يديه (silāḥa) he hasn’t got a weapon on him, he is unarmed; فيما بين ذلك meanwhile, in the meantime; فيما بينى وبين نفسى in my heart, at heart, inwardly; بين ذراعيه in his arms; من بينهم min bainihim from among them, from their midst; بين بين something between, a cross, a mixture, a combination; neither good nor bad, medium, tolerable; شيء بين بين something between, a cross, a mixture, a combination; بين وقت وآخر (waqt, āḳar), بين فترة وأخرى (fatra, uḳrā) at times, from time to time\n\n\nبين bayyin clear, plain, evident, obvious, patent; (pl. ابنياء abyinā’2) eloquent"
}