{
  "term": "تبع",
  "previous_term": "تبريز",
  "next_term": "تبعى",
  "definition": "تبع tabi‘a a (taba‘,تباعة tabā‘a) to follow, succeed (ه s.o., هـ s.th.), come after s.o. or s.th. (هـ, ه); to trail, track (هـ, ه s.o., s.th) go after s.o. or s.th. (هـ, ه); to walk behind s.o. (ه); to pursue (هـ s.th.); to keep, adhere, stick (هـ to s.th.), observe (هـ s.th; to follow, take (هـ a road), enter upon (هـ a road or course); to comply (هـ with s.th.); to belong, pertain (هـ to); to be subordinate, be attached (ه to s.o.), be under s.o.’s (ه) authority or command, be under s.o. (ه)│تبع الدروس (durūsa) to attend classes regularly <b>III</b> to follow (هـ, ه s.o. s.th.; also = to keep one‘s mind or eyes on, e.g., on a development); to agree, concur (ه with s.o., على in s.th.), be in agreement or conformity (هـ, على with); to pursue, chase, follow up (ه s.o., هـ s.th.); to continue (هـ s.th.; سيره sairahū on one’s way), go on (هـ with or in) <b>IV</b> to cause to succeed or follow (in time, rank, etc.); to place (ه s.o.) under s.o.’s (ه) authority or command, subordinate (ه ه to s.o. s.o., هـ هـ to s.th. s.th.) <b>V</b> to follow (هـ s.th., esp. fig.: a topic, a development, the news, etc., = to watch, study); to pursue, trail, track (هـ, ه s.o., s.th.); to trace (هـ s.th.); to be subordinate (هـ, ه to), be attached (ه to s.o.) <b>VI</b> to follow in succession, be successive or consecutive, come or happen successively; to form an uninterrupted sequence <b>VIII</b> to follow, succeed (ه s.o., هـ s.th.), come after (هـ, ه); to make (هـ s.th.) be succeeded or followed (ب by s.th. else); to prosecute (ه s.o.), take legal action (ه against); to follow, obey, heed, observe, bear in mind (هـ s.th.); to pursue (هـ s.th.); to examine, investigate, study (هـ s.th.); pass. uttubi‘a to have or find followers, adherents (على for s.th., e.g., for an idea)│اتبع سياسة (siyāsatan) to pursue a policy; اتبع يمينه (yamīnahū) to keep (to the) right <b>X</b> to make (ه s.o.) follow, ask (ه s.o.) to follow; to seduce (ه s.o.); to have as its consequence, engender, entail (هـ s.th.); to subordinate to o.s., make subservient to o.s. (هـ s.th.)\n\n\nتبع taba‘ succession; subordinateness, dependency: following. Followers; subordinate, subservient (ل to s.th.): بالتبع successively, consecutively; تبعا ل taba‘an li according to, in accordance with, pursuant to, in observance of; due to, in consequence of, as the result of; (pl. اتباع atbā‘) follower, companion, adherent, partisan; subject, national, citizen; appertaining, appurtenant, pertinent, incident"
}