{
  "arabic": "جرى",
  "definition": "جرى jarā i (jary) to flow, stream (water); to run; to hurry, rush; to slow (wind); to take place, come to pass, happen, occur; to be under way, be in progress, be going on (work); to befall (ل s.o.), happen (ل to); to be in circulation, circulate, be current; to wend one’s way (الى to), head (على for); to proceed (على in accordance with); to follow (مع s.th.), yield, give way (مع to, e.g., to a desire); to entail (ب s.th.); (with وراء) to run or be after s.th., seek to get s.th.│ جرى له حديث معhe had a talk with; جرى مجراه (majrāhū) to take the same course as, be analogous to, follow the same way as, proceed or act in the same manner as; جرى منه الشيء مجرى الدم (minhu š-šai’u majrā d-dam) it had become second nature to him; جرى على الالسن (alsun) to circulate, make the rounds (rumor); 121 جرى على كل لسان to be on everyone’s lip; جرى على قلمه (qalamihī) to come to s.o.’s pen (e.g, a poem); جرى على خطة (ḳiṯṯa) to follow a plan; ما يجرى عليه العمل (‘amalu) the way things are handled, what is customary practice; جرى به العمل to be in force, be valid, be commonly observed (law, custom); جرت العادة ب to be customary, be common practice, be a common phenomenon, have gained vogue; جرى بالعادة على to do s.th. customarily, se in the habit of doing s.th.; جرت بذلك عادتهم that was their habit <b>II</b> to cause to run│جرى ريقه (rīqahū) to make s.o.’s mouth water <b>III</b> to concur, agree, be in agreement (ه with s.o., فى in s.th.); to keep pace, keep up (ه with s.o.; also intellectually); to be able to follow (ه s.o.); to go (along) (هـ with); to adapt o.s. adjust, conform (هـ to), be guided (هـ by) <b>IV</b> to cause to flow, make flow (هـ s.th.); to cause to run, set running (هـ, ه s.o., s.th.); to make (هـ s.th.) take place or happen, bring about (هـ s.th.); to carry out, execute, enforce, put into effect, apply (هـ s.th., e.g., rules, regulations); to carry out, perform (هـ an action); to Set going, set in motion (هـ a project), launch (هـ an undertaking); to channel (على or ل هـ s.th. to), bestow, settle (على or ل هـ s.th. upon s.o.); to impose, inflict (على هـ s.th., a penalty, on s.o.)│ اجرى تجربة (tajribatan) to carry out an experiment; اجرى تحقيقا to conduct an investigation; اجرى له اعانة (i‘ānatan) to grant s.o. a subsidy; اجراه مجرى (majrā, with foll. genitive) to treat s.th. in the same manner as, put s.th. on equal footing with\n\n\nجرى jary course│جريا على jaryan ‘alā in accordance with, according to"
}