{
  "term": "جوز",
  "previous_term": "جوري",
  "next_term": "جواز",
  "definition": "جاز (جوز) jāza u (جواز jawāz, مجاز majāz) to pass, come, travel (هـ through); to pass (هـ an examination, a test); to be allowed, permitted, permissible; to be possible, conceivable; to work, succeed (عليه with s.o.; deceit, artifice) │جازت عليه الحيلة (ḥīla) the trick worked with him, he fell for the trick <b>II</b> to permit, allow (هـ s.th.); to approve (هـ of), sanction, warrant, authorize (هـ s.th.) <b>III</b> to pass (هـ s.th. or by s.th.), go or walk past s.th. (هـ); to go beyond s.th. (هـ), overstep, cross, leave behind (هـ s.th.), also, e.g., جاوز الثلاثين من العمر (‘umr) he is past thirty; to exceed, surpass (هـ s.th.); to pass over s.th. (عن), disregard (عن s.th.), pay no attention (عن to); to let (عن s.th.) go unpunished; to give up, forgo, relinquish (عن s.th.) <b>IV</b> to traverse, cross (هـ s.th., الى on the way to); to permit, allow (هـ ل to s.o. s.th.); to authorize (هـ ل s.o. to do s.th., also هـ ه); to license (هـ s.th.); to approve, confirm, endorse (هـ a decision, a judgment); to approve (هـ of s.th.), sanction (هـ s.th.) <b>V</b> to tolerate, suffer, bear <b>VI</b> to pass (هـ s.th. or by s.th.), go or walk past s.th. (هـ); to go beyond s.th. (هـ), overstep, cross, leave behind (هـ s.th.); to exceed, surpass (هـ s.th., also على); to go too far, overstep all bounds, encroach, make inroads; to pass over s.th. (عن), disregard (عن s.th.) pay no attention (عن to); to give up, forgo, re1inquish (A s.th.); to refrain from) <b>VIII</b> to pass, run, go (هـ through), cut across (هـ); to cross (هـ a border, a street, a mountain range); to traverse (هـ a country or sea); to cover (هـ a distance); to pass (هـ through the mind; said of ideas, thoughts); to go (هـ through hard times or a crisis); to surmount, overcome (هـ a crisis) <b>X</b> to deem permissible (هـ s.th.); to ask permission\n\n\nجوز jauz pl. اجواز ajwāz heart, center (of a desert, of a large area, etc.) │ فى اجوازamid, in the middle of, in; فى اجواز الفضاء (faḍā’) in space\n\n\nجوز = زوج <b>II</b> to give in marriage\n\n\nجوز jauz pl. اجواز ajwāz = زوج couple\n\n\nجوز jauz (coll.; n. un. ة pl. -āt) walnut │جوز الطيب j. aṭ-ṭīb nutmeg; جوز القيء j. al-qai’ nux vomioa; جوز الهند j. al-hind, جوز هندي (hindī) coconut; جوز القز j. alqazz cocoon, chrysalis of the silkworm"
}