{
  "term": "حب",
  "previous_term": "حانوت",
  "next_term": "حبي",
  "definition": "حب ḥabba i (ḥubb) to love, like <b>II</b> to evoke (الى in s.o.) love or a liking (ه, هـ for s.th. or s.o.), make (الى s.o.) love or like (ه, هـ s.th. or s.o.); to endear (الى هـ s.th. to s.o.), make (هـ s.th.) dear, lovable, attractive (الى for s.o.), make (هـ s.th.) palatable, acceptable (الى to s.o.); to urge (الى هـ s.th. on s.o.), suggest (الى s.th. to s.o.) <b>IV</b> (حب ḥubb, محبة maḥabba) to love, like (هـ, ه s.o., s.th.); to wish, want, or like, to do s.th. (ان)│احب ان uḥibbu an I should like to ... ; احب له ان to like about s.o. that he ... ; لا يحب الخير له (ḳaira) he doesn’t want him to be happy, he grudges him everything <b>V</b> to show love, reveal one’s affections (الى to s.o.); to endear o. s. (الى to s.o.), make o.s. popular, ingratiate o.s. (الى with s.o.); to court, woo (الى a woman) <b>VI</b> to love one another <b>X</b> to like (هـ s.th.); to deem (هـ s.th.) desirable, recommendable; to prefer (على هـ s.th. to s.th. else)\n\n\nحب ḥubb love; affection, attachment │حب الذات ḥ. ad-dāt self-love, amour-propre; حب الاستطلاع curiosity, inquisitiveness; حب الوطن ḥ. al-waṭan patriotism; حبا ل (ḥubban) out of love or affection for, out of friendship for; حبا في in the desire to …\n\n\nحب ḥibb pl. احباب aḥbāb darling, dear, dearest (one)\n\n\nحب <b>II</b> to produce seed, go to seed (plant); to bear seed (grain); to granulate, become granulated; to granulate (هـ s.th.) <b>IV</b> to produce seed\n\n\nحب ḥabb (coll.; n. un. ة) grains; seed; -- pl. حبوب ḥubūb grain, cereals, corn; seed(s); grains, kernels; granules; pellets; pills, pastilles; berries; acne, pustules, pimples│حب العزيز chufa (Cyperus esculentus L.; bot.); حب الفقد ḥ. al-faqad chaste tree (Vitex agous castus L.; bot.); croton seeds (seeds of Croton tiglium; bot.); (magr.) cherries; حب الهال ḥ. al-hāl and (حبهان) حب الهان ḥ. al-hān cardamom (Amomum cardamomum L.; bot.); حب الغمام ḥ. al-gamām hail, hail-stones"
}