{
  "term": "حد",
  "previous_term": "حخام",
  "next_term": "الى غير حد",
  "definition": "حد ḥadda u (ḥadd) to sharpen, hone (هـ a knife); to delimit, delineate, demarcate, mark off, stake off (هـ land, من from); to set bounds (هـ to s.th.), limit, restrict, confine (هـ s.th.); to impede, hinder, curb, check (من or هـ s.th.); -- i (حدة ḥidda) to become furious, angry (على at): -- i u (حداد ḥidād) to wear mourning, mourn (على the deceased) <b>II</b> to sharpen, hone (هـ a knife); to forge (هـ s.th.; syr.); to delimit, demarcate (هـ s.th.); to set bounds (هـ to s.th.), circumscribe, mark off, delineate sharply; to limit, restrict, confine (من or هـ s.th.); to determine, appoint, assign, schedule, lay down, set down, establish (هـ s.th.); to fix). e.g., prices); to define (هـ s.th.) │حدد بصره (baṣarahū) to dart sharp glances; to scrutinize (في s.th.), look sharply (في at s.th.) <b>III</b> to oppose (هـ, ه s.o., s.th.) act contrary (هـ, ه to s.o., to s.th.), contravene, counteract, violate (هـ s.th.) <b>IV</b> to sharpen, make sharp (هـ s.th.) │ احد النظر الى (naẓar) to look sharply at, stare at; احد بصره (baṣarahū) to dart sharp glances; to scrutinize (في s.th.), look sharply (في at s.th.); احد من بصره (baṣarihī) to glance sharply; -- to put on garments of mourning <b>V</b> to be delimited, be delineated, be bounded, be circumscribed; to be determined, be established, be set down, be scheduled, be fixed; to by defined, be definable <b>VIII</b> to be or become angry; to become infuriated, be furious (على at), be exasperated (على with); to be agitated, be upset, be in a state of commotion\n\n\nحد ḥadd pl. حدود ḥudūd (cutting) edge (of a knife, of a sword); edge, border, brink, brim, verge; border (of a country), boundary, borderline; limit (fig.), the utmost, extremity, termination, end, terminal point, terminus; a (certain) measure, extent, or degree (attained); (math.) member (of an equation), term (of a fraction, of a proportion); divine ordinance, divine statute; legal punishment (Isl. Law) │لحد li-ḥaddi or الى حد until, till, up to, to the extent of, الى حد الآن, لحد الآن li-ḥ. l-āna up to now, so far; الى حد ما (ḥaddin) to a certain degree, to a certain extent; الى حد كبير, الى حد بعيد to a considerable extent or degree, considerably, extensively; الى أي حد (ayyi ḥaddin) how far, to what degree or extent; لا حد له (ḥadda) boundless, infinite, unbounded, unlimited; بلا حد bi-lā ḥaddin,"
}