{
  "arabic": "حسن",
  "definition": "حسن ḥasana u (ḥusn) to be handsome, beautiful, lovely, nice, fine, good; to be expedient, advisable, suitable, proper, fitting; to be in a proper state, be in a desirable condition │ان حسن لديك in ḥ. ladaika if you like it, if it seems all right to you; يحسن بك ان it is to your advantage that you ... ; you ought to …; حسن استعداده ل he was all willing to … <b>II</b> to beautify, embellish (هـ s.th.); to adorn, decorate (هـ s.th.); to improve, put into better form, ameliorate, better (هـ s.th.); to make a better presentation (هـ of s.th.); to present in a favorable light, depict as nice or desirable (ل هـ s.th. to s.o.; to sugar-coat, make more palatable (هـ s.th. unpleasant, s.th. disadvantageous) <b>III</b> to treat (ه s.o.) with kindliness <b>IV</b> to do right, act well; to do (هـ s.th), well, expertly, nicely; to know (هـ how to do s.th.), be able (هـ to do s.th.); to master (هـ s.th.), have command (هـ of s.th.), be proficient (هـ in s.th.; a language, an art, a handicraft, etc.), be conversant (هـ with s.th.); to do good, be charitable; to do favors, do good (الى or ب to s.o.), do (ب or ب s.o.) a good turn, be nice, friendly (الى or ب to s.o.); to give 177 alms, give charity (الى to s.o.) │ما احسنه mā aḥsanahū how good he is! how handsome he is! احسنت aḥsanta well done! bravo! احسن الالمانية (almānīya) to master the German language, know German well; احسن التسديد to aim well or accurately; احسن مشورته (mašūratahū) to give good advice; احسن الظن ب (ẓanna) to have a good opinion of ... , judge s.th. favorably; احسن معاملته (mu‘āmalatahū) to treat s.o. well <b>V</b> to become nicer, more handsome, more beautiful; to improve, ameliorate, get better <b>X</b> to deem (هـ s.th.) nice, etc., or good; to regard (هـ s.th.) as right, advisable or appropriate; to approve (هـ of s.th.), sanction, condone (هـ s.th.); to come to like, to appreciate (هـ s.th.), find pleasure (هـ in s.th.); also = IV: استحسن الانجليزية (ingilīzīya) to know English well; pass. ustuḥsina to be good, commendable, advisable\n\n\nحسن ḥusn beauty, handsomeness, prettiness, loveliness; excellence, superiority, perfection │لحسن الحظ fortunately; حسن السلوك good manners, good behavior; good conduct; حسن السير والسلوك (ḥ. as-sair) an irreproachable life; حسن التصرف ḥ. al-taṣarruf discretion, individual judgment; حسن الظن good opinion, favorable judgment; حسن التعبير euphemism; حسن القصد (النية) ḥ. al-qaṣd (an-nīya) good intention, good will, good faith; حسن يوسف ḥ. yūsuf beauty spot, patch; ست الحسن a kind of bindweed (Convolvulus cairicus L.; bot.); deadly nightshade, belladonna\n\n\nحسن ḥasan pl. حسان ḥisān beautiful, handsome, lovely; pretty, nice; good, agreeable; excellent, superior, exquisite; حسنا ḥasanan well, splendidly, excellently, beautifully; الحسان the ladies; -- high sandhill"
}