{
  "arabic": "حسب",
  "definition": "حسب ḥasaba u (ḥasb, حساب ḥisāb, حسبان ḥisbān, ḥusbān) to compute, reckon, calculate; to count; to charge, debit (على هـ s.th. to s.o., to s.o.’s account); to credit (ل هـ s.th. to s.o., to s.o.’s account) │ حسب حسابه (ḥisābahū) to take s.th. or s.o. into account or into consideration, reckon with s.th. or s.o., count on s.th. or s.o.; حسابا ل حسب (ḥisāban) do.; to attach importance to s.o. or s.th.; حسب الف حساب ل (alfa) to hove a thousand apprehensions about …; -- ḥasiba a i (حسبان ḥisbān, محسبا maḥsaba, maḥsiba) to regard (ه ه s.o. as), consider, deem (ه ه s.o. to be …); to think, believe, suppose, assume; to consider, regard (من ه s.o. as belonging to), count (من ه s.o. among); to see (هـ في in s.o. s.th.); -- ḥasuba u (ḥasab, حسابة ḥasāba) to be of noble origin, be highborn; to be highly esteemed, be valued <b>III</b> to settle an account, get even (with s.o.); to call (ه s.o.) to account, ask (ه s.o.) for an accounting; to hold (ه s.o.) responsible, make (ه s.o.) answerable │ حاسب على نفسه to be careful, be on one’s guard <b>V</b> to be careful, be on one’s guard; to take precautions; to seek to know, try to find out (هـ s.th.) <b>VI</b> to settle a mutual account <b>VIII</b> to debit or credit; to take into account, take into consideration (ب or هـ s.th.); to reckon (ب or هـ with); (to anticipate a reward in the hereafter by adding a pious deed to one’s account with God -- such as resigning in God’s will at the death of a relative; hence:) احتسب ولدا waladan) to give a son, be bereaved of a son; احتسب عند الله الشيء to sacrifice s.th. in anticipation of God’s reward in the hereafter; to charge (على هـ s.th. for); to think, believe, suppose; to take (ه ه s.o. for or to be …); to be content, content o.s.(ب with); to disapprove (على هـ s.th. in s.o.), take exception (على هـ to s.th. in s.o.), reject (على هـ s.th. in s.o.); to call (على s.o.) to account, ask (على s.o.) for an accounting\n\n\nحسب ḥasb reckoning, computing, calculation; thinking, opinion, view; sufficiency │حسبك (بحسبك) درهم ḥasbuka (bi-ḥasbika) dirhamun one dirham is enough for you; حسبك ان it suffices to say that …; you know enough when you hear that …; you need only ... ; بحسبك مقنعا ان (muqni‘an) it will be enough to convince you if …; وحسبك بهذا كله شرا (bi-hādā kullihī šarran) but enough of all these negative aspect! فحسب fa-ḥasb and that’s all, and no more, only (interchangeable with فقط)\n\n\nحسب ḥasab pl. احساب aḥsāb measure, extent, degree, quantity, amount; value; esteem, high regard enjoyed by s.o.; noble descent; ḥasaba (prep.), بحسب bi-ḥasabi and على حسب ‘alā ḥasabi according to, in accordance with, commensurate with, depending on"
}