{
  "term": "حضر",
  "previous_term": "حضيض",
  "next_term": "حضري",
  "definition": "حضر ḥaḍara u (حضور ḥuḍūr) to be present (هـ at), be in the presence (ه of s.o.); to 183 attend (هـ s.th.); to be present (هـ in s.o.’s mind), be readily recalled (ه by s.o.); to take part, participate (مجلسا majlisan in a meeting); to come, get (الى or هـ, ه to s.o., to a place), arrive (الى or هـ at a place); to visit (هـ a place), attend (هـ a public event), go (هـ to a performance, etc.); to appear (امام before a judge, etc., الى in, at), show up (الى in, at); to betake o.s., go (الى من from ... to); (حضارة ḥaḍāra) to be settled, sedentary (in a civilized region, as opposed to nomadic existence) <b>II</b> to ready, make ready, prepare (هـ s.th., also, e.g., as medicine = to compound), make, produce, manufacture (هـ s.th.); to study, prepare (هـ a lesson); to fetch, get, bring (ه s.o., هـ s.th.), procure, supply (هـ s.th.); to settle (ه s.o), make s.o. (ه) sedentary; to civilize (ه s.o., هـ s.th.) <b>III</b> to give a lecture, present s.th. in a lecture (ه to s.o.); to lecture, give a course of lectures <b>IV</b> to fetch, get, bring (هـ, ه s.o., s.th.), procure, supply (هـ s.th.); to take (ه s.o., هـ s.th., الى to a place) │احضره معه to have s.th. with one, bring s.th. along <b>V</b> to prepare o.s., ready o.s., get ready (ل for); to be ready, prepared; to become settled, be sedentary in a civilized region; to be civilized, be in a state of civilization; to become urbanized, become a town dweller <b>VIII</b> to come (ه to s.o.), be in the presence (ه of s.o.); to live in a civilized region; pass. ustuḥḍira to die <b>X</b> to have s.th. (هـ) brought, to call, send (هـ, ه for s.o., for s.th.), have s.o. (ه) come; to summon (ه s.o.); to fetch, procure, supply, get, bring (هـ s.th.); to conjure, call up, evoke (هـ a spirit); to visualize, envision, call to mind (هـ s.th.); to carry with o.s., bring along (هـ s.th.); to prepare (هـ, ه e.g., a medicinal preparation)\n\n\nحضر ḥaḍar a civilized region with towns and villages and a settled population (as opposed to desert, steppe); settled population, town dwellers (as opposed to nomads)"
}