{
  "arabic": "حفظ",
  "definition": "حفظ ḥafiẓa a (ḥifẓ) to preserve (هـ s.th.); to protect, guard, defend (ه s.o.): to observe, bear in mind (هـ s.th.), comply (هـ with s.th.), be mindful, be heedful (هـ of s.th.); to keep up, maintain, sustain, retain, uphold (هـ s.th.); to hold, have in safekeeping (هـ s.th.), take care (هـ of s.th.); to keep, put away, save, store (هـ s.th); to conserve, preserve (هـ s.th.); to retain in one’s memory, remember, know by heart (هـ s.th.); to memorize, learn by heart, commit to memory (هـ s.th., esp. the Koran); to reserve (هـ لنفسه for o.s. s.th.): to stay, discontinue, suspend (التحقيق a judicial investigation; jur.) │حفظه الله may God protect him! حفظ بالبريد to hold in care of general delivery (هـ s.th.); يحفظ في البوسطة (yuḥfaẓu) in care of general delivery, poste restante; حفظ الوفاء ل (wafā’a) to be loyal to s.o., keep faith with s.o. <b>II</b> to have s.o. (ه) memorize (هـ s.th.) <b>III</b> to preserve, keep up, maintain, uphold, sustain (على s.th.); 188 to supervise, control (على s.th.), watch (على over s.th.); to watch out (على for), take care, be heedful, be mindful (على of), look (على after), attend, pay attention (على to); to keep, follow, observe, bear in mind (على s.th.), comply (على with), conform (على to) ; to protect, guard, defend (هـ and على, also عن s.th.) <b>IV</b> to vex, annoy, gall, irritate, hurt, offend (ه s.o.) <b>V</b> to keep up, maintain, preserve (ب s.th.); to observe, keep in mind (ب s.th.), be mindful, be heedful, take care (ب of s.th.), be concerned (ب with); to be cautious, be wary, be on one’s guard; to be reserved, aloof; to have reservations <b>VIII</b> to maintain, uphold (ب or هـ s.th., e.g., بحقوقه one’s rights); to keep up, maintain, retain (ب or هـ s.th., e.g., a posture, a characteristic); to take care, take over custody (ب of s.o.), protect, guard (ب s.o.); to defend (against encroachment), hold, maintain (ب a possession); to preserve, sustain, continue, keep up (ب s.th.); to hold, possess (ب s.th.); to put away, hold, have in safekeeping (ب s.th.), take care (ب of s.th.); to keep, retain (ب s.th.); احتفظ لنفسه to keep for o.s., appropriate, reserve for o.s. (ب or هـ s.th.), take complete possession (هـ of) <b>X</b> to ask s.o. (ه) to guard or protect (هـ or على s.th.); to entrust (على or هـ ه to s.o. s.th.), commit s.th. (على or هـ) to the charge of s.o. (ه)\n\n\nحفظ ḥifẓ preservation; maintenance, sustentation, conservation, upholding; protection, defense, guarding; custody, safekeeping. keeping, storage; retention; observance, compliance (with); memorizing, memorization; memory; (jur.) discontinuance, stay, suspension (of legal action, of a judicial investigation) │ حفظ الآثارpreservation of ancient monuments (Eg.); حفظ الصحة ḥ. aṣ-ṣiḥḥa hygiene, sanitation; رجال الحفظ police"
}