{
  "arabic": "حكم",
  "definition": "حكم ḥakama u (ḥukm) to pass judgment, express an opinion (على, في on s.th.), judge (على s.th., ب by, from); to decide, give a decision, pass a verdict, pass sentence (على on); to sentence (على s.o., ب to a penalty; said of the judge), impose, inflict (ب a penalty) on s.o. (على); to pronounce a verdict or judgment, deliver judgment, rule (ل in s.o.’s favor); to adjudicate, adjudge, award (ب ل to s.o. s.th.); to take (ب s.th.) as a standard or norm; to have judicial power, have jurisdiction, have authority (على and ه over), govern, rule, dominate, control (على or ه s.o.); to order, command (ب s.th.); to bridle, check, curb (ه, هـ s.th., s.o.) │ حكم عليه بالاعدام (ḥukima, i‘dām) he was sentenced to death; حكم بإدانته (bi-idānatihī) to convict s.o., find s.o. guilty (jur.); حكم ببراءته (bi-barā’atihi) to acquit s.o. (jur.) <b>II</b> to appoint (ه s.o.) as ruler; to choose (ه s.o.) as arbitrator, make (ه s.o.) the judge (في over or in s.th., بين between) <b>III</b> to prosecute (ه s.o.); to arraign, bring to trial, hale into court (ه s.o.); to interrogate, hear (ه s.o.) <b>IV</b> to make (هـ s.th.) firm, strong, sturdy, solid; to fortify (هـ s.th.); to strengthen, consolidate (هـ s.th.); to do well, do expertly, master (هـ field, work), be proficient (هـ in) │ احكم امره (amrahu) to do s.th. thoroughly, carefully, properly; احكم قفل الباب (qafla l-bāb) to lock the door firmly; احكم لغة (lugatan) to master a language <b>V</b> to have one‘s own way (في in), proceed (في with) at random, at will, handle (في s.th.) arbitrarily; to pass arbitrary judgment (في on); to make o.s. the judge (على of), pass judgment (على on); to decide (ب on); to rule, reign, hold sway (في over); to dominate, control (في s.th.), be in control, be in command (في of) <b>VI</b> to bring one another before the judge (الى الحاكم); to appeal (الى to) for a legal decision; to be interrogated, be heard (in court) <b>VIII</b> to have one’s own way (في in), proceed (في with, in s.th.) at will, at random, handle (في s.th.) arbitrarily, judge arbitrarily; to rule, reign, hold sway (على, في over); to be in control, be in possession (على of); to appeal (الى to) for a legal decision, seek a decision (الى from), have s.o. (الى) decide <b>X</b> to be strong, sturdy, solid, firm; to become stronger, be strengthened, be 195 consolidated; to take root, be or become deep-rooted, deep-seated, ingrained, inveterate, marked, pronounced (feeling, trait)\n\n\nحكم ḥukm pl. احكام aḥkām judgment, valuation, opinion; decision, (legal) judgment, verdict, sentence; condemnation, conviction; administration of justice; jurisdiction, legal consequence of the facts of a case (Isl. Law); regulation, rule, provision, order, ordinance, decree; judiciousness, wisdom, judgeship, command, authority, control, dominion, power; government, regime; pl. احكام statutes, by-laws, regulations, rules, provisions, stipulations, principles, precepts; حكما ḥukman virtually; legally │بحكم bi-ḥukmi by virtue of, on the strength of, pursuant to, by force of; في حكم as good as, all but, e.g., هو في حكم (fī ḥukm l-‘adam) it is as good as nothing, it is practically nonexistent; اصبح في حكم المقرر aṣbaḥa fī ḥukmi l-muqarrar it is all but decided, كان في حكم الشيء also: to be subject to s.th.; نزل على حكمه to give in, yield to s.o., حكم البراءة ḥ. al-barā’a acquittal, حكم حضوري (ḥuḍūrī) judgment delivered in the presence of the litigant parties, after oral proceedings (jur.), الحكم بالاعدام (i‘dām) death sentence; حكم غيابي (giyābī) judgment by default (jur.); الحكم الذاتي (dātī) self-determination, autonomy (pol.); الحكم الجمهوري (jumhūrī) the republican form of government, the republican regime; الحكم المطلق (muṭlaq) the absolute, i.e., authoritarian, regime, الحكم النهائي (niyābī) the parliamentary regime, parliamentarianism; لجنة الحكم lajna al-ḥ. board of examiners, review board; الاحكام العرفية (‘urfīya) martial law; احكام انتقالية (intiqālīya) provisional regulations (jur.); احكام ختامية (ḳitāmīya) final regulations (jur.); احكام خاصة (ḳāṣṣa) special regulations; لكل سن حكمه (sinn) every age has its own set of rules, must be judged by its own standards, للضرورة احكام (li-ḍ-ḍarūra) necessity has its (own) rules, (approx.: necessity knows no law)\n\n\nحكم ḥakam pl. حكام ḥukkām arbitrator, arbiter; umpire, referee"
}