{
  "term": "حل",
  "previous_term": "محكي",
  "next_term": "حلة",
  "definition": "حل ḥalla u (ḥall) to untie (هـ a knot), unbind, unfasten, unravel, undo (هـ s.th.); to solve (هـ a problem, a puzzle); to decipher, decode (هـ s.th.): to dissolve in water (هـ s.th.; chem.); to resolve (هـ s.th. into its components), analyze (هـ s.th.); to melt (هـ s.th.); to decompose, disintegrate (هـ s.th.); to disband, break up, dissolve (هـ an organization or party, parliament); to open, unpack (هـ a package, and the like); to loosen, relax (هـ s.th.); to release, set free, let go (هـ s.th., ه s.o.); to clear, exonerate, exculpate (من ه s.o. from), absolve (ه s.o., من from his sins; Ch,.); pass. ḥulla to be free; to be relaxed; -- i u (حلول ḥulūl) to dismount, alight, stop, halt; to settle down, stay (ب at a place, also في and هـ; على with s.o., at s.o.’s house), come (for a visit, على to); to take up residence (هـ in a place or country); to descend, come down; to descend (على upon s.o.; wrath); to overcome, overwhelm (على s.o.; sleep); to befall (ب and على s.o.; punishment, suffering), occur, happen (ب to s.o.); to become incarnate (في in s.o.; God); to set in, arrive, begin (time, season); -- i to pass into solution, dissolve: to fade (color); -- i (ḥill) to be allowed, permitted, permissible, lawful; to be due, payable (debt) │حل في منصب (manṣib) to take over or hold an office; حل محله (maḥallahū) to be in the right place; حل محل فلان, حل محل الشيء (maḥalla) to take the place of s.o. or s.th., replace, supersede s.o. or s.th., substitute for s.o. or s.th.; حلت في قلبه محلا (qalbihī) she held a place in his heart; حل محل التقدير لديه (maḥalla t-taqdīri ladaihi) to enjoy s.o.’s. high esteem; حل من نفوس القراء محل (min nufūsi l-qurrā’i maḥalla l-istiḥsān) to appeal to the readers, meet with the readers‘ approval <b>II</b> to dissolve, resolve (into its component parts), break up, decompose, analyze (هـ s.th.): to make a chemical analysis (هـ of s.th.): to be dissolvent, act as a solvent (هـ on; med.): to discharge, absolve, clear, exonerate, exculpate (ه s.o.); (تحلة taḥilla) to expiate an oath: to make permissible or lawful, legitimate, sanction, justify, warrant (هـ s.th.); to declare permissible or lawful, allow, permit (هـ s.th.) <b>IV</b> to discharge, release, absolve, disengage (من ه s.o. from); to declare (هـ s.th.) lawful, legally permissible, permit, allow (هـ s.th.); to cause to set in or occur, bring about, produce, cause to take root, establish, stabilize (هـ s.th.): to cause (هـ s.th.) to take or occupy the place (هـ of), shift, move, translocate (هـ هـ s.th., e.g., a tribe, to a place); to settle (بين هـ s.th. among) │احله محل (maḥallahū) to cause s.o. or s.th. to take the place of s.o. or s.th. else, replace s.o. or s.th. by, substitute s.o. or s.th. for, take s.o. or s.th. as substitute for; أحل الشيء محل العناية (maḥalla l-‘ināya) to pay attention to s.th., make s.th. one’s concern <b>V</b> to dissolve, melt, disintegrate; to disengage o.s., disassociate o.s., extricate o.s., free o.s. (من from) <b>VII</b> to be untied (knot); to be solved, be unraveled (problem); to be dissolved, be broken up, be disbanded (also, of an organization, a party, etc.); to dissolve, melt; to become .lock, limp, weak, loose, relaxed; to disintegrate; to melt away <b>VIII</b> to settle down (هـ at a place); to occupy (mil., هـ a territory); to assume, take over, occupy, hold, have (هـ a place, 198 a rank, an office) │احتل المكان الأول (al-makāna l-awwala) to occupy the foremost place; احتل أعماله (a‘mālahū) to take over s.o.’s functions <b>X</b> to regard (هـ s.th.) as permissible or lawful, think that one may do s.th. (هـ); to regard as fair game, as easy prey, seize unlawfully, misappropriate, usurp (هـ s.th.)\n\n\nحل ḥall pl. حلول ḥulūl untying, unfastening, undoing (of a knot); solution (of a problem, of a puzzle, etc.); unriddling, unraveling, explanation; solution (chem.); dissolution, disbandment, breaking up (of all organization, etc.), abolition, cancellation, annulment; release, freeing, liberation; decontrol, release, unblocking (e.g., of a blocked sum); discharge. clearing, exoneration, exculpation; absolution (Chr.) │قابل للحل soluble, solvable; O الحل الطيفي (ṭaifī) spectral analysis; اهل الحل والعقد ahl al-ḥ. wa-l-‘aqd or اهل الحل والربط (rabṭ) influential people, those in power; في حله وترحاله (tarḥālihī) in all his doings, in everything he did\n\n\nحل ḥill: (عن) كان في حل من (ḥillin) he was free to …, he was at liberty to ...; he had free disposal of ...; انت في حل من you’re free to ..., you may readily ..."
}