{
  "term": "حمل",
  "previous_term": "حماقة",
  "next_term": "حملة",
  "definition": "حمل ḥamala i (ḥaml) to carry, bear (هـ s.th.); to lift, pick up (هـ s.th. in order to carry it), load up and take along (هـ s.th.): to hold (هـ s.th., in one’s hand); to carry on or with one. take or bring along (هـ s.th.); to transport, carry, convey (هـ s.th.); to bring, take (الى or ل هـ s.th. to s.o.); to take upon o.s. (عن instead of or for s.o., هـ a burden), carry, assume (هـ the burden, عن of s.o. else), relieve (هـ عن s.o. from s.th.), take (هـ a burden, a grievance, etc.) from s.o. (عن); to extend, show, evince, cherish, ha.rbor (هـ a feeling, ل toward s.o.); to become or be pregnant (من by s.o.): to bear fruit (tree); to induce, cause, prompt, get (على ه s.o. to do s.th.), make s.o. (ه) do s.th. (على); to convert, bring around, win over (على رأيه ه s.o. to one’s opinion), convince (على رأيه ه s.o. of one’s opinion); to attack (على s.o.), also حمل حملة على (ḥamlatan) to launch or make an attack on; to know by beart (هـ a book); to relate, refer (على هـ s.th. to). bring (هـ s. th.) to bear (على upon s.th.), link, correlate, bring into relation (هـ s.th., على with); to trace, trace back (على هـ s.th. to); to ascribe, attribute, impute (على هـ s.th. to s.o.); to make (هـ a word) agree grammatically (على with another) │ حمل في نفسهto feel annoyed, be in a melancholy mood, feel blue; حمل على نفسه to pull o.s. together, brace o.s.; حمله على محمل (maḥmali) to take s.th. to mean …, interpret or construe s.th. in the sense of …, as if it were ...; حمله على غير محمل to misinterpret, misconstrue s.th.; حمله محمل الجد (maḥmala l-jidd) to take s.th. seriously, take s.th. at face value <b>II</b> to have or make (ه s.o.) carry or bear (هـ s.th.), load, burden, charge, task (هـ, ه s.o. or s.th. هـ with), impose (هـ ه on s.o. s.th.) <b>V</b> to hear, assume, take upon o.s. (هـ s.th., e.g., النفقات an-nafaqāt the expenses, المسؤولية al-mas’ūlīya the responsibility); to bear up (هـ under), bear, stand, sustain, endure, tolerate, stomach (هـ s.th.); to undergo, suffer (هـ s.th.); to be able to stand (ه s.o.) or put up (ه with s.o.); to set out, get on one’s way; to depart <b>VI</b> to maltreat, treat unjustly (على s.o.), be prejudiced, be biased, take sides (على against s.o.); to struggle to 206 one’s feet, rise with great effort │ تحامل على نفسه (nafsihi) to brace o.s.; to pull o.s. together, take heart, pluck up courage <b>VIII</b> to carry, bring (هـ s.th.); to carry away, take away, haul off, lug off (هـ s.th.); to suffer, undergo, bear, stand, endure, sustain (هـ s.th.); to allow, permit, suffer, tolerate, brook, stomach (هـ s.th.), acquiesce (هـ in), put up, bear (هـ with s.th.); to hold (هـ s.th.), have capacity (هـ for); to imply that s.th. (هـ) is possible, permissible, or conceivable; يحتمل yaḥtamilu and (pass.) yuḥtamalu (it is) bearable, tolerable; (it is) conceivable, possible, probable, likely\n\n\nحمل ḥaml carrying, bearing; inducement, prompting, encouragement (of s.o., على to); delivery; transport, transportation, conveyance; portage, carrying charges; -- (pl. احمال aḥmāl, حمال ḥimāl) foetus; pregnancy │عدم الحمل ‘adam al-ḥ. sterility (of a woman)\n\n\nحمل ḥiml, ḥaml pl. احمال aḥmāl cargo, load, burden │حمل حي ḥaml ḥayy pay load, commercial load, live load; حمل ميت mayyit) dead load; dead weight (arch.); حمل موازن (muwāzin) counterpoise, counterweight\n\n\nحمل ḥamal pl. حملان ḥumlān, احمال aḥmāl lamb; (unconsecrated) Host (Chr.Copt.); Aries, Ram (astron.)"
}