{
  "term": "حول",
  "previous_term": "حائك",
  "next_term": "حال",
  "definition": "حال (حول and حيل) ḥāla u to change, undergo a change, be transformed; to shift, turn, pass, grow (الى into s.th., also هـ), become (الى s.th.); to deviate, depart (عن from, e.g., a commitment), dodge, evade, fail to meet (عن s.th.); to elapse, pass go by (time); -- (حيلولة ḥailūla) to prevent (دون s.th.); to intervene, interfere, interpose, come (بين between) │حال عن عهد (‘ahd) to withdraw from a contract; حال بين فلان وبين الأمر 215 to make s.th. inaccessible to s.o., impossible for s.o.; to bar or obstruct s.o.’s way to s.th.; to prevent s.o. from s.th., deny s.o. s.th.; حال بين نفسه وبين الإشفاق (išfāq) to resist compassion, deny o.s. any sympathy <b>II</b> ḥawwala to change (الى هـ or هـ هـ s.th. to s.th. else), transform, transmute, convert, turn, make (الى هـ or هـ هـ s.th. into s.th. else); to transplant (s.th.); to transfer (هـ s.th.); to convert (هـ s.th., mathematically); to switch commutate (هـ current; el.); to convert, transform (هـ current; el.); to shunt (هـ a railroad car); to switch (هـ a railroad track); to remit, send, transmit (هـ s.th., e.g., money by mail, الى to s.o.); to pass on, hand on (الى هـ s.th. to s.o.); to forward (الى هـ s.th. to s.o. or to an address); to endorse (هـ a bill of exchange, a promissory note); to direct, turn (هـ s.th., also نظرة naẓratan a glance, الى to or toward); to divert, distract, keep (عن هـ or ه s.o. or s.th. from); to turn away, avert (بصره عن baṣarahū one‘s eyes from); to turn off, switch off, disconnect (هـ current; el.) │حول الدفة (daffa) to turn the helm, change the course <b>III</b> (ḥāwala to try, attempt, endeavor (هـ s.th., ان to do s.th.), make an attempt, make an effort (ان to do s.th.); to seek to gain (هـ s.th.) by artful means; to deceive by pretenses, make excuses, hedge, dodge <b>IV</b> to change هـ هـ or الى هـ s.th. to), transform, transmute, turn, make (هـ هـ or الى هـ s.th. into); to convert, translate (هـ هـ or الى هـ s.th. into); to transfer (هـ s.th.); to remit, send (هـ s.th. الى or على to s.o.); to assign (هـ, ه s.o., s.th., الى or على to s.o.); to turn over, hand over, pass on (على هـ or ه s.o. or s.th. to); to forward (على هـ s.th. to); to refer (الى ه s.o. to); to cede, transfer (هـ a debt, على to s.o.; jur.) │احيل على (الى) المعاش (uḥīla, ma‘āš) and احيل الى التقاعد (taqā‘ud) he was pensioned off; احيلت الكمبيالة الى البروتستو the bill was protested (fin.) <b>V</b> taḥawwala to change, undergo a change; to be changed (الى to), be transformed, be transmuted, be converted (الى into), become (الى s.th.), turn, grow (الى into), transform (من-- الى or عن from -- into), change, develop, evolve (من -- الى from to); to withdraw, go away, leave; to move (الى to a residence); to turn away (من from), turn one’s back (عن on); to deviate (عن from); to depart, digress, stray (عن الطريق from the way); to renounce, forgo, relinquish, disclaim (s.th.); to proceed slyly or cunningly │تحول كل حيلة to employ every conceivable trick; -- taḥayyala to employ artful means; to ponder ways and means (ل to an end, in order to attain s.th.) <b>VI</b> taḥāwala to try, endeavor, take pains (على to do s.th.), strive (على for); -- taḥāyala and <b>VIII</b> to employ artful means, resort to tricks, use stratagems (على against s.o.); to deceive, beguile, dupe, cheat, outwit, outsmart (على s.o.); to be out (على for s.th.) or achieve (على s.th.) by artful means, by tricks <b>VIII</b> to work or strive (on one’s own resources), make efforts (on one’s own) <b>IX</b> احول aḥwala to be cross-eyed, to squint <b>X</b> to change (الى to, into), turn, be transformed, be converted (الى into); to be transubstantiated (bread and wine, الى into the body and blood of Christ; Chr.); to proceed, pass on, shift, switch (الى to s.th. new or s.th. different); to be impossible (على for s.o.); to be inconceivable, absurd, preposterous\n\n\nحول ḥaul pl. احوال aḥwāl year; might, power │لا حول ولا قوة الا بالله lā ḥaula wa-lā quwata illā bi-llāh there is no power and no strength save in God; لا حول له ولا حيلة (wa-lā ḥīlata) he is completely powerless, he can do nothing, he is at the end of his resources\n\n\nحول ḥiwal change of place, change │لا يبتغون عنه حولا (yabtagūna) they don’t want it otherwise, they ask for it\n\n\nحول ḥaula (prep.) around, about; circa, about, some, approximately, roughly (with following number); about (esp. in news headings, approx. = re, concerning) │ من حوله (ḥaulihī) (= حوله) around him (or it), about him (or it); من حوليهما (ḥaulaihimā) around the two of them, about them; from their vicinity, from their surroundings (dual)\n\n\nحول ḥawal squinting, strabismus"
}