{
  "term": "خرج",
  "previous_term": "خرتيت",
  "next_term": "خرجة",
  "definition": "خرج karaja u (خروج kurūj) to go out, walk out; to come out (من of), emerge (من from); to drive or ride out, go out (in a vehicle); to flow out, exude, effuse; to go away, depart, leave, retire; to protrude, 231 project, stick out; to leave (من s.th.); to dismount, alight, disembark (من from), get out, step out (من of); to emanate, issue, arise, originate, result (من from); to draw away, segregate, separate, secede, dissent (عن from), disagree (عن with); to deviate, depart (عن from an arrangement, from a principle); to be an exception (عن to); to be outside a given subject (عن), go beyond a topic (عن), exceed (عن a topic); to be alien (عن to), be extraneous (عن from), not to belong (عن to), be not included (عن in), have nothing to do with (عن); لا يخرج عن it is limited to ..., it is nothing but ... ; to go forth (into battle); to attack (على s.o., s.th.), rise, fight (على against); to rebel, revolt (على against); to violate, break, infringe (على a rule, a regulation); خرج عليه ب to come up to s.o. with …, confront s.o. with ... ; to get out, bring out, take out (ب s.o.); to turn out, oust, dislodge (ب s.o.); to lead away, dissuade (عن ب s.o. from); to find out, discover (ب s.th.) │خرج عن الخط (kaṭṭ) to be derailed, run off the track (train) <b>II</b> to move out, take out, dislodge (ه s.o., هـ s.th.); to turn out, oust, expel, evict, drive out (ه s.o., هـ s.th.); to remove, eliminate (ه s.o., هـ s.th.); to exclude, except (هـ s.th.); to train (ه s.o., في in a skill, and the like); to educate, bring up (ه s.o.); to distill (هـ s.th.); to pull out, extract (هـ s.th.); to gather, deduce, infer (هـ s.th.); to explain, interpret, expound, elucidate (هـ s.th.) <b>IV</b> to move out, take out, get out, bring out, dislodge (ه s.o., هـ s.th.); to unload (هـ s.th.), disembark, detrain, etc. (ه s.o., e.g., troops); to turn out, oust (ه s.o.); to emit, send out (هـ s.th., e.g., electric waves); to stick out (هـ e.g., the tongue); to fish out (هـ s.th. from the pocket); to bring out into the open, make public (هـ s.th.); to remove, extract (هـ s.th.); to eliminate (هـ s.th.); to expel, evict, exile, expatriate (ه s.o., من from a country); to dismiss, fire, remove (ه s.o., من from an office); اخرجه من ثروته (tarwatihī) to rob s.o. of his property, dispossess, expropriate s.o.; to give off, sound, emit (هـ s.th., e.g., a tone; said of a musical instrument); to set forth, state, express, utter, voice (هـ an opinion); to break (ريحا rīḥan wind); to educate, bring up (ه s.o.); to train (ه s.o.); to stage, produce (هـ a play; theat.); to bring out, make, shoot (رواية riwāyatan a film, said of a director); to except, exclude (هـ s.th., عن from); to pull out, extract (هـ s.th.); to select (هـ s.th.) <b>V</b> to be educated; to be trained (في in a school, college, also من; في in a field); to graduate (في from a school, from a college, also من) <b>VI</b> to part company, separate; to disengage, disassociate, withdraw from one another; to cede, assign, transfer, make over (ل عن s.th. to s.o.) <b>X</b> to get out, move out, remove (هـ s.th., من from); to take out, draw (هـ s.th., من from); to pull out, extract (هـ s.th., من from); to mine, extract, recover (هـ mineral resources); to win, gain, make (هـ a product, من from); to copy, excerpt (A s.th., من from a book or document); to derive, draw, deduce, figure out, compute (من هـ s.th. from); to elicit (هـ s.th., e.g., astonishment, من from s.o.); to find out, discover (هـ s.th.)\n\n\nخرج karj expenditure, outlay, expense(s), costs; land tax; s.th. appropriate or suitable, that which is s.o.’s due, which s.o. deserves, which s.o. needs; (eg.) ration (food); (pl. خروجات kurūjāat) trimming; edge, edging, piping; pl. lace; trimmings │هذا خراجك that’s what you need, what you deserve; خرج المشنقة k. al-mašnaqa one who deserves to be hanged\n\n\nخرج kurj pl. خرجة kiraja saddlebag, portmanteau 232\n\n\nخرج kurāj (coll.; n. un. ة, pl. -āt) skin eruption; tumor, abscess"
}