{
  "arabic": "خلف",
  "definition": "خلف kalafa u to be the successor (ه of s.o.), succeed (ه s.o.): to follow (ه s.o.), come after s.o. (ه): to take the place of s.o. (ه), substitute (. for s.o.): to replace (ه s.o., هـ s.th.): to lag behind s.o. (عن): to stay behind (عن after s.o.’s departure); to be detained, be held back, be kept away, stay away (من from) <b>II</b> to appoint as successor (ه s.o.); to leave behind, leave (هـ, ه s.o., s.th.); to have descendants, have offspring <b>III</b> to be contradictory, contrary, opposed (هـ to): to conflict, clash, be at variance (هـ with); to contradict (ه s.o., هـ s.th.); to be different, differ, diverge (هـ from), be inconsistent, incompatible, not in keeping, not to harmonize (هـ with); to offend (هـ against a command, a rule), break, violate, disobey (هـ a command, a rule) <b>IV</b> to leave (ه offspring, children); to compensate, requite, recompense (على s.o.; said of God): to break, fail to keep (وعده wa‘dahū one’s promise), go back on one’s word; to disappoint (الرجاء ar-rajā’a the hopes) <b>V</b> to stay behind; to lag or fall behind (عن); to stay, stay on, remain; to fail to appear or show up; to play truant; to be absent; to stay away (عن from), not go (عن to), not attend (عن s.th.) │تخلف عن المجيء (majī’) to fail to come or arrive; تخلف عن العودة (‘auda) not to return <b>VI</b> to disagree, differ, be at variance; to differ in opinion, be of a different mind <b>VIII</b> to differ, be different, vary (عن from); to be varied, varying, variable, various, diverse, dissimilar; to vary (بين between); to disagree, differ in opinion, be at variance, argue, quarrel, dispute (في about); to come or go frequently (الى to), frequent, patronize (الى a place), visit frequently (الى s.o., s.th.), come and go (الى at); to come, descend (على upon s.o.; said of afflictions), befall, overtake (على s.o.) <b>X</b> to appoint as successor or vicar (ه s.o.)\n\n\nخلف kalf back, rear, rear part or portion; successors; kalfu and من خلف min kalfu (adv.) at the back, in the rear; kalfa (prep.) behind, after, in the rear of │ جرى خلفها he ran after her: من خلف min kalfi behind, in the rear of; من الخلف from behind, from the rear; الى الخلف to the rear, backward, back; الى خلف الشيء in the wake of s.th.; في الخلف in the rear; at the back, in the background\n\n\nخلف kilf pl. اخلاف aklāf test, nipple, mammilla\n\n\nخلف kulf dissimilarity, disparity, difference, contrast, variance, discrepancy\n\n\nخلف kalaf pl. اخلاف aklāf substitute; successor; descendant, offspring, scion"
}