{
  "arabic": "درج",
  "definition": "درج daraja u (دروج durūj) to go, walk, move, proceed, advance (slowly); to approach gradually, step by step (الى s.th.); to follow a course (على), proceed along the lines of (على), proceed in such and such a manner (على); to go away, leave, depart; to outgrow (من a nest, a habitation); to be past, bygone, over (time); to have passed away, be extinct; to circulate, be in circulation, be current, have currency; to grow up (child); -- (darj) to roll up, roll together (هـ s.th.); to wrap, wind, twist (على هـ s.th. around); -- darija a to rise or advance step by step│درج العرف على daraja l-‘urfu ‘alā it has become the general practice to ... <b>II</b> to make (ه s.o.) rise or advance by steps, promote (ه s.o.) by degrees; to move or bring (هـ s.th.) gradually closer (الى to); to approximate (الى هـ s.th. to); to roll up, fold up (هـ s.th.); to circulate, put into circulation (هـ s.th.), give currency (هـ to s.th.), make (هـ s.th.) the general practice; to divide into degrees, steps or grades, graduate, grade, gradate (هـ s.th.); to insert, include, enter (فى هـ s.th. in) <b>III</b> to go, keep up (هـ with, e.g., with the time, with a fashion) <b>IV</b> to insert, include, incorporate, embody (فى هـ s.th. in); to enter, register (فى هـ s.th., e.g., in a list), book (هـ s.th.) <b>V</b> to progress by steps, advance gradually; to proceed step by step (الى to); to make progress (فى in); to graduate, grade, be graded, graduated, gradated <b>VII</b> to be inserted, entered, incorporated, embodied, included (فى in); to be classified (فى in, تحت under) <b>X</b> to make (ه s.o.) advance or rise gradually, promote (ه s.o.) by degrees; to lead (ه s.o.) gradually (الى to), bring (ه s.o.) around to (الى, ل); to bait, allure (ه s.o.); to entice, tempt, lure into destruction (ه s.o.)\n\n\nدرج darj entry, entering, registering, registration, recording; a rolled or folded paper; roll, scroll│ فى درج الكتاب in the book; فى درج الكلام d. il-kalām in the course of the talk\n\n\nدرج durj pl. ادراج adrāj drawer (of a table, desk, etc.); desk (e.g., for pupils in school)\n\n\nدرج daraj pl. ادراج adrāj way, route, course; flight of steps, stairs, staircase│ رجع ادراجه raja‘a adrājahū (also عاد ادراجه) to retrace one‘s steps, go back the way one came; to go back, turn back; 276 ذهب ادراج الرياح (adrāja r-riyāḥ) to go the ways of the winds, i.e., to pass unnoticed, without leaving a trace; to end in smoke, come to nothing, be futile, be in vain"
}