{
  "term": "دفع",
  "previous_term": "دفس",
  "next_term": "دفعة",
  "definition": "دفع dafa‘a a (daf‘) to push; to push away, shove away, push back, drive back, repel, remove, dislodge, drive away (عن هـ, ه s.o., s.th. from); دفعه جانبا (jāniban) to push, shove, or elbow, s.o. aside; to rid (عن نفسه o.s., هـ of s.th.), get rid of s.th.; to get the better (هـ, ه of s.o., of s.th.), conquer, master control (ه s.o., هـ s.th.); to fight (ب هـ s.th. with); to reject, repudiate (هـ s.th.); to rebut, refute, disprove (هـ s.th.); to propel, drive (هـ s.th.); to move, cause, urge, impel, egg on, goad (ه or ب s.o., الى or ل to do s.th.), induce, incite, force, compel, oblige (ه or ب s.o., الى or ل to), make s.o. (ب or ه) do s.th. (الى or ل); to band over, present, turn over (ل or الى هـ s.th. to s.o.); to pay (ثمنا tamanan a price, الى or ل to s.o.) │دفع خطاه الى (kuṭāhū) to wend one’s way to <b>III</b> to resist, withstand (ه s.o., .s.th.). offer resistance (هـ, ه to); to contradict, oppose (ه s.o., عن so as to make him abstain from s.th.), dissuade (ه s.o., عن from); to suppress (هـ s.th.); to defend (عن s.o., s.th.), uphold (عن s.th.); to be entrusted with the defense (عن of s.th., of s.o., also jur.) <b>V</b> to dash forward; to dart off, rush off; to pour forth, flow, stream, gush forth (water); to spring up, make itself felt (an idea, a social tendency, and the like) <b>VI</b> to shove or push one another; to push or shove one another away or aside; to push off, shove off (عن from); to issue in intermittent bursts, gush forth intermittently; to burst forth, rush out, sally (من from); to be propelled, be driven forward; to storm forward <b>VII</b> to dart off, rush off; to proceed rashly, blindly, without forethought; to be too impetuous, be too hotheaded; to plunge headlong (في into s.th.); to rush, dart. make (الى at s.th.), pounce (الى on s.th.); to rush off, hurry off, go quickly (الى to; with foll. imperf.: to do s.th.); to give o.s. (ل to s.o.); to burst forth, gush out, pour forth, spurt, spout, flow, run (من from; water); to let o.s. be carried away or be overcome (وراء by s.th., e.g., وراء شهواته šahawātihī by one’s bodily appetites, وراء شعوره by one’s feelings, وراء العاجلة by worldly things); to proceed, set out, begin (with foll. imperf.: to do s.th.) <b>X</b> to try to ward off or stave off (هـ s.th., ب by)\n\n\nدفع daf‘ pushing back, shoving aside; repulsion. driving away, driving off; dispelling; parrying, warding off, staving off; repulse, rejection. repudiation; rebuttal; handing over, turning in; payment 285"
}