{
  "term": "دق",
  "previous_term": "مدفن",
  "next_term": "دقة",
  "definition": "دق daqqa i (دقة diqqa) to be thin, fine, fragile, frail; to be little, small, tiny, minute; to be subtle, delicate; to be insignificant, unimportant, trifling, inconsiderable; to be too fine, too subtle (عن for perception); -- u (daqq) to crush, bruise, bray (هـ s.th.); to grind, pulverize, powder (هـ s.th.); to pound (هـ s.th., e.g., meat); to strike (clock); to beat, throb (heart); to hammer, throb (engine); to knock, rap, bang (الباب al-bāba on the door); to bump (رأسه بالحائط ra’sahū bi-l-ḥā’iṭ one’s head against the wall); to drive (هـ a nail); to ram in, drive in (constr. eng.); to beat, strum, play (على a musical instrument); to type (على on a typewriter); -- to sound, resound, ring out (said of musical instruments) │ دق الجرس(jarasa) to ring the bell; دق جرس الخطر (j. al-kaṭar) to sound the alarm; دق الجرس على to call s.o. up, give s.o. a ring; دق الجرس (jarasu) the bell rang; دقت الساعة the clock struck <b>II</b> to triturate, pulverize, reduce to powder (oil s.th.); to he precise, exact, strict, meticulous, painstaking, proceed with utmost accuracy or care (في in s.th.); to scrutinize, examine closely, determine exactly (ه s.th.); to do (ه s.th.) carefully, with precision! دقق البحث (baḥta) to investigate carefully; دقق النظر (naẓara) to watch attentively or carefully, scrutinize, examine closely (في s.th.); دقق الملاحظة (mulāḥaẓa) to observe closely <b>III</b> to deal scrupulously (ه with s.o.) <b>IV</b> to make fine, make thin (ه s.th.) <b>VII</b> to be crushed, brayed, pounded; to be broken │اندق عنقه (‘unquhū) he broke his neck <b>X</b> to be or become thin or fine\n\n\nدق daqq crushing, bruising, braying, pounding; pulverization, trituration; grinding (down); beat(ing), throb(bing); bang(ing), knock(ing), rap(ping); tattoo(ing) │دق الجرس d. al-jaras peal, ringing, sound of a bell; دق الحنق d. al-ḥanak chatter, prattle\n\n\nدق diqq fine, thin; little, small, tiny, minute; delicate, fragile, frail │شجر دق (šajar) shrubbery, brush, scrub; حمى الدق ḥumma d-d. hectic fever"
}