{
  "term": "دين",
  "previous_term": "ديموقراطية",
  "next_term": "دينونة",
  "definition": "دان (دين) dāna i to borrow, take up a loan; to be a debtor, be indebted; to owe (ب ل s.o. s.th., also, e.g., دان له بالشكر (šukr) d. lahū bi-š-šukr to owe s.o. one’s thanks; ب s.th., e.g., بالحياة bi-l-ḥayāh one’s life, ل to s.th. or s.o.); to be indebted (ب ل to s.o. for); to be subject, subject o.s., bow, yield, (ل to s.o. or s.th.), be under s.o.’s (ل) power, owe allegiance (ل to s.o.), obey (ل s.o.); to grant a loan, lend money (ه to s.o.); to subject, subjugate (ه s.o.): to requite, repay (ه s.o.): to condemn (ه s.o.), pass judgment (ه on s.o.) <b>III</b> to have a debt (ه with s.o.), be indebted (ه to s.o.): to be the creditor (ه of s.o.), have a money claim (ه on s.o.) │داينه بمبلغ خمسة قروش (bi-mablag kamsat q.) he had a claim of five piasters on him <b>IV</b> to lend money (ه to s.o.): to sell on credit (ه to s.o.); to convict, find guilty, pronounce guilty (ه s.o.) <b>V</b> to be indebted, have debts; to subject o.s. (ل to) <b>VI</b> تداينوا بدين (dain) to contract a mutual loan, borrow money from each other <b>X</b> to make or incur debts, take up a loan\n\n\nدين dain pl. ديون duyūn debt; pecuniary obligation, liability: obligation (Isl. Law); claim (Isl. Law), financial claim │بالدين on credit; رب الدين rabb ad-d. creditor; ديون الحرب d. al-ḥarb war debts: دين مضمون bonded, or funded, debt; دين ممتاز (mumtāz) preferred, or privileged, debt; دين موحد (muwaḥḥlad) consolidated debt; دين مطلق (muṭlaq) debt not bound to the physical person of the debtor, but outliving him (Isl. Law); دين مستغرق (mustagriq) claims against an estate which exceed or equal the assets (Isl. Law)\n\n\nدان (دين) dāna i to profess (ب a religion, a conviction. etc.) │ دان بالإسلام to profess Islam; دان بعاداته (bi-‘ādātihī) to adhere to one’s customs <b>V</b> to profess (ب a religion)\n\n\nدين dīn pl. اديان adyān religion, creed, faith, belief │يوم الدين yaum ad-d. the Day of Judgment\n\n\nدين dayyin religious, pious, godly, devout"
}