{
  "term": "ذكر",
  "previous_term": "ذقن",
  "next_term": "ذكرة",
  "definition": "ذكر dakara u (dikr, تذكار tadkār) to remember, bear in mind (هـ s.th.), think (هـ of); to keep in mind (هـ s.th.); to recall, recollect (هـ s.th.); -- (dikr) to speek, talk (هـ of, about); to name, mention, cite, quote (هـ s.th.); to state, designate, indicate (هـ s.th.); to give (هـ e.g., foots, data); to point, refer (هـ to s.th.); to report, relate, tell (ل هـ s.th. to s.o.) │ تقدم يذكر taqaddumun yudkaru notable progress; لا يذكر (yudkaru) inconsiderable, not worth mentioning; ذكره بخير (بالخير) (kair) to have pleasant memories of s.o., hold s.o. in fond remembrance; to speak well of s.o.; ذكره بشر (šarr) to have unpleasant memories of s.o.; to speak ill of s.o. <b>II</b> to remind (ب ه s.o. of s.th.), point out (ب ه to s.o. s.th.), call s.o.’s (ه) attention (ب to); to make (هـ a word) masculine (gram.) <b>III</b> to parley, negotiate, confer, have a talk, take counsel (ه with s.o.); to memorize, commit to memory, learn, study (هـ one’s assignment, one’s lesson) │ ذاكر دروسه (durūsahū) to study one’s lessons, do one’s homework <b>IV</b> to remind (هـ ه s.o. of s.th.), call (هـ s.th.) to s.o.’s (ه) mind <b>V</b> to remember, bear in mind (هـ s.th.), think (هـ of s.th.) <b>VI</b> to remind each other (هـ of), revive each other’s memory of (هـ); to confer (together), have a talk, take counsel <b>VIII</b> ادكر iddakara = V; <b>X</b> to remember, recall, keep in mind, know by heart (هـ s.th.)\n\n\nذكر dikr recollection, remembrance, reminiscence, memory, commemoration; reputation, repute, renown; naming, stating, mention(ing), quoting, citation; report, account, narration, narrative; invocation of God, mention of the Lord’s name; (in Sufism) incessant repetition of certain words or formulas in praise of God, often accompanied by music and dancing │على ذكر (with foll. genit.) apropos of, speaking of ...; وعلى ذكر ذلك speaking of that, incidentally, in that connection; الذكر الحكيم the Koran; سالف الذكر abovementioned, afore-mentioned; سعيد الذكر of blessed memory, deceased, late; اشاد بذكره (ašāda) to celebrate, praise, commend s.o. or s.th., speak in glowing terms of s.o. or s.th.; ما زال على ذكر من (dikr min) he still remembered ..., he could still recall ...\n\n\nذكر dakar pl. ذكور dukūr, ذكورة dukūra, ذكران dukrān male; (pl. ذكور) penis"
}