{
  "term": "راى",
  "previous_term": "راوند",
  "next_term": "راي",
  "definition": "رأى ra’ā يرى yarā (ra’y, رؤية ru’ya) to see; to behold, descry, perceive, notice, observe, discern (هـ s.th.); to look (هـ هـ at s.th. as), regard (هـ هـ s.th. as), consider, deem, think (هـ هـ s.th. to be ...); to judge; to be of the opinion (ان that), believe, think (ان that); to express one’s opinion; to feel (ان that); to deem appropriate, think proper (هـ s.th.), decide (هـ on s.th., انto do s.th.); to consider, contemplate │أرأيت a-ra’aita tell me! what do you think? رأى رأي العين (ra’ya l-ain) to see with one’s own eyes; رأى رؤيا (ru’yā) to have a dream; رأى منه العجب (‘ajaba) to be amazed at s.th.; رأى للشيء فائدة expect some benefit from s.th.; رأى من واجبه (min wājibihī) to regard as one’s duty, deem incumbent upon o.s.; رأى له ان to think that it would be in s.o.’s interest to ...; رأى رأيه (ra’yahū) to share s.o.’s. opinion; pass.: رؤي ان (ru’iya) it was decided that ...; رؤي الشيء it was felt proper to do <b>III</b> it was thought to be the right thing to do ill to act ostentatiously, make a show before people, attitudinize; to do eyeservice; to behave hypocritically, act the hypocrite, (dis)simulate, dissemble (ه toward s.o.) <b>IV</b> ارى arā to show, demonstrate (هـ ه to s.o. s.th.) يا ترى yā turā (in interrogative sentences) what’s your opinion? would you say ...? │I wonder ..., متى يا ترى I wonder when ..., ترى هل wonder if ..., would you say that ...? اتراها جاءت (a-tarāhā) I wonder if she has come, would you say she has come? اتراني اعود would you say I should go back? <b>V</b> to deem, think, believe <b>VI</b> to present o.s. to or come into s.o.’s (ل) view, show o.s. (ل to s.o.); to appear, seem (ل to s.o.); to appear right, seem appropriate (ل to s.o.), be thought proper (ل by s.o.); to see one another; to look at o.s. (in a mirror); to act the hypocrite; to fake, feign, simulate (ب s.th.) <b>VIII</b> to consider, contemplate (هـ s.th.); to be of the opinion (ان that), decide (ان that) │ارتأى رأيا (ra’yan) to have an opinion; ارتأى رأيه (ra’yahū) to share s.o.’s opinion"
}