{
  "arabic": "راس",
  "definition": "رأس ra’asa a (رئاسة ri’āsa) to be at the head, be the chairman, be in charge (هـ of s.th.); to preside (هـ over s.th.); to had, lead, direct, manage, run (هـ s.th.); -- رؤس ra’usa u to be the chief, the leader <b>II</b> to appoint as chief or head, make the director or leader, entrust with the direction, management or chairmanship (ه s.o.) <b>V</b> = ra’asa <b>VIII</b> to become or be the chief, head, leader, or director\n\n\nرأس ra’s m. and f., pl. رؤوس ru’ūs, ارؤس ar’us head (also as a enumerative of cattle); chief, chieftain, head, leader; upper part, upper end; tip; top, summit, peak; vertex, apex; extremity, end; promontory, headland, cape (geogr.); main part; beginning: رأسا ra’san directly, straightway; immediately │برأسه sui generis, in a class by itself, independent, self-contained, e.g., علم برأسه (‘ilm) a science in itself; رأس برأس (both) alike, one like the other, equally, without distinction: على رأس (with foll. genit.) at the head of; at the end of; at the beginning of, before, prior to; على الرأس والعين (wa-l-‘ain) very gladly; juts as you wish! at your service! على رؤوس الأشهاد ‘alā r. il-ašhād in public, for all the world to see; رأسا على عقب ra’san ‘alā ‘aqbin upside down, topsy-turvy, e.g., قلبه رأسا على عقب 317 (qalabahū) to turn s.th. completely upside down, upset s.th. from the bottom up; الرأس الى القدم (qadam) or من الرأس الى أخمص القدم (akmaṣi l-qadam) from head to toe; رفع به رأسا to pay attention to s.th.; رأس الآفات the principal evil, the root of all evil; رأس تنورة Ras Tanura (cape. E Saudi Arabia, oil center); رأس ثوم r. tūm clove of garlic: رأس الجسر r. al-jisr bridgehead; رأس حامية (ḥāmiya) hothead, hotspur, firebrand; رأس السنة r. as-sana New Year; رأس العمود r. al-‘amūd capital (of a column or pilaster); رأس الكتاب letter-head; رأس المال pl. رؤوس المال capital (fin.): مسقط الرأس masqaṭ, masqiṭ ar-r. birthplace, home town; سمط الرأس samṭ ar-r. zenith (astron.); البلد الرأس (balad) the capital city; رؤوس الأصابع tiptoes\n\n\nراس rāsin pl. رواس rawāsin fixed, stationary, immovable, firm, steady, stable, firmly established; anchored, at anchor; pl. راسيات rāsiyāt, رواس rawāsin towering, unshakable mountains"
}