{
  "arabic": "رد",
  "definition": "رد radda u (radd) to send back; to bring back, take back (الى هـ, ه s.o., s.th. to); to return (الى هـ s.th. to its place). put back, lay back (الى هـ s.th. in its place); to throw back, repel, drive back, drive away (ه s.o.); to resist, oppose (ه s.o.); to turn down, refuse, decline (هـ s.th., e.g., the fulfillment of a wish); to ward off, parry, repel (هجوما hujūman an attack); to reject (تهمة tuhmatan a suspicion); to hand back, give back, return, restore (هـ s.th., الى to s.o.); to return (السلام as-salāma the greeting); to reply (على to s.o.), answer (على s.o.); to reflect (هـ light); to throw back, echo (هـ the voice); to refute, disprove (على s.th.); to hold back, keep, restrain (عن ه s.o. from s.th.); to dissuade (عن ه s.o. from), prevail upon s.o. (ه) not to do s.th. (عن); to trace back, attribute (الى هـ s.th. to an origin); to bring, yield ( هـ على s.th. to s.o.); to reappoint, reinstate (ه ه s.o. as, e.g., حاكما ḥākiman as governor) │رد الباب to close the door; رد جوابا (jawāban) to answer; ما يرد هذا عليك شيئا this won’t help you at all; لا يرد (yuraddu) irrefutable; رده على عقبيه (‘aqibaih) pl. ردهم على اعقابهم (a‘qābihim) to drive s.o. back to where he came from; رد عينه عنه (‘ainahū) he averted his eyes from it <b>II</b> to keep away, avert, prevent, stave off (هـ s.th.); to repel, throw back (هـ, ه s.o., s.th.); to repeat (constantly, frequently); to break forth, burst (هـ into, e.g., into singing), strike up, intone, let ring out (هـ a tune, or the like) │ردد الصدى (ṣadā) to return the echo; ردد النظر في (naẓara) to look at s.th. again and again; 333 ردد طرفه بين (ṭarafahū) to let one’s eyes wander between, look first at one, then at the other <b>V</b> to be thrown back, be reflected (voice, echo); to ring out (shouts); to shift repeatedly (wind); to come and go (على at s.o.’s house; rarely الى), frequent, visit frequently (على s.o.’s house, a place; rarely الى); to return, recur; to hesitate, be reluctant (في in s.th., to do s.th.); to waver, become uncertain, become doubtful في in s.th. or as to s.th.) │تردد على الألسنة (alsina) to be frequently diocussed (question) <b>VIII</b> to withdraw, retreat, fall back; to move backward, retrogress; to go back, return, revert (الى to); to fall back (الى on); to go away, absent o.s.; to desist, refrain (عن from), renounce, give up, abandon, quit, leave (or s.th.); to forsake, desert (or one’s faith, one’s principles, etc.), apostatize, fall off (عن from) │ارتد على عقبيه (‘aqbaihi), pl. ارتدوا على اعقابهم (a’qābihim) to withdraw, turn back <b>X</b> to reclaim, demand back, call in (هـ s.th.), demand the return (هـ of s.th.); to bring back, lead back (ه الى s.o. to); to get back (هـ s.th.); to retrieve, recover, regain (هـ s.th.); to withdraw (e.g., يده yadahū one’s hand; also fig., e.g., استقالته istiqālatahū one’s resignation); to withdraw, take out (هـ money, from an account, from a bank) │استرد انفاسه (anfāsahu) to catch one’s breath\n\n\nرد radd pl. ردود rudūd return; restoration, restitution; refund, reimbursement; repayment, requital; repulsion; warding off, parrying; denial, refusal; rejection; reply, answer; reflection (e.g., of light); refutation; attribution (الى to) │رد الفعل al-fi‘l reaction; رد الاعتبار rehabilitation; ردا على (raddan) in reply to ...; اخذ ورد see أخذ akada"
}