{
  "arabic": "رفع",
  "definition": "رفع rafa‘a a (raf‘) to lift, lift up, raise aloft, heave up, hoist up (هـ s.th.); to raise (هـ s.th., e.g., one’s head, also fig.: e.g., the intellectual level, a price); to raise in esteem (هـ s.th.); to make high or higher (هـ s.th.); to elevate (هـ s.th.); to heighten, exalt, enhance (هـ s.th.); to raise, promote (ه الى s.o. to the rank of); to fly, let up (هـ, e.g., a kite); to hoist, run up (علما ‘alaman or راية rāyatan a flag); to take off, doff, tip (قبعته qubba‘atahū one’s hat); to place, fasten or attach (هـ s.th.) high above; to erect, set up (هـ s.th.); to raise (صوته ṣautahū one’s voice); to remove, take away (عن or هـ من s.th. from); to abolish, eliminate (هـs.th.); to lift (هـ s.th., e.g., a ban), put an end (هـ to s.th.); to remedy (هـ a mistake); to free, relieve (عن هـ s.o. of s.th.); to put s.th. (هـ) before s.o. (الى), submit (ه الى s.th., e.g., a petition, to), file (هـ الى a report, and the like, with a proper authority); to present, dedicate (هـ الى s.th. to s.o.); to offer up (هـ sacrifices; Chr.); to make, deliver (تقريرا a report); to start, initiate (قضية qaḍīyata legal action); to ascribe (هـ الى a Prophetic tradition to an authority or source); (gram.) to pronounce the final consonant with u; to put (هـ a word) in the nominative or indicative, respectively; pass. rufi‘a it appeared, came in sight, became visible (ل before s.o.); رفع عنه rufi‘a ‘anhu he regained consciousness │رفع شيئا فوق شيء to put s.th. before or above s.th. else; رفع به رأسا (rafa‘a) to pay attention to s.th.; رفع من شأنه (min ša’nihī) to enhance the importance of s.th.; to speak of s.th. in glowing terms; رفع من مكانته (makānatihī) to upgrade s.th.; رفع يديه عنه (yadaihī) to desist, refrain from s.th.; رفع الدعوى عليه (da‘wā) to sue s.o., lodge a complaint against s.o. (امام in a court); رفع قضية عليه (qaḍīyatan) or رفع به قضية to bring legal action against s.o., go with s.o. to court; رفع الاستئناف to appeal, 349 make an appeal (امام to a court) <b>II</b> to raise, lift;, elevate; to celebrate carnival <b>III</b> to act as defence counsel (عن of s.o.), defend (عن s.o., in court), plead s.o.’s (عن) cause; to summon, hale (ه الى s.o. to court) <b>V</b> to be or deem o.s. above s.th. (عن), be too proud (عن for s.th.), look down (عن upon) │ترفع برأسه to raise or bear one’s heed high <b>VI</b> to hale one another before the judge (الى الحاكم); to take one’s case before the judge (الى الحاكم); to plead (in court) <b>VIII</b> to rise, lift; to go up, ascend; to become higher; to grow, increase, rise; to ring out (tone, voice, tune); to go away, pass away, be eliminated, disappear (عن from) │ارتفع صوته (ṣautuhū) to gain prestige\n\n\nرفع raf‘ lifting, hoisting (also, of a flag); elevation; raise, raising, stepping up (of prices, of temperatures, etc.); setting up; erection; abolition; lift, (e.g., of a ban); remedy, elimination, removal; remission (of a tax); submission, filing (e.g., of a report); pronunciation of the final consonant with u (gram.) │رفع الأثقال weight lifting (athlet.)"
}