{
  "term": "ركب",
  "previous_term": "ركاكة",
  "next_term": "ركبة",
  "definition": "ركب rakiba a (ركوب rukūb) to ride (هـ an animal); to mount (هـ an animal); to go, travel (هـ in a carriage, in an automobile, on a train, on board a ship, etc.), ride (هـ in a vehicle, on a bicycle); to get, climb (هـ into a carriage, on a bicycle, etc.), board (هـa train, an airplane, a ship, etc.); to pursue (ه s.o.), be after s.o. (ب with s.th.); to engage (هـ in), embark (هـ on); to commit, perpetrate (هـ a sin, a crime); to master (هـ s.th.) │ ركب البحر (baḥr) to travel by sea; ركبا الحياة (ḥayāh) to master life; ركب الخطر (kaṭar) to embark on a risky undertaking; ركب خيوله الحربية (kuyūlahū l-ḥarbīya) to get on one’s high horse; ركب ذنب الريح (danaba r-rīḥ) to speed along like the wind; ركب رأسه (ra’sahū) to act at one’s disoretion; to act rashly, follow a whim; ركب السيارة (sayyāra) to go by car, travel in an automobile; ركب الشطط (šaṭaṭ) to commit excesses, go too far; ركب الطيارة (ṭayyāra) to fly, go by plane; ركب متن العنف (matna l-‘unf) to commit acts of violence; ركب مركب الخطل (markaba l-kaṭal) to make a foolish mistake, commit a folly; to embark on a reckless course, do irresponsible things; ركب مطية الإخفاق (maṭīyata l-ikfāq) to back the wrong horse, be on the losing side, fail; ركب الأهوال (ahwāl) to defy the horrors; ركب الهواء (hawā’) to fly, travel by air; ركب هواه (hawāhu) to follow one’s whim <b>II</b> to make (ه s.o.) ride; to put, place, fasten, mount (هـ على s.th. on); to fit, mount, insert, set (هـ في s.th. in. e.g., a precious stone in a ring); to build in (هـ a machine part); to assemble (هـ e.g., the parts of an apparatus); to set up (هـ a machine); to install (هـ s.th.; techn.), lay (هـ an electric line, and the like); to assemble, put together, fit together (هـ s.th.); to make, prepare (هـ s.th. out of several components or ingredients); to construct, build (هـ e.g., a technical apparatus) <b>IV</b> to make (ه s.o.) ride or mount │اركبه رأسه وهواه (ra’sahū wa-hawāhu) to let s.o. have his head, let s.o. do as he pleases <b>V</b> to be composed, be made up, consist (من of) <b>VI</b> to be superimposed one upon another <b>VIII</b> to commit, perpetrate (هـ a sin, a crime); to pursue, practice (هـ s.th. │ ارتكب شططا (šaṭaṭan) to overdo s.th., go too far\n\n\nركب rakb riders, horsemen, cavalcade; caravan; traveling party; retinue, escort; procession, troop (of people)"
}