{
  "term": "سد",
  "previous_term": "سخاوة",
  "next_term": "سدة",
  "definition": "سد sadda u (sadd) to plug up, close up, stop up (هـ s.th.); to clog, congest (هـ s.th.); to bar, obstruct, block up, barricade (هـ s.th., على هـ to s.o. s.th.); to block, blockade (هـ s.th.); to cork, plug, stopper (هـ s.th.); to pay, defray, settle, cover (هـ s.th., esp. expenses, a debt, etc.); to fulfill, satisfy, meet (هـ a claim, and the like) │ سد ثغرة(tugratan) to fill a gap, close a breach; سد ثلمة (tulmatan) to fill a gap; سد خلة (kallatan) to remedy a shortcoming; سد حاجته (ḥājatahū) to meet s.o.’s need, provide for s.o.; سد رمقه (ramaqahū) to keep s.o. or o.s. barely alive, eke out an existence; to provide s.o. with a bare existences; to allay s.o.’s hunger; سد مسده (masaddahū) to fill s.o.’s place, replace s.o.; سد مطاعمه to satisfy or fulfill s.o.’s claims; سد فراغا (farāgan) to fill a gap; سد النواقص to remove or remedy deficiencies; -- sadda i (سدود sudūd, سداد sadād) to be sound, right, in proper condition; to hit the right thing, say or do the right thing; to be apposite, be to the point <b>II</b> to block, bar, obstruct (هـ s.th.); to pay, defray, settle, cover (هـ expenses, debts, etc.); to guide (نحو s.o. to), show (ه s.o.) the right way (نحو to); to direct (هـ الى s.th. to), point, level (هـ الى s.th. at); to aim (الى at); to sight, take aim by a sight; to focus (الى on; phot.); to draw a bead (الى or نحو on s.th.) │ سدد دينا(dainan) to pay or settle a debt; سدد عجزا (‘ajzan) to cover a deficit; سدد خطاه (kuṭāhu) to guide s.o.’s stepa <b>IV</b> to hit the right thing, say or do the right thing; to be apposite, be to the point <b>V</b> to be guided, be directed, be shown (الى to) <b>VII</b> to be blocked, be obstructed, be plugged up, become or be clogged or congested 402\n\n\nسد sadd plugging, closing, stopping up; obstruction, barring, barricading; blocking; defrayment (of costs), payment, settlement (of a debt, of expenses); fulfillment, satisfaction (of a claim, etc.); -- sadd, sudd pl. سدود sudūd, اسداد asdād obstruction, block, obstacle; barrier; rampart, bank, mound; dike; dam; weir; barrage, river dam; bar, rail; hurdle (athlet.); bulwark (fig.) │السد العالى (‘ālī) the High Dam (near Aswān); سد المناطيد balloon barrage (mil.); حارة السد blind alley, dead end"
}