{
  "arabic": "سقط",
  "definition": "سقط saqaṭa u (سقوط suqūṭ, مسقط masqaṭ) to fall (also = to be killed in action); to fall down, drop; to tumble, trip, slip; to fall out (hair); to sink down (على on, to); to hit, stumble (على upon), come across s.th. (على); to find (على s.th.); to get, come (الى to s.o.), reach (الى s.o.); to decline, sink, drop (standard); to become null and void, be abolished, be canceled; to be dropped, be omitted, drop out; to be missing; to escape (من s.o.), slip (من s.o.’s memory) │ ليسقط (فليسقط) li-yasquṭ (fal-yasquṭ) down with …! سقط به to drop s.o. or s.th.; سقط اليهم عنه انه they had had word from him that he ...; سقط رأسه في (ra’suh) he was born in ..., his birthplace was …; سقط من العضوية (‘uḍwīya) to be dropped from membership; سقط من عينيه (‘ainaihī) to drop in s.o.’s estimation; سقط في الامتحان to fail an examination, flunk; سقط في يده suqiṭa fī yadihī to stand aghast, be at a loss, be bewildered <b>IV</b> to let fall, drop (هـ, ه s.o., s.th.); to make (ه s.o.) tumble, cause s.o. (ه) to slip; to overthrow, bring down, topple, fell (هـ, ه s.o., s.th.); to fail, flunk (ه s.o. in an examination); to shoot down (هـ an aircraft); to deduct, subtract (هـ a number); to eliminate (هـ 414 s.th. من from); to have a miscarriage, miscarry; to bring about a miscarriage (woman); to slink (هـ its young one; animal) │اسقطه من الجنسية (jinsīya) to deprive s.o. of his citizenship; اسقط حقه في (ḥaqqahū) to forfeit one’s right in s.th., waive one’s claim to s.th.; اسقط دعوى (da‘wā) to quash a complaint, nonsuit a case; to withdraw or drop a complaint; اسقط الشعر (ša‘ra) to cause loss of hair; اسقط في يده usqiṭa fī yadihī = سقط في يده saqaṭa fī yadihī <b>V</b> to learn gradually, pick up information (من هـ about s.th. from); to hunt for scraps │ تسقط الأخبار to gather information <b>VI</b> to fall down, come down, collapse; to fall successively or gradually; to fall out (hair); to come gradually (الى to), arrive one by one (الى at); to roll, drip (من off); to dribble │ تساقط على نفسه to break down, collapse; تساقط حطاما (ḥuṭāman) to go to ruin, disintegrate\n\n\nسقط saqṭ dew\n\n\nسقط siqṭ miscarried fetus\n\n\nسقط saqṭ, siqṭ, suqṭ sparks flying from a flint\n\n\nسقط saqaṭ pl. اسقاط asqāṭ any worthless thing; offal, refuse, rubbish, trash; junk │ سقط المتاع s. al-matā‘ waste, scrap(s)\n\n\nسقط masqaṭ2 Muscat (seaport and capital of Oman)"
}