{
  "arabic": "سمو",
  "definition": " اسم (سمو) ism pl. اسماء asmā’, اسام asāmin name; appellation; reputation, standing, prestige; (gram.) noun; اسما isman nominally │ اسم التأليف pen name, nom de plume; اسم الكتابة do.; اسم تجاري (tijārī) firm name (com.); اسم علم ism ‘alam proper name; اسم جامد (gram.) primary noun (not derived from a verb form); اسم الجمع ism al-jam‘ (gram.) collective noun (which, though forming no nomen unitatis, has a broken plural); اسم الجنس الجمعي ism al-jins al-jam‘ī (gram.) generic collective noun (which can form a nomen unitatis; e.g., rv. /lamam pigoons); اسم الإشارة ism al-išāra (gram.) demonstrative pronoun; اسم التصغير (gram.) diminutive; اسم العدد ism al-‘adad (gram.) numeral; اسم المعنى ism al-ma‘nā (gram.) abstract noun; اسم العين ism al-‘ain (gram.) concrete noun; اسم التفضيل (gram.) elative; اسم الفعل ism al-fi‘l (gram.) verbal noun, nomen verbi; اسم الفاعل (gram.) nomen agentis, active participle; اسم المفعول (gram.) nomen patientis, passive participle; اسم المرة ism al-marra (gram.) nomen vicis; الأسماء الحسنى (ḥusnā) the 99 names of God (Isl.); باسم فلان in s.o.’s name, on behalf of s.o.; بسم الله in the name of God; تقدم الطلبات باسم رئيس الجمعية (tuqaddamu ṭ-ṭalabāt) applications will be addressed to the chairman of the society\n\n\nسما (سمو) samā u (سمو sumūw) to be high, elevated, raised, erect, lofty, tall, eminent, prominent; to rise high, tower up; to be above or beyond s.th. or s.o. (عن), rise above, tower above (عن); to be too proud (or for); to be too high or difficult (عن for s.o.), be or go beyond the understanding of s.o. (عن), exceed s.o.’s (عن) understanding; to rise (الى to, على above or beyond); to be higher (على than); to strive (الى for), aspire (الى to, after) │ سما به to lift, raise, elevate, elevate load up, bring up s.o. or s.th. (الى to); to buoy s.o. up, boost, encourage s.o. <b>III</b> to seek to surpass or excel (ه s.o.): to vie for superiority or glory (ه with s.o.) <b>IV</b> to lift, raise, elevate, erect, load up, bring up (هـ, ه s.o., s.th.) <b>VI</b> to vie with one another for glory; to be high, elevated, raised, erect, lofty, tall, eminent, prominent; to rise high, tower up; to be above or beyond s.th. or s.o. (عن), rise above, tower above (عن); to claim to be higher in rank (على than s.o. else), claim to be above s.o. (على); to deem o.s. highly superior\n\n\nسمو sumūw height, altitude; exaltedness, loftiness, eminence, highness │ سمو الدوق His Grace the Duke; صاحب السمو الملكى (malakī) His Royal Highness; صاحبة السمو الملكي Her Royal Highness; سمو الأخلاق nobility of character"
}