{
  "term": "سند",
  "previous_term": "سناخة",
  "next_term": "سندان",
  "definition": "سند sanada u (سنود sunūd) to support o.s., prop o.s. rest (الى on, upon), lean, recline (الى upon, against) <b>II</b> to support, stay, prop, lean (هـ s.th.) <b>III</b> to support, back, assist, help, aid (ه s.o.) <b>IV</b> to make (ه s.o.) rest (الى on); to make (ه s.o.) lean or recline (الى against, on); to lean (الى هـ s.th. against); to rest, support, prop (الى هـ s.th. on); to base, found (الى هـ s.th. on); (science of Islamic traditions:) to base a tradition (هـ) on s.o. (الى) as its first authority, i.e., to trace back the ascription of a tradition. in ascending order of the traditionaries, to its first authority so as to corroborate its credibility; (gram.) to lean a term (هـ) upon another (الى) being the subject of the sentence, i.e., to predicate it, make it its predicate; to entrust (ل or الى هـ s.th. to s.o.). vest (ل or الى هـ s.th. in s.o.); to attribute, ascribe (هـ ل or الى to s.o. s.th.); to incriminate, charge (هـ الى s.o. with); to lean (الى against, to, on), rest (الى on); to be based, he founded (الى on) │ اسند التهمة الى (tuhma) to direct one’s suspicion on 434 or toward ...; اسند التهمة الى (usnidat) suspicion fell on ... <b>VI</b> to support one another, give mutual support; to support o.s. lean, rest; to trust, rely <b>VIII</b> to lean, recline, be recumbent (على, الى against, on); to rest one’s arms, one’s weight (على, الى on), support one’s weight (على, الى by); to be based, be founded (على, الى on); to rely (على, الى on), trust, have confidence (على, الى in); to use as (documentary) basis (على, s.th.), rest one’s case on (على) سند sanad pl. -āt, اسناد asnād support, prop, stay, rest, back; backing; (pl. اسناد) ascription (of an Islamic tradition), the (uninterrupted) chain of authorities on which a tradition is based │ سندات خشبية (kašabīya) wooden struts, wood bracing; -- (pl. -āt) document, deed, paper, legal instrument; voucher, record; commercial, or negotiable, paper, security, bond; debenture, promissory note, note of hand, debenture bond │ سند شحن البضائع s. saḥn al-b. bill of lading; رجال السند informants, authorities, sources"
}