{
  "term": "شان",
  "previous_term": "متشائم",
  "next_term": "شانتاج",
  "definition": "شأن ša’n pl. شؤون šu’ūn matter, affair, concern, business; circumstances, state of affaire, case; nature, character, quality, 449 kind; situation, condition, state; significance; importance, consequence; standing, prestige, rank; cranial future; pl. شؤون tears; ša’na like, as │بشأن bi-ša’ni regarding, with regard or respect to, relating to, pertaining to, concerning, as to, about; جل شأنه (jalla) the Sublime (of God); وزارة الشؤون الاجتماعية Ministry of Social Affairs; الشؤون الخارجية (kārijīya)foreign affairs; ذو الشأن, f. ذات الشأن the responsible man, the man in charge, the man directly concerned with the matter; اولو الشأن ulū š-š. and ذوو الشأن dawū š-š. the influential people, the competent people; the concerned with the matter; شؤون الحياة š. al-ḥayāh worldly affairs; خطير الشأن of great importance; ذو شأن significant, important; رفيع الشأن high-ranking; (formerly, Tun.) title of members of the Bey’s family; صاحب الشأن the one concorned; اصحاب الشأن those concerned; the important, influential people; O مكلف بالشؤون (mukallaf) chargé d’affaires (dipl.); شأنه في ذلك شأن الـ... (ša’nuhū … ša’nu l-...) in this matter he fares just as the …, he is, in this respect, in the same situation as the ...; رجل هذا شأنه (ša’nuhū) a man whose situation is this, a man who can be described as ..., a man in this situation; شأنك ša’naka or انت وشأن anta wa-ša’naka please your-self! do as you like! شأنك وما تريد (ša’naka) do as you please! just as you wish! دعني وشأني (da‘nī) let me alone! تركه وشأنه tarakahū wa-ša’nahū to let s.o. alone; to let s.o. go; not to pay any attention to s.o.; هو في شأن he is concerned with a matter; هذا شأنه that’s his affair; ما شأنك what’s the matter with you? what do you want? ما شأنك وهذا what have you got to do with this? what business of yours is this? ما شأنه والأمر (amra) what has he got to do with the matter? ما شأني في ذلك what have I got to do with that? what business of mine is that? اي شأن لك في هذا (ayyu ša’nin) what business of yours is this? what’s that to you? له شأن في ذلك he has s.th. to do with this, he has a hand in this; لا شأن له في ذلك (ša’na) he hasn’t anything to do with this, he has no part in this; ليس لي شأن في ذلك I shall have nothing to do with that, that is none of my business, I shan’t meddle in that; لا شأن لي في ذلك (ša’na) I haven’t anything to do with it, it‘s none of my business; لي معه شأن آخر (ākar) I still have a bone to pick with him; ذهب لبعض شأنه (li-ba‘ḍi ša’nihī) he attended to a task; he went to do s.th.; انصرف الى شأنه (inṣarafa) he left to do his work; اصلحت من شأنها (aṣlaḥat) she made herself up; اهمل شأنه ahmala ša’nahū he neglected him; ذلك شأنه that is his habit; هذا شأنه دائما he is always that way; شأنه في (ša’nahū) as he used to do in ...; شأنه مع من ... (ša’nahū) as he used to deal with people who ...; كان من شأنه it was his wont, he used to ...; من شأنه ان it is in his (its) nature that ..., he (it) tends to ...; it is his business to ...; ليس من شأنه ان it is not his affair or business to ...; it is inappropriate for him to ...; it does not tend to …; is not conducive to ...; ان لهذا الرجل شأنا (rajuli) there is a man to keep an eye on, this is an important man; there is s.th. about this man! لله في خلقه شؤون (kalqihī) God has created all kinds of things (meaning: strange things can happen in this world!)"
}