{
  "term": "شغل",
  "previous_term": "مشغوف",
  "next_term": "شغال",
  "definition": "شغل šagala a (šagl, šugl) to occupy, busy (ه ب s.o. with); to preoccupy (ه s.o.), keep (ه s.o.) busy, give (ه s.o.) trouble; 475 to distract, divert, alienate (ه عن s.o. from s.th.).; to occupy, fill, hold, have (هـ office, seat, position); to take up, fill (هـ s.th.), engage, engross (هـ the attention); to engage, tie down (هـ forces of the opponent); -- pass. šugila to occupy o.s., busy o.s. be busy (ب with), be engaged in; to be taken up, occupied (ب by, e.g., ground by buildings); شغل به عن to be distracted by s.th. from │ شغل نفسه ب to occupy o.s., busy o.s. with, work at, attend to; شغل البال to disquiet, discomfit, make uneasy, trouble, disturb; شغل الوقت ل (waqt) to devote tim, to <b>II</b> to busy, occupy (ه s.o.), engage, engross (هـ s.th.); to employ (ه s.o.), provide employment (ه for s.o.); to put (ه s.o.) to work, make (هـ a machine) work, put in operation, make run, start (هـ a machine); to make, produce, manufacture, fabricate (هـ s.th.); to invest (هـ money) <b>III</b> to hold in play, keep occupied, divert (ه s.o.); to distract (ه s.o.) <b>IV</b> to occupy, busy, employ (ه s.o.); to occupy, hold, fill, have ( an office, a position); to fill, take up (ه s.th.), engage, engross (هـ the attention); to cover (ب هـ a space with a building or buildings), occupy, take up, fill (ب هـ a space with); to take, take up, require (هـ time); to engage, tie down (هـ forces of the opponent); to distract, divert, alienate, entice away (ه عن from) │ اشغل البال to disquiet, discomfit, make uneasy, trouble, disturb, preoccupy <b>VI</b> to occupy o.s., busy o.s. be occupied or busy, be preoccupied (ب with), be engaged (ب in), attend, devote o.s. (ب to s.th.); to pretend to be busy <b>VII</b> to occupy o.s., busy o.s. be occupied or busy, be preoccupied (ب with); to be concerned (ب about) <b>VIII</b> to busy o.s. occupy o.s. be occupied or busy (ب or في with), be engaged (ب or في in), attend, devote o.s. (في or فيto s.th.); to work; to study (Jo under or with); to work, run, operate, be in operation, be in motion (machine, and the like) │ اشتغل قلبه (qalbuhū) to be uneasy, apprehensive, worried; اشتغل به عن to be distracted by s.th. from\n\n\nشغل šugl occupancy, filling, taking up; detention, prevention, distraction (عن from); -- (pl. اشتغال ištigāl, شغول šugūl) occupation, activity; work, job; business, concern │ شاغل شغل that which ie uppermost in one’s mind, chief or foremost concern; s.th. which preoccupies s.o.’s mind or distracts s.o. (عن from); اشغال شاقة (šāqqa) hard labor; اشغال عامة (‘āmma) or اشغال عمومية (‘umūmīya) public works; شغل يدوي (yadawī) handwork; manual labor; شغل يد š. yad (colloq., used appositionally) handmade; في شغل preoccupied (من with), concerned (من about); في شغل ب busy, occupied with; كان في شغل عن to be too busy or preoccupied (ب with) to be able to attend to s.th.; الزم شغلك ilzam šuglaka mind your own business!"
}