{
  "term": "شق",
  "previous_term": "مستشفى",
  "next_term": "شقة",
  "definition": "شق šaqqa u (šaqq) to split, cleave, part, tear, rend, rip (هـ s.th.); to break (هـ s.th.); to plow, till, break up (هـ the ground); هـto furrow, traverse, cross (هـ s.th.); to pass go, travel (هـ through a region); to break (dawn); -- (شقوق šuqūq) to break forth, shoot up, sprout (plant), break through, erupt (tooth); -- (šaqq, مشقة mašaqqa) to be heavy, oppressive, burden some unbearable (على for s.o.); to grieve, trouble (على s.o.); to molest, harass inconvenience (على s.o.), be troublesome, cumbersome (على for s.o.); to visit (على s.o.). call (على upon s.o.) │ شقت جيبه (jaibahā) to tear the front of the garment as a sign of mourning (woman); شق سبيلا to cut, or open, a way for o.s.; شق السكون to break the silence; شق شارعا (طريقا) to build a street (a road); شق طريقه to force one’s way, plow ahead; شق طريقا جديدا to open up, or enter upon, a new path (fig.); شق العصا (‘aṣā) to part from the community, break with the community; شق عصا الطاعة (‘aṣā ṭ-ṭā‘a) to rebel, revolt, renounce allegiance; شق عصا القوم (‘aṣā l-qaum) to sow discord among people; ما شق غبارهم (gubārahum) he did not reach their mark; لا يشق غباره (yušaqqu gubaruhū) he is unsurpassable, he is incomparable, there is no one like him <b>II</b> to split (هـ s.th.); to tear open, rip open, slit open (هـ s.th.) <b>V</b> to be split, be cleft; to split, crack, bunt; to be cracked <b>VII</b> to be split, be cleft; to split, crack, burst; to split off, separate, segregate, secede, break away, withdraw (عن from), break (عن with), renounce (عن s.th.); to become a schismatic (Chr.); to break (dawn) │ انشقت عصاهم (‘aṣāhum) they fell out (with one another); انشقت مرارته (marāratuhū) he exploded (with anger), he blew his top <b>VIII</b> to derive (هـ من word from)\n\n\nشق šaqq pl. شقوق šuqūq fissure, crack, chink, crevice, rift, cleft, crevasse, chasm, split, rent, tear, rip, gap, slit, slot; half, moiety; -- fission, splitting, cracking, cleavage │ شق الذرة š. ad-darra atomic fission\n\n\nشق šiqq half, side, part, portion; trouble, difficulty, hardship │ شق المعارضة š. al-mu‘āraḍa opposition party; لا ... الا بشق الأنفس (illā bi-šiqqi l-anfus), بشق النفس only with great effort, with great difficulty, barely"
}