{
  "arabic": "صدر",
  "definition": "صدر ṣadara a i (صدور ṣudūr) to go out, step out (عن or من of, from within); to proceed, emanate, arise, originate, stem (عن or من from), have its origin (عن or من in); to come out, be issued, be promulgated (order, ordinance, law); to appear, be published (book); to leave, go out (mail); to go (الى to); to happen, occur, come to pass; pass. ṣudira to have a chest complaint │ صدر عن الجد (jidd) to set about seriously, get to work earnestly; صدر عن ارادته to act on one’s own volition <b>II</b> to send, send off, dispatch, forward (هـ s.th.); to export (هـ s.th.); to publish, bring out (هـ a book); to preface (هـ a book); to introduce, commence (ب هـ a book with) 506 <b>III</b> to seize, impound, confiscate (هـ s.th.); to urge, press, oppress (s.o.), throw obstacles in s.o.’s (ه) way <b>IV</b> to send, send out, dispatch (هـ s.th.); to export (هـ s.th.); to issue (هـ s.th., e.g., banknotes, bonds), make out (هـ s.th., e.g., a passport); to publish, bring out (هـ s.th., e.g., a book); to give, issue (هـ an order); to pronounce, pass (هـ a legal sentence); to utter, express (هـ an opinion, a view) <b>V</b> to be sent, be dispatched; to preside (هـ over), head (هـ a group); to have a front seat (هـ at a social gathering); to resist, oppose (ل s.o.), throw obstacles in s.o.’s (ل) way, stand in s.o.’s (ل) way <b>X</b> to bring about, obtain (هـ s.th., esp. حكما ḥukman a legal judgment or sentence); to issue (marsūman an ordinance)\n\n\nصدر ṣadr pl. صدور ṣudūr chest, breast, bust; bosom, heart; front part, front; part, portion; first hemistich; leader, commander; beginning, start, outset, commencement, inception; early period, beginnings, dawn (fig.) │ صدر الدار one who occupies the highest position in the house, who plays first fiddle in the house; صدر رحب (raḥb) generosity, magnanimity; open-mindedness, broadmindedness, liberality, frankness, candor; صدر الإسلام early period of Islam, early Islam; الصدر الأعظم title of the Grand Vizier in the Ottoman Empire; grand vizier (Mor.); صدر المكان ṣ. al-makān the foremost part of a room; صدر النهار ṣ. an-nahār daybreak, beginning of the day; ابو صدر robin (zool.); بنات الصدر banāt aṣ-ṣ. worries, anxieties, apprehensions; باب الصدر front door; ذات الصدر chest complaint; bottom of the heart, secret thoughts; رحب الصدر raḥb aṣ-ṣ. generous, magnanimous; open-minded, broad-minded, liberal; free of misgivings, unhesitating; رحيب الصدر do.; ضيق الصدر ḍayyiq aṣ-ṣ. annoyed, angry (ب at); disgruntled, depressed; منقبض الصدر munqabiḍ aṣ-ṣ. dejected, low-spirited, crestfallen; مكانة الصدر makānat aṣ-ṣ. first place, precedence, priority; واسع الصدر = رحب الصدر; صدرا من الزمان (zamān) quite a stretch of time, for some time; في الصدر in the foreground; سخم بصدره (sakkama) to irritate s.o., make s.o. angry; انشرح صدره inšaraḥa ṣadruhū to be gladdened, be pleased, be cheered, be happy, rejoice"
}