{
  "arabic": "ضرب",
  "definition": "ضرب ḍaraba i (ḍarb) to boat, strike, hit (ه s.o., هـ s.th., ب with; على ب with s.th. on; على ه s.o. on); to shoot, fire (هـ, ه at s.o., at s.th.), shell, bombard (هـ, ه s.o., s.th.); to play (هـ, على a musical instrument); to make music; to type (on a typewriter); to sting (scorpion); to separate, part (بين people); to impose (هـ على on s.o. s.th.); ضرب عن to turn away from, leave, forsake, abandon, avoid, or shun s.o. or s.th.; -- (ḍarb, ضربان ḍarabān) to pulsate, palpitate, throb, boat (vein, heart); to ache (violently), hurt (wound, tooth); to move, stir; to rove, roam about, travel (في in, through), loiter, stroll (in streets); to cruise (ship); to migrate (bird); to incline (الى to a color), shade (الى into a color); -- (ضراب ḍirāb) to cover, mount (ها the camel mare) │ ضرب له اجلا (ajalan) to fix a date for s.o.; ضرب الأرز (aruzza) to hull rice; ضرب في الأرض (arḍ) to travel; ضرب بوية على (bōya) to paint or daub s.th.; ضرب الباب to knock on the door; ضرب الجرس (jaras) to ring the bell; ضرب حقنا (ḥaqnan) to administer a syringe, give an injection; ضرب خطا (kaṭṭan) to draw a line; ضرب أخماسا لأسداس (li-asdāsin) and ضرب اخماسه في اسداسه to brood, rack one’s brain in order to find a way out; to be at one’s wit’s end; to intrigue, scheme; to build air castles; to daydream; ضرب خيمة (kaimatan) to pitch a tent; ضرب الرقم القياسي (raqma, qiyāsīya) to break a record; ضرب السلام (salām) to give a military salute; ضرب ضريبة to impose a tax (على on s.o.); ضرب اطنابه في (aṭnābahū) to take root, prevail (at a place); ضرب اطنابه على to settle down, take up permanent residence in a place; ضرب طوبا (ṭūban) to make brick; ضرب عددا في آخر (‘adadan fī ākara) to multiply a number 538 by another; ضرب عنقه ‘unuqahū) to behead, decapitate s.o., have s.o.’s head cut off; ضرب قالبه (qāllabahū) to imitate s.th.; ضرب كفا (kaffan) to slap s.o.’s face; ضرب مثلا لـ (matalan) to apply a proverb to; ضرب له مثلا (matalan) to give s.o. an example, point out a model for s.o.; ضرب مثلا to give an example; to quote as an example (هـ لـ or ب على s.th. for); ضرب الأمثال to impart words of wisdom, point out morals; ضرب نقودا to mint money; ضرب موعدا (mau‘idan) to agree on time or place of a meeting, make an appointment; ضرب الى الحمرة (الى الصفرة) (ḥumra, ṣafra) to shade into red (into yellow); ضرب به الأرض (arḍ) to throw s.o. or s.th. to the ground; ضرب في الخيال (kayāl) to be in the clouds, be unrealistic; to want the impossible; ضرب برأسه على صدره (bi-ra’sihī ‘alā ṣadrihī) to let one’s head sink to the chest; ضرب بسهم مصيب في (bi-sahmin muṣībin) to take an active part in; ضرب بسهم ونصيب في (wa-naṣībin) to participate in, share s.th.; ضرب فيه بعرق (bi-‘irq) do.; ضرب به عرض الحائط (‘urda l-ḥ.) not to give a hoot for s.th.; to disdain, despise, reject s.th.; to throw s.th. overboard, jettison s.th.; ضرب بنظره الى (naẓarihī) to turn one’s glance to; ضرب بوجه صاحبه (bi-wajhihī ṣāḥibihī) to boomerang, fall back on the originator; ضرب على كلمة (kalima) to efface, strike, or erase, a word; ضرب عنه صفحا (ṣafḥan) to turn away s.o. or s.th.; to disregard, ignore s.o. or s.th., pay no attention to, pass over s.o. or s.th.; ضرب في حديد بريد to take futile steps; to beat the air; ضرب لنفسه سبعة ايام (sab’ata ayyamin) he decided to stay seven days; ضرب بين وبينه الأيام (ayyām) fate separated me from him, drew us apart <b>II</b> to mix, blend (هـ ب s.th. with); to sow dissension, cause trouble (بين among); to quilt (هـ a fabric) <b>III</b> to contend, vie, fight (هـ with s.o.); to speculate <b>IV</b> to turn away (عن from), leave, abandon, forsake, desert, avoid, shun (عن s.o., s.th.); to remain, stay, abide (في in) │ اضرب جأشا لـ (ja’šan) to be prepared for s.th., make up one’s mind to take s.th. upon o.s.; اضرب صفحا عن (ṣafḥan) to desist, abstain from; اضرب عن العمل (‘amal) to stop work, to strike; اضرب عن الطعام (ṭa‘ām) to go, on a hunger strike <b>VI</b> to come to blows, brawl, fight, strike one another; to be divided, differ, conflict, clash, be contradictory (opinions, and the like) <b>VIII</b> to clash, surge, lap (waves); to be set, or get, into a state of unrest, turmoil, excitement, commotion, tumult, agitation, be or become agitated, troubled; to be in a lively stir, move about, bustle, hustle, romp; to sway, reel, waver; to be or become disturbed, unsettled, disorganized, disarranged, disordered, confused, entangled, upset, restless, uneasy, or anxious; to tremble, shake\n\n\nضرب ḍarb beating, striking, hitting, rapping; shooting, shelling, gunning, bombing, bombardment; multiplication; coining, formation; minting (of money); -- (pl. ضروب ḍurūb) kind, sort, specimen, species, variety; last foot of the second hemistich; (pl. اضراب aḍrāb) similar, like │ ضربخانة and دار الضرب (money) mint; ضرب الرمل ḍ. ar-raml geomancy; ضرب النار shooting, tiring, shelling, gunning, bombardment; وضع السلاح تحت الضرب to level a weapon, bold a weapon ready to fire; هو واضرابه he and the likes of him\n\n\nضرب idṭirāb pl. -āt disturbance, disorder, disarray; confusion, muddle, perturbation; disorganization, disruption, upset, derangement; trouble, commotion, unrest, riot (also pol.); restlessness, restiveness │ اضطرابات عصبية (‘aṣabīya) nervous disorders"
}