{
  "arabic": "طلع",
  "definition": "طلع ṭala‘a u (طلوع ṭulū‘, مطلع maṭla‘) to rise, ascend, come up (esp. of celestial bodies); to come into view, appear, show, become visible; to erupt (tooth), come up, sprout, break forth (plant); to go out, get out, come out, emerge (من from); to come suddenly (على upon s.o. or s.th.), overtake (على s.o., s.th.); طلع عليه ب to take or bring to s.o. s.th.; -- ṭala‘a a u (طلوع ṭulū‘) and ṭali‘a a to mount, ascend, climb, scale (هـ s.th.); to get (هـ on top of s.th., aboard s.th., into an automobile, on a train, etc.), board (هـ a train, etc.) <b>III</b> to read, peruse (هـ s.th.); to study (هـ s.th.); to look (هـ at s.th.), 564 inspect, view (هـ s.th.); to acquaint (هـ s.o. ب with), make clear, elucidate, explain, expound, disclose (ب ه to s.o. s.th.), give an insight (ب ه to s.o. into), let s.o. (ه) in on s.th. (ب); to shine (هـ on s.th.; of the sun) <b>IV</b> to erupt (tooth), come up, sprout, break forth (plant); to acquaint (على ه s.o. with); to inform (ه s.o. من or على of or about), apprise, notify (عن or على ه s.o. of), let s.o. (ه) know (على s.th. or about s.th.), tell (على ه s.o. about); to demonstrate, point out, disclose, reveal, show (على ه to s.o. s.th.); to give an insight (على ه to s.o. into), let s.o. (ه) in on s.th. (على) <b>V</b> to have an eye on s.th. (الى), wait, look out (الى for); to watch (الى for); to strive, be out (الى for), be bent (الى on); to look (الى at s.o.), regard (الى s.o.); to look attentively or closely, gaze, stare (ب or في at) <b>VIII</b> to look; to see, behold, view (على s.th.); to study, come to know (على s.th.), become acquainted (على with), become aware or cognizant (على of), obtain information (على about), be informed (على of); to inspect, examine (على s.th.), look into s.th. (على); to know (على s.th. or of s.th.), be aware, be cognizant (على of); to be (well) informed (على about), have (inside) information (على of), be (thoroughly) acquainted (على with), be privy (على to), be in on s.th. (على); to find out, discover, detect (على s.th.) <b>X</b> to seek to discover, explore, scout, reconnoiter (هـ s.th.); to inquire (هـ about s.th.); to arouse curiosity (ه in s.o.) │ استطلعه رأيه (ra’yahū) to consult s.o.) ask s.o.’s advice or opinion; استطلع خبره (kabarahū) to seek information about s.o. or s.th.\n\n\nطلع ṭal‘ (also coll.) spadix or inflorescence of the palm tree; pollen"
}