{
  "term": "طول",
  "previous_term": "طوكيو",
  "next_term": "طالما",
  "definition": "طال (طول) ṭāla u (ṭūl) to be or become long; to last long; to lengthen, grow longer, extend, be protracted, become drawn out; to surpass, excel (على or ه s.o.) │ طال به الزمن حتى (zamanu) it took a long time before he ...; يطول بي هذا this will (would) take me too long; طال الزمن او قصر (zamanu, qaṣura) sooner or later, before long <b>II</b> to make long or longer, lengthen, elongate, stretch out, prolong, extend, protract (هـ s.th.); to be very elaborate, very detailed, very exhaustive, longwinded, prolix; to grant a delay or respite (ل to s.o.) │ طول باله عليه (bālahū) to be patient with <b>III</b> to keep putting off (في ه s.o. in or with s.th.); to vie for power, greatness or stature, contend, compete (ه with s.o.), rival, emulate (ه s.o.) <b>IV</b> to make long or longer, lengthen, elongate, stretch out, extend, prolong, protract, draw out (هـ or من s.th.); to take too long, find no end │ اطال عليه to keep s.o. waiting a long time; اطال لسانه (lisānahū) to speak in a forward manner, be pert, saucy, insolent in speech; اطال النظر (naẓara) he kept staring at him; اطال الوقوف he stayed a long time <b>VI</b> to become long, be lengthened, be extended, be prolonged; to stretch up, stretch o.s.; to stretch (الى for), crane one‘. neck (الى at); to attack (على s.o.); to become insolent, get fresh (على with s.o.); to be insolent enough, have the cheek (ل to do s.th.); to dare do s.th. (ب), presume (ب s.th.), pretend (ب to s.th.); to arrogate to o.s. (الى a rank) │ تطاول برأسه (bi-ra’sihī) to bear one’s head high (with pride) <b>X</b> to be or become long; to be or become overbearing, presumptuous, display an arrogant behavior (على toward)\n\n\nطول ṭaul might, power │ صاحب الحول والطول (ṣ. al-ḥaul) the Almighty\n\n\nطول ṭūl pl. اطوال aṭwāl length; size, height, tallness │ طول الاناة ṭ. al-anāh long-suffering, longanimity, forbearance, patience; طول النظر ṭ. an-naẓar farsightedness, hyperopia; خط الطول kaṭṭ aṭ-ṭ. geographical longitude, degree of 575 longitude, meridian; بالطول and طولا lengthwise, longitudinally; طول ṭūla (prep.) during, throughout, … long, e.g., طول هذه المدة (mudda) during this period, during all this time, طول النهار (nahār) all day (long); طول ما as long as; على طول (with foll. genit.) along, along, side of; على طول (eg.) straight ahead; straightway, directly; at last, finally, after all; في طول البلاد وعرضها (wa-‘arḍihā) throughout the country, all over the country; انا في طولك (eg.) have mercy on me!\n\n\nطول ṭuwwal a long-legged waterfowl"
}