{
  "arabic": "عدل",
  "definition": "عدل ‘adala i (‘adl, عدالة ‘adāla) to act justly, equitably, with fairness │ عدل بينهم to treat everyone with indiscriminate justice, not to discriminate between them; -- ‘adala i to be equal (هـ, ه to s.o., to s.th.), be equivalent (هـ to s.th.), be on a par (هـ, ه with), be the equal (ه of s.o.), equal, match (هـ, ه s.o., s.th.), counterbalance, outweigh (هـ s.th.); to make equal, equalize, level (ب ه s.o. with another), place (ه s.o.) on the same level or footing (ب with another); -- ‘adala i (عدول ‘udūl) to deviate, swerve, deflect, turn away (الى عن from -- toward); to digress, depart, refrain, desist, abstain, avert o.s., turn away (عن from), leave off, relinquish. abandon, renounce, disclaim, give up, forego, waive, drop (عن s.th.) │ عدل به عن to make s.o. desist, abstain or turn away from; عدل ببصره الى (bi-baṣarihī) to let one’s eyes stray to or toward; -- ‘adula u (عدالة ‘adāla) to be just, fair, equitable <b>II</b> to straighten, make or put straight, set in order, array (هـ s.th.); to balance, right, rectify, put in order, straighten out, fix, settle, adjust (هـ s.th.); to make (هـ s.th.) just; to adapt (هـ s.th.); to change, alter, commute, amend, modify, improve (هـ s.th.); to modulate (هـ current, waves; el.) <b>III</b> to be equal (هـ, ه to s.o., to s.th.), be equivalent (هـ to s.th.), be on a par (هـ, ه with), be the equal (ه of s.o.), equal, match (هـ, ه s.o., s.th.), counterbalance, outweigh (هـ s.th.); to equate, treat as equal (بين -- وبين two persons or things) <b>IV</b> to straighten, make or put straight (هـ s.th.) <b>V</b> to he changed, be altered, be commuted, be modified, undergo modification, change or alteration <b>VI</b> to be in a state of equilibrium, be balanced; to be equal, be on a par; to offset one another, strike a balance <b>VIII</b> to straighten (up), tense; to draw o.s. up, sit straight, sit up; to be straight, even, balanced; to be moderate, be temperate\n\n\nعدل ‘adl straightness, straightforwardness; justice, impartiality; fairness, equitableness, probity, honesty, uprightness; equitable composition, just compromise; -- (pl. عدول ‘udūl) just, equitable, fair, upright, honest; person of good reputation, person with an honorable record (Isl. Law); juristic adjunct assigned to a cadi (Magr.); عدلا ‘adlan equitably, fairly, justly │ وزير العدل minister of justice\n\n\nعدل ‘idl equal, tantamount, corresponding; -- (pl. اعدال a‘dāl, عدول ‘udūl) either of the two balanced halves of a load carried by a beast of burden; sack, bag"
}