{
  "term": "عد",
  "previous_term": "عجوة",
  "next_term": "عدة",
  "definition": "عد ‘adda u (‘add) to count, number, reckon (هـ s.th., من .s.o. among); to enumerate (هـ s.th.); to compute, calculate (هـ s.th.); to regard (هـ هـ, ه s.o., s.th. as), look (هـ هـ, ه at s.o., at s.th. as), consider, think, deem (هـ هـ, ه s.o., s.th. to be s.th.); pass. ‘udda to be considered, go (هـ as s.th.), pass (هـ for s.th.); to amount (ب to) │ عد الأنفاس عليه (to count s.o.’s breathing =) to watch closely over s.o., keep a sharp eye on s.o., watch s.o.’s every move; عد هـ على to put down, or charge, s.th. to s.o.’s disadvantage; لا يعد (yu‘addu) numberless, countless, innumerable <b>II</b> to count off, enumerate (هـ s.th.); to make numerous, multiply, compound (هـ s.th.) │ عدد الميت (mayyita) to enumerate the merits of a dead person, eulogize s.o. <b>IV</b> to prepare (ل هـ, ه s.o., s.th. for); to ready, make ready, get ready (ل هـ, ه s.o., s.th. for); to prepare, finish, fit, fix up, adapt, adjust, dress, arrange, dispose, set up, make (ل ه s.th. for), draw up, draft, work out (هـ e.g.. a report); to prepare (هـ one’s lesson) │ اعد عدته ل (‘uddatahū) to make one’s preparations for, prepare o.s. for <b>V</b> to be or become numerous, be manifold, be multifarious, be multiple; to multiply, increase in number, proliferate, be compounded <b>VIII</b> to regard (هـ هـ, ه s.o., s.th. as), look (هـ هـ, ه at s.o., at s.th. as), consider, think, deem (هـ هـ, ه s.o., s.th. to be s.th.); to reckon (ب with), rely (ب upon); to put down (هـ, ب s.th., ل to s.o.’s credit, على to s.o.’s disadvantage); to hold (ب على against s.o. s.th.), take exception (ب على to s.o. because of s.th.); to provide o.s., equip o.s. (ب with); (of a woman) to observe the iddat, or legally prescribed period of waiting, before contracting a new marriage <b>X</b> to get ready, ready o.s.; to stand prepared, keep in readiness, stand by; to prepare o.s.; to be ready, willing, prepared (ل for, to do s.th.)\n\n\nعد ‘add counting, count; enumeration, listing; computation, calculation"
}