{
  "term": "عرض",
  "previous_term": "معرص",
  "next_term": "عرضي",
  "definition": "عرض ‘aruḍa u to be or become wide, broad, to widen, broaden; -- ‘araḍa i (‘arḍ) to become visible, appear (ل to s.o.); to get in s.o.’s (ل) way; to happen (ل to s.o.), befall (ل s.o.); to occur (ل to s.o.), come to s.o.’s (ل) mind; to turn (ل to s.o., to s.th.); to take care (ل of), concern o.s. (ل with), turn one’s attention, put one’s mind, apply o.s., attend (ل to), go in (ل for), go into s.th. (ل), enter, embark (ل upon), take up, treat (ل s.th.), deal (ل with); to show, demonstrate, present, set forth, display, exhibit, lay open, submit, turn in (على هـ s.th. to s.o.), lay, put (على هـ s.th. before s.o.); to show (هـ e.g., a film), stage (هـ e.g., a play); to offer, suggest, propose (على هـ s.th. to s.o.); to subject (على هـ s.th. to a critical examination, and the like); to inspect (هـ s.th.); to review (هـ troops), pass in review (هـ s.th., also before one’s mental eye); pass. ‘uriḍa to be or go mad, insane │ عرض له عارض an obstacle arose in his path; عرض له خاطر a thought occurred to him, he had an idea <b>II</b> to make wide or broad, widen, broaden, extend (هـ s.th.); to expose (ل هـ, ه s.o., s.th. to s.th., esp. to risk: ل هـ s.th. to the sun); to intimate, insinuate (ل or ب s.th.), allude (ل or ب to), hint (ل or ب at) │ عرضه للنور to hold s.th. against the light <b>III</b> to offer resistance (هـ, ه to s.o., to s.th.), resist (هـ, s.o., s.th.), work against s.o. or s.th. (هـ, ه); to contradict, oppose (هـ, ه s.o., s.th.), raise objections, protest, remonstrate (هـ, ه against s.o., against s.th.); to be against s.o. or s.th. (هـ, .); to avoid, shun (هـ, ه s.o., s.th.); to compare (ب هـ s.th. with) <b>IV</b> to turn away, avert o.s. (ب from), avoid, shun (عن s.o., s.th.), shirk (عن s.th.), give up, abandon, relinquish, discard, renounce, disclaim (عن s.th.); not to mention (عن s.th.): اعرض عن ... الى to turn away from s.th. and to s.th. else <b>V</b> to resist, oppose (ل s.o., s.th.), stand up (ل against), raise objections, object (ل to); to face (ل s.th., e.g., a problem); to interfere (ل with), meddle (ل in); to put one’s mind, turn one’s attention (ل to), go into s.th. (ل, e.g., a topic): to undertake (ل s.th.), embark (ل upon s.th.); to expose o.s., be exposed, be subjected (ل to s.th.); to run the risk (ل of), risk (ل doing or being s.th.); to dare, venture, risk (ل s.th.) <b>VI</b> to oppose one another; to be contradictory, conflict, be incompatible (مع with) <b>VIII</b> to betake o.s., go, present o.s. (ه to s.o.); to raise an objection, make objections, object (على to). veto (على s.th.), remonstrate, protest (على against); to resist, oppose (على s.o., s.th.); to stand up (ل or هـ, ه against s.o., against s.th.), stand in, or obstruct, the way of s.o. or s.th. (ل or هـ, ه); to hinder impede, obstruct (ل s.o.); to happen (ه to s.o.), befall (ه s.o.) │ اعترض سبيله to block s.o.’s way <b>X</b> to ask to be shown (ه s.o., هـ s.th.); to pass in review (هـ s.th., esp. in one’s imagination, before one’s mental eye), call up, conjure up, call to one’s mind, picture to o.s., visualize (هـ s.th.); to weigh, consider, examine (هـs.th.); to inspect, review (هـ troops); to expound, set forth (هـ s.th.); to proceed ruthlessly; to massacre without much ado (هم the enemy)\n\n\nعرض ‘arḍ pl. عروض ‘urūḍ breadth; width; presentation, demonstration, staging, show(ing), performance; display, exposition, exhibition; submission, filing (e.g., of an application); proposition, proposal, offer, tender; parade; review (mil.); merchandise, goods │ بالعرض across, crosswise, in breadth; العرض والطلب (ṭalab) supply and demand; عرض الأزياء ‘a. al-azyā’ fashion show; عرض حال ‘a. ḥāl or عرضحال pl. عرضحالات ‘arḍuḥālāt application, petition, memorial; خط (درجة) العرض kaṭṭ (darajat) al-‘a. degree 603 of latitude; شباك العرض šubbāk al-‘a. show window; يوم العرض yaum al-‘a. the Day of Judgment, Doomsday\n\n\nعرض ‘urḍ pl. اعراض a‘rāḍ honor, good repute; dignity │ انا في عرضك I rely on your generosity, have mercy upon me!\n\n\nعرض ‘urḍ side; middle │ في عرض البحر (‘u. il-baḥr) at sea, on the high seas; القى (ضرب) به عرض الحائط to undervalue, scorn, disdain, despise, reject s.th.; to ruin, thwart, foil s.th.; to throw s.th. overboard, jettison s.th.; نظر اليه عن عرض (‘an ‘urdin) he looked askance at him, he gave him a slanting glance (contemptuously); في عرض الناس amid the crowd of people; هو من عرض الناس he belongs to the common people\n\n\nعرض ‘araḍ pl. اعراض a‘rāḍ accident (philos.); contingent, nonessential characteristic; s.th. nonessential, a contingent, s.th. accidental: symptom, manifestation of disease; عرضا ‘araḍan, بالعرض incidentally, by chance"
}