{
  "term": "عرف",
  "previous_term": "معترض",
  "next_term": "عرفي",
  "definition": "عرف ‘arafa i (معرفة ma‘rifa, عرفان ‘irfān) to know (هـ, ه s.o., s.th.); to recognize, perceive (هـ, ه s.o., s.th.); to be cognizant, be aware (هـ of s.th.), be acquainted (هـ with s.th.), to discover, experience, find out (هـ s.th.); to recognize, acknowledge (ب s.th., هـ s.th. as being right; هـ هـ s.th. as); to concede, acknowledge (ل هـ s.th. to s.o.), allow (ل هـ for s.th. in s.o.); to approve (هـ of); to distinguish, differentiate (من هـ, ه s.o., s.th. from); pass. ‘urifa to be known (ب as, by the name of) │ عرف حق المعرفة (ḥaqqa l-m.) to know for sure, be sure (of), be positive (about); عرفت له الجميل she was grateful to him, she appreciated his service, she gratefully acknowledged his service <b>II</b> to announce (هـ ه to s.o. s.th.), inform, advise, apprise (هـ ه s.o. of), acquaint (هـ ه s.o. with s.th.); to introduce (الى or ب ه s.o. to s.o. else), have (ه s.o.) meet (الى or ب s.o. else), present (ب ه s.o. to s.o. else); to define (هـ s.th.); to determine, specify, characterize, explain (هـ s.th.); (gram.) to make definite (هـ a noun); (Chr.) to confess (ه a penitent), hear the confession (ه of s.o.) <b>V</b> to become acquainted (ب or الى also على with s.o.), meet (ب or الى s.o.), make the acquaintance of s.o. (ب or الى); to make o.s. known, disclose one’s identity, reveal o.s. (الى to s.o.); to acquaint o.s., familiarize o.s. (ل. or الى with), get to know (على or الى s.th.); to sound, explore (هـ s.th.); to trace, discover, uncover (هـ s.th.); (gram.) to be or become definite (noun) <b>VI</b> to become acquainted with one another, become mutually acquainted, get to know each other; to become acquainted (ب with); to come to know (هـ s.th.), learn (هـ about) <b>VIII</b> to confess, admit, acknowledge, own, avow (هـ s.th.); to recognize (ب s.o., s.th.), grant recognition (ب to s.o., to s.th.); to concede, acknowledge (ل ب s.th. to s.o.); to make a confession, to confess (Chr.) │ اعترف بالجميل to be grateful <b>X</b> to discern, recognize (هـ s.th.)\n\n\nعرف ‘arf fragrance, perfume, scent, aroma 605\n\n\nعرف ‘urf beneficence, kindness; custom, usage, practice, convention, tradition, habit; legal practice; custom, customary law (jur.); (pl. اعراف a‘rāf) crest, comb (or a rooster), mane (of a horse) │ في عرفه as was his wont, according to his habit; in his opinion; العرف السياسي (siyāsī) protocol\n\n\nعرف ‘arīf pl. عرفاء ‘urafā’2 knowing (ب s.th.), cognizant, aware (ب of s.th.); expert, authority, specialist; teaching assistant, monitor (an older pupil assisting the teacher of a Koran school); sergeant (Ir.); corporal (U.A.R); رئيس العرفاء a military rank, approx.: master sergeant (Ir., Syr.); نائب عريف approx.: corporal (Ir.); (pl. عرفان ‘irfān) teacher, esp. a teacher and precentor of congregational singing (Copt.-Chr.)"
}