{
  "arabic": "عطف",
  "definition": "عطف ‘at`tafa i (‘at`tf) to bend, incline, bow (هـ s.th.); to incline, lean (الى toward, to); to be favorably disposed (على toward s.o.), be attached (على to s.o.), harbor affection (على for), be fond (على of s.o.), have or feel compassion, sympathize (على with s.o.), feel (على for s.o.); to turn away (عن from); عطف به to incline, dispose s.o. (على toward), awaken affection or sympathy (على for) or interest (على in s.th.); عطف به على to make s.o. appreciate s.th., bring s.th. close to s.o.’s heart; عطف به عن to dissuade, alienate s.o. from <b>II</b> to fold, double, fold up (هـ s.th.); to make (ه s.o.) favorably disposed; to soften s.o.’s (ه) heart, move s.o.; to awaken affection, sympathy, tenderness (ه in s.o., على for); to fill with affection, love, etc. (ه s.o., هـ s.o.’s heart, على or نحو for) <b>V</b> to be favorably disposed (على toward s.o.), be attached (على to s.o.), be fond (على of s.o.), have or feel compassion, sympathize (على with s.o.), feel (على for s.o.); to deign (ب to do s.th.) │ تعطف بالعطاف to put on a coat, wrap o.s. in a coat or cloak <b>VI</b> to harbor mutual affection, be attached to one another <b>VII</b> to be bent, inclined, crooked, or curved; to bend, curve; to bow, make a bow; to turn off (الى toward, to), turn, swing (الى into a road, etc.); to be favorably disposed (الى, على toward), be attached (الى, على to), be fond (الى, على of), have or feel compassion, sympathize (الى, على with), feel (الى, على for s.o.); to turn away, turn around <b>VIII</b> اعتطف بالعطاف = تعطف بالعطاف <b>X</b> to ask for, or seek, s.o.’s (ه) compassion or sympathy; to entreat, beseech, implore (ه s.o.); to affect winning or conciliatory manners, display affection; to seek to conciliate, propitiate, or 620 win over (خاطره kāṭirahū or ه s.o.); to seek to be friends (ه with s.o.); to try to attract or win (هـ s.th.)\n\n\nعطف ‘aṭf bond(ing), inclination, curving, curvature; corner; sympathy (على with), affection, attachment, liking (على for) │ اداة (حرف) العطف adāt (ḥarf) al-‘a. conjunction (gram.); عطف البيان ‘a. al-bayān explicative apposition (gram.)\n\n\nعطف ‘iṭf pl. اعطاف a‘ṭāf side (of the body) │ لين الأعطاف layyin al-a. tractable, docile, pliant; ترنحت الأعطاف (tarannaḥat) they were carried away, became ecstatic; ضم بين أعطافه to combine, encompass, comprise s.th.\n\n\nعطف musta‘ṭaf imploring, beseeching, supplicatory; tender, affectionate"
}