{
  "arabic": "علم",
  "definition": "علم ‘alima a (‘ilm) to know (ب or هـ, ه s.o., s.th.), have knowledge, be cognizant, be aware (ب or هـ of s.th.), be informed (ب or هـ about or of s.th.), be familiar, be acquainted (ب or هـ with s.th.); to perceive, discern (ب or هـ s.th.), find out (ب or هـ about s.th., من from), learn, come to know (ب or هـ s.th. or about s.th., من from); to distinguish, differentiate (من هـ s.th. from) <b>II</b> to teach (ب ه or هـ ه s.o. s.th.), instruct, brief (ب ه or هـ ه s.o. in s.th.); to train. school, educate (ه s.o.); to designate, mark, earmark, provide with a distinctive mark (على s.th.); to put a mark (على on) <b>IV</b> to let (ه s.o.) know (ب or هـ s.th. or about s.th.), tell (ب or هـ ه s.o. about), notify, advise, apprise, inform (ب ه or هـ ه s.o. of or about s.th.). acquaint (ب ه or هـ ه s.o. with) <b>V</b> to learn, study (A s.th.); to know (هـ s.th.) <b>X</b> to inquire (عن ه or هـ ه of s.o. about), ask, query (عن ه or هـ ه s.o. about), inform o.s. (هـ ه or هـ ه through s.o. about). gather information (عن ه or هـ ه from s.o. about)\n\n\nعلم ‘ilm knowledge, learning, lore; cognizance, acquaintance; information; cognition, intellection, perception, knowledge; (pl. علوم ‘ulūm) science; pl. العلوم the (natural) sciences │ علما وعملا ‘ilman wa-‘amalan theoretically and practically; ليكن في علمه (li-yakun) be it known to him, may he know, for his information; كان على علم تام ب (tāmm) to know s.th. inside out, be thoroughly familiar with s.th.; to have full cognizance of s.th.; علم الجراثيم bacteriology; علم الاجتماع sociology; علم الحساب arithmetic; علم الحياة ‘i. al-ḥayāh biology; علم الأحياء do.; علم الحيوان ‘i. al-ḥayawān zoology; علم الأخلاق ethics; علم الذرات ‘i. ad-darrāt nuclear physics; علم التربية ‘i. at-tarbiya pedagogy; علم الصحة ‘i. aṣ-ṣiḥḥa hygiene; علم الأصوات phonetics; علم المعادن ‘i. al-ma‘ādīn mineralogy; علم اللغة ‘i. al-luga lexicography; علم النباتات ‘i. an-nabātāt botany; علم النفس ‘i. an-nafs psychology; علم وظائف الأعضاء ‘i. w. al-a‘ḍā’ physiology; طالب علم ṭālib ‘ilm student; كلية العلوم kullīyat al-‘u. the Faculty of Science of the Egyptian University\n\n\nعلم ‘alam pl. اعلام a‘lām sign, token, mark, badge, distinguishing mark, characteristic; harelip; road sign, signpost, guidepost; flag, banner; a distinguished, outstanding man; an eminent personality, au authority, a star, a luminary; proper name (gram.) اشهر من نار على علم very famous; اسم العلم ismun ‘alamun or ism ‘alamin pl. اسماء الأعلام proper name (gram.); علم الوصول receipt\n\n\nعلم ‘alīm pl. علماء ‘ulamā’ knowing; cognizant, informed; learned, erudite; العليم the omniscient (one of the attributes of God)"
}