{
  "term": "عمل",
  "previous_term": "عميق",
  "next_term": "عملي",
  "definition": "عمل ‘amila a (‘amal) to do, act, operate, be active, work (also: في in a field); to make, produce, manufacture, fabricate, perform, carry out, execute (هـ s.th.); to act (ب according to, in accordance with, on the strength of, on the basis of); to operate, put into operation, set going (ب s.th.); to plan, contrive, seek to accomplish, practice, pursue (على s.th.), aim, work away (ل or على at), be out, strive (ل or على for), apply o.s. (على to), take pains, endeavor, exert o.s. (على to do s.th.), be active (على in the service of s.th.); to process, work, treat (في s.th.); to act (في upon s.th.), affect (في s.th.); (gram.) to govern (في a syntactical member) │ يعمل به (yu‘malu) it is valid, is effective, is in force (e.g., an ordinance); عمل ترتيبات to make arrangements or preparations; عمل اعماله (a‘mālahū) to behave, or act, like s.o.; لا به يعمل ولا علي يعول (yu‘malu, yu‘awawalu) null and void <b>II</b> to appoint as vicegerent or governor (ه على s.o. over, of); to fester, suppurate, be purulent (wound) 644 <b>III</b> to apply (ه ب toward s.o. s.th.); to treat (ب ه s.o. in a manner), proceed, deal (ب with s.o. in a manner); to trade, do business (ه with s.o.) │ عامله بالمثل bi-l-mitl) to repay s.o. like for like, treat s.o. in like manner <b>IV</b> to make (هـ s.th.) work, put to work, operate, put into operation, bring to bear, employ, woe (هـ s.th.); ب or اعمل هـ في to putter, or tinker, with s.th. about s.th. else, work with s.th. on s.th. else │ اعمل الفكر (fikra) to busy the mind, think, reflect, ponder, muse; اعمل السيف في رقابهم (saifa) he caused a massacre among them, had them massacred <b>V</b> to go to a lot of trouble, take great pains, spend much effort <b>VI</b> to trade, do business (with one another); to trade, do business (مع with) <b>VIII</b> to work, be active, operate <b>X</b> to apply (هـ s.th.), use, employ (هـ, ه s.o., s.th.); to put into operation, operate, run (هـ s.th.); to place s.o. (ه) at the head of s.th. (على), install, instate (على ه s.o. over) │ استعمل معه وسائل القسوة (wasā’il l-qaswa) he brought severe measures to bear upon him\n\n\nعمل ‘amal doing, acting, action, activity; work, labor; course of action, way of acting, practice; achievement, accomplishment; activity (على for), work (على in the service of s.th.); making, production, manufacture, fabrication; performance, execution; make, workmanship; practical work, practice; -- (pl. اعمال a‘māl) act, action; operation (mil.); work, job, chore, labor; deed, feat, achievement, exploit; occupation, business; trade, craft, handicraft; vicegerency, province, district; administrative district (e.g., Eg., Tun.); العمل ب validity, effectiveness of s.th. (e.g., of an ordinance, and the like) │ اجراء العمل ب (ijrā’ al-‘a.) enforcement, implementation of s.th.; ما العمل what’s to be done now! what’s there to be done? what can you do? عملا ب (‘amalan) in execution of, in pursuance of, according to, pursuant to, is stipulated by; اعمال حربية (ḥarbīya) belligerent, or warlike, acts, military operations; الأعمال الأربعة(arba‘a) the first four rules of arithmetic; اعمال منزلية (manzilīya) household chores, household work; اعمال يدوية (yadawīya) handiwork(s), manual work; صاحب العمل employer"
}