{
  "arabic": "عهد",
  "definition": "عهد ‘ahida a (‘ahd) to know (هـ, ه s.o., s.th.; هـ s.th., e.g., a quality, a trait, ب of s.o.), be acquainted, familiar (هـ, ه with); to observe closely, heed (هـ s.th.), adhere (هـ to s.th.); to attend (هـ to), look after s.th. (هـ); to delegate, entrust, assign, commit (ب الى to s.o., s.th.), vest (ب الى in s.o. s.th.), communion, charge, authorize, empower. entrust (ب الى s.o. with, or s.o. with the task of ...); to impose, enjoin (ب الى on s.o s.th., or on s.o. the obligation to ...), obligate, commit (ب الى s.o. to do s.th.) │ فيما اعهد (a‘hadu) to my knowledge, as far as I know; عهد ووعد (wa‘dahū) to fulfill, or keep, one’s promise <b>III</b> to make a contract, compact, or covenant (على ه with s.o. concerning); to promise (على ه to s.o. s.th. also ب s.th.); to engage, undertake, bind o.s. pledge o.s. commit o.s. obligate o.s. (على ه to s.o. to do s.th.) <b>V</b> to advocate, support (s.th.), stand up (هـ for s.th.); to observe, heed, keep in mind (هـ s.th.), pay attention, see, attend (هـ to s.th.), take care (هـ of s.th.); to care (هـ for s.th.), maintain, keep up, service (هـ s.h.); to be liable for the maintenance or upkeep (هـ of s.th.); to assume. take upon o.s. (ب s.th.); to engage, undertake, bind o.s. pledge o.s., commit o.s. obligate o.s. (ب ل to s.o. to do s.th., also ان على to do s.th.); to promise (ب ل to s.o. s.th.) <b>X</b> to exact a written pledge or commitment (من from s.o.); to have s.o. (من) sign a contract\n\n\nعهد ‘ahd knowledge; acquaintance, contact (ب with); the well-known, familiar nature (of s.o.); close observance, strict adherence (to), keeping, fulfillment (of a promise); delegation, assignment, committing (الى ب of s.th. to s.o.), vesting (ب الى in s.o. of s.th.), commissioning, charging, entrusting (ب الى of s.o. with s.th.); commission; -- (pl. عهود ‘uhūd) commitment, obligation, liability; responsibility; pledge, vow; promise; oath; contract, compact, covenant, pact, treaty, agreement; time, epoch, era │ بعد العهد bu‘d al-‘a. the fact that s.th. is long pact, that s.th. belong, to the remote past; حديث العهد recent, late, new, young; قريب العهد do.; حديث العهد or حديث عهد ب (ḥ. ‘ahdin) having adopted or acquired 651 (s.th.) recently; not long accustomed to (s.th.), inexperienced at (s.th.), new at (s.th.), newly, e.g., حديث عهد بعرس (bi-‘ursin) newly wed, حديث العهد بالولادة newborn; كان حديث عهد بأوربا he had not known Europe until recently; قديم العهد of an early date, long past, long-standing; قديم العهد ب of long experience in, long acquainted with; قريب عهد ب (q. ‘ahdin), قريب العهد ب = حديث عهد ب, حديث العهد ب; قريب عهد بالفطام (fiṭām) just weaned. newly weaned; ...-I,} ¥ <J- for a abort time (past), of late; recent, late; recently, lately, the other day; منذ عهد بعيد a long time ago; لا عهد له (‘ahda) not to know s.th.; not having experienced s.th., being unacquainted with ...; عهدنا بهذه المسألة (‘ahdunā, mas’ala) our long-standing knowledge of this question; اخذ عهدا عليه to exact a promise from s.o., pledge s.o.; قطع عهدا to conclude a treaty, make a contract; to make a promise; قطع نفسه عهدا على to assume an obligation, commit o.s. obligate o.s. pledge o.s.; to vow, make a vow (ب to do s.th.); عهد الأمان ‘a. al-amān (formerly:) an order bestowed by the Bey of Tunis; عهد الأمان المرصع (muraṣṣa‘) a higher class of the afore-mentioned order; العهد الجديد the New Testament; العهد القديم the Old Testament; ولي العهد walīy al-‘a. heir-apparent, crown prince; على عهده at or in his time; في عهد فلان during s.o.’s lifetime; in s.o.’s epoch; عهده his familiar nature or manner, his nature as it had always been known; ظل كعهده (ẓalla) he remained as he had always been, as everybody used to know him; عهدهم the nature or manner that they know (knew) of him (or of it), that they are (were) used to; كعهدهم به such as they used to know him; ما زلت انت كعهدي بك yon are still the same! ما زال على عهده to be unchanged, be as always; طال به العهد (‘ahdu) to last, or have lasted, a long time"
}