{
  "arabic": "عود",
  "definition": "عاد (عود) ‘āda u (‘aud, عود ‘auda, معاد ma‘ād) to return, come back (ل or الى to); to flow back; to go back. be traceable, be attributable (الى to); to revert, redound, accrue (على to); to refer, relate (على to); to be due. go back (الى to); to fall to s.o.’s (الى) lot or share, fall in s.o.’s ((الى bailiwick; to belong, (ap)pertain, be proper (الى or ل to); to give up, abandon, relinquish (عن s.th.), withdraw, resign (عن from); عاد ب to return with = to lead back, bring back, take back, return, reduce, revert s.o. or s.th. (الى to); عاد عليه ب to bring about, entail s.th. for s.o s. result in s.th. for s.o., yield, bring in, return s.th. to s.o.; (with predicate adjective or noun in acc.) to become, grow (into), turn into; (with foil. imparf. or الى) to resume, renew (an activity); (with neg. and foil. imparf.) to do s.th. no more or no longer; with foil. finite verb) to do s.th. again or anew; -- u (عيادة ‘iyāda) to visit (ه a patient), have under treatment (ه s.o.; of a physician) │ عاد الى نفسه to regain consciousness, come to; to take counsel with o.s., hold self-communion, examine o.s. introspectively, search one’s soul; عادت المياه الى مجاريها (majārīhā) the situation returned to normal; عاد الى رأس أمره ra’s amrihī) to start s.th. all over again; عاد ادراجه (adrājahū) to retrace one’s steps; to turn back, go back; عاد على عقبيه (‘aqbaihi), pl. عادوا على اعقابهم (a‘qābihim) do.; لم اعد استطيع صبرا lam a‘ud astatī‘u ṣabran I could not stand it any longer; لم يعد لع طاقة به (ya‘ud, ṭāqatun) he no longer had any power over it; لم يعد اليه سبيل there is no longer any possibility for it; عاد يقول he continued (after a pause in his speech) <b>II</b> to accustom, habituate, condition, inure, season (على or هـ ه s.o. to s.th.), make s.o. (ه) get used (على or هـ to s.th.) <b>III</b> to return (هـ, ه to s.o., to s.th.); to revert, come back, turn again, apply o.s. anew (هـ to s.th.), take up again, resume (هـ 653 s.th.); to befall again, seize again (ه s.o.), come again (ه over s.o.) <b>IV</b> to cause to return, bring back, take back (ه هـ الى s.o., s.th. to); to return, give back, send back (هـ الى, ه s.o., s.th. to s.o.); to put back, lay back (هـ s.th., الى محله ilā maḥallihī in its place); to repeat (على هـ s.th., i.e., words, to s.o.); to reiterate, repeat, do again or anew, renew, resume (هـ s.th.); to re-establish, restore, repair (هـ s.th.); to restore (هـ هـ s.th. to), make s.th. (هـ) once more (هـ s.th.); to reinstate, reinstall (هـ s.o.) │ اعاد بناء مسجد (binā’a masjidin) to rebuild a mosque; اعاد ذكريات (dikrayāt) to revive, or reawaken, memories; اعاد طبع الكتاب (ṭab‘a l-k.) to reprint a book; يعيد القول ويبدأه (yu‘īdu, yabda’uhū) he keeps talking of it, he continue, to bring up the subject; اعاد النظر في (naẓara) to re-examine, reinvestigate, reconsider, check, verify, revise s.th., go over s.th. or into s.th. again; اعاد النظر في الدعوى (da‘wā) to retry the case (jur.) <b>V</b> to get used, be accustomed, habituate o.s. (على or هـ to s.th.), make a habit (على or هـ of s.th.), be used to doing, be wont to do (على or هـ s.th.) <b>VIII</b> = V; <b>X</b> to recall, call back (هـ, ه s.o., s.th.); to reclaim, demand back (من هـ s.th. from); to regain, recover, recuperate, reconquer, fetch back, get back, retrieve (هـ s.th.); to recall, recollect, call back to one’s mind (هـ s.th.); to ask s.o. (ه) to repeat (هـ s.th.)\n\n\nعود ‘ūd pl. اعواد a‘wād, عيدان ‘īdān wood; stick, rod, pole; branch, twig, switch; stem, stalk; cane, reed; aloes (wood); lute (musical instrument); body, build, physique; strength, force, intensity; pl. اعواد full intensity (e.g., of a disease) │ عود الثقاب matchstick, match; عود الصليب peony (Paeonia; bot.); عود الكبريت ‘ūd al-kibrīt matchstick, match; رخاوة العود rakāwat al-‘ūd weakness of character; صلب العود ṣulb al-‘ūd of robust physique; strongly built, husky, sturdy; stubborn, resistant, unbending, unyielding, relentless; صلابة العود ṣalābat al-‘ūd sternness, severity, hardness, obstinacy, stubbornness, inflexibility, relentlessness; لدن العود ladn al-‘ūd lissome, lithe, of elastic physique; ثقف عوده (taqqafa) to train, educate s.o.; عجم عوده (‘ūdahū) to test s.o., put s.o. to the test; كسر عوده (‘ūdahū) to break s.o.’s power of resistance, crush s.o.’s spirit\n\n\nعود ‘aud return; reversion; recurrence; recidivism (jur.); repetition, reiteration │ فعله عودا وبدءا fa‘alahū ‘audan wa bad’an or فعله عوده على بدئه (‘audahū) or فعله عودا الى بدء he did or started it all over again"
}