{
  "arabic": "فصل",
  "definition": "فصل faṣala i (faṣl) to separate, part, divide, disjoin, divorce, cut off, detach, set apart, segregate (عن هـ, ه s.o. s.th. from); to separate (بين two things or persons); to isolate (هـ s.th.); to cut, sever, sunder, interrupt (هـ s.th.); to discharge, dismiss, fire, sack, expel (من or عن ه s.o. from an office), relieve, divest (من or عن ه s.o. of an office), cashier (ه s.o.); to decide (هـ a controversy, and the like), make a decision. render judgment (في in, about, with respect to); to fix the price (هـ for s.th.); -- (فصال fiṣāl) to wean (ه عن الرضاع the infant from sucking); -- faṣala u (فصول fuṣūl) to go away, depart, move away (عن or من from), leave (عن or من a place), pull out (عن or من of a place) <b>II</b> to divide into particular sections, arrange in sections, group, classify, categorize (هـ s.th.); to present in logical order, set forth in detail, detail, particularize (هـ s.th.); to make (هـ s.th.) clear, plain, distinct; to make to measure, cut out (هـ a garment) <b>III</b> to separate o.s., dissociate o.s., be separated (ه from s.o.), part company (ه with); to haggle, bargain (على ه with s.o. for) <b>VII</b> to separate o.s., disengage o.s., dissociate o.s. segregate, secede (عن from); to be separated, disjoined, detached, removed, set aside, cut off (عن from), be interrupted; to be discharged, dismissed, fired, sacked, cashiered; to retire, resign (من or عن from an office), be relieved, be divested (من or عن of an office); to quit, leave (من or عن a political party, and the like)\n\n\nفصل faṣl parting, disjunction, detachment, severance, sunderance, cutting off; separation; division, partition; discharge, dismissal (من or عن from an office); decision, (rendering of) judgment; -- (pl. فصول fuṣūl) section, part; chapter; act (of a play); movement (of a symphony, etc.); article (in a newspaper); class, grade (school); season │ فصل الخطاب (in letters:) conclusion of the formal greetings by the words اما بعد 715 ammā ba‘du; conclusion, termination; decision; unmistakable judgment; بيني وبينك فصل الخطاب we’re through with one another once and for all; فصل التمثيل (theater) season; القول الفصل (qaul) the last word, the final decision; يوم الفصل yaum al-f. Day of Judgment, Doomsday"
}