{
  "term": "فضل",
  "previous_term": "فضفاض",
  "next_term": "فضلة",
  "definition": "فضل faḍala u and faḍila a (faḍl) to be surplus, be in excess, be left (over), remain; -- faḍala u (faḍl) to excel, surpass (على or هـ, ه s.o., s.th.); to be excellent, superior, exquisite, good, be better, be more 717 adequate <b>II</b> to prefer (على هـ, ه s.o., s.th. to s.o., to s.th.), like better (هـ, ه s.o., s.th., على than); to give preference (على هـ, ه to s.o., to s.th. over), set s.o. or s.th. (هـ, ه) before or above (على) <b>III</b> to contend for precedence or superiority (ه with s.o.) │ فاضل بين شيئين to compare two things in order to determine which deserves preference <b>IV</b> to confer a benefit (على upon s.o.), do (على s.o.) a favor, oblige (على s.o.); to present, honor (ب على s.o. with), bestow, confer (ب على upon s.o. s.th.), grant, award (ب على to s.o. s.th.) <b>V</b> = IV; to have the kindness (ب of doing or to do s.th.; or ف fa with finite verb), be so kind (ب as to do s.th.; or ف with finite verb), deign, condescend, be graciously disposed (ب to do s.th.; or ف with finite verb); (imperative) tafaḍḍal please! if you please; to put on house clothes, be dressed for around the house\n\n\nفضل faḍl pl. فضول fuḍūl surplus, overplus, excess, superfluity, overflow; leftover, remainder, remnant, rest; matter of secondary importance, subordinate matter; -- pl. فضول that which is superfluous, redundant or in excess, a surplus, overplus, superfluity; waste, refuse; droppings, excrements; -- superiority (على over); precedence, priority (على over), preference (على to); grace, favor (على to, toward); kindness, graciousness, amiability; erudition, culture, refinement; -- (pl. افضال afḍāl) merit, desert (في on behalf of, with respect to), credit (for, in), service(s) (على to); benefit, favor, gift, present │ فضلا عن (faḍlan) beside, aside from ..., not to speak of …, let alone ..., to say nothing of ...; فضلا عن ذلك besides, moreover, furthermore; بفضل thanks to, owing to, due to; من فضلك please! if you please; يرجع الفضل في ذلك (yarji‘u) or الفضل في ذلك عائد عليه the merit thereby is his due, he deserves all the credit for it; ليس بالفضول ان it is not superfluous that ...; فضول الأحاديث futile talk, idle words; من فضول الكلام ان (f. il-kalām) it would be needless talk to ..., it would be a waste of words if ...\n\n\nفضل mul/i44la compariaon, weighing"
}