{
  "term": "قبل",
  "previous_term": "قباقيبي",
  "next_term": "قبلئذ",
  "definition": "قبل qabila a (قبول qabūl, qubūl) to accept (ب or هـ, ه s.o., s.th.); to receive (kindly, hospitably) (ه s.o.), give (هـ, ه s.o., s.th.) a friendly reception, receive (هـ s.th.) favorably, approve (هـ, ه of s.o., of s.th.); to acquiesce (هـ in s.th.), put up (هـ with s.th.), agree, consent, assent (هـ to, also ب); to admit (في هـ, ه s.o., s.th. to); to obey (من s.o.), yield, give in (من to s.o.), submit to s.o.’s (من) command; -- qabila a and qabala u i (قبالة qabāla) to guarantee, vouch, be surety (ب for) │ قبل الذهاب معي (dahāba) he was willing to go with me; qabila with acc. of a maṣdar frequently corresponds to an English adjective in -able, -ible, -ive, -al, e.g., داء يقبل الشفاء (šifā’a) a curable disease, بضائع تقبل الالتهاب (highly) combustible merchandise; اثمان لا تقبل المزاحمة (muzāḥamata) prices that are beyond competition; قبل شكا (šakkan) to admit doubt <b>II</b> to kiss (هـ, ه s.o., s.th.); (eg.) to go 739 south(ward) <b>III</b> to b. or stand exactly opposite s.o. or s.th. (هـ, ه), be face to face (هـ, ه with); to confront, face, counter (ه s.o.; هـ ب s.th. with, e.g., a situation with caution); to meet (ه s.o.; ب هـ s.th., e.g., a danger, with, by); to encounter (ه s.o.), run across s.o. (ه); to visit (ه s.o.), call on s.o. (ه); to meet, get together, have a talk or interview (ه with s.o.); to interview (ه s.o.); to receive (in audience) (ه s.o.), grant an audience (ه to s.o.); to receive (ب, هـ s.o., s.th. with, e.g., a news with joy); to repay, return, requite (ب هـ s.th. with); to compare, collate (على or ب هـ s.th. with) │ قابله على الرحب والساعة (raḥb, sā‘a) to welcome s.o. or s.th.; قابله بالمثل (bi-l-mitl) to return like for like <b>IV</b> to turn forward; to draw near, come close to s.o. or to a place (على), approach (على s.o., a place); to advance (على to, toward); to turn (على to. toward); to embark, enter (على upon s.th.), engage (على in); to give one’s attention, devote o.s. (على to s.o., to s.th.), dedicate o.s., apply o.s., attend (على to s.th.), occupy o.s. (على with); to take an interest, become or be interested (على in); to go, come (الى to); to be abundant (crop); (with foll. imperf.) to begin to do │ اقبل عليه الدهر (dahru) or اقبل عليه الدنيا (dunya) luck is on his side, fortune smiles on him <b>V</b> to accept, receive (هـ s.th.); to hear, grant (دعاءه du‘ā’ahū s.o.’s prayer; of God) <b>VI</b> to be opposite each other, face each other; to meet (e.g., two persons); to get together, have a meeting; meet (مع with); to be compared, be collated <b>VIII</b> to receive (هـ, ه s.o., s.th.); to apply o.s. gladly and willingly (هـ to s.th.) <b>X</b> to turn one’s face (هـ, ه to s.o., toward s.th.); to go to meet, to meet (ه s.o.); to face, confront, meet (هـ, ه s.o., s.th.); to take upon o.s., assume (هـ s.th.); to receive (ه a visitor, a guest; هـ s.th., e.g., a radio broadcast)\n\n\nقبل qablu (adv.) or من قبل min qablu and قبلا qablan previously, formerly, earlier, before; من ذي قبل (qablu), عن ذي قبل (after a comparative) ... than before; qabla (prep.) before, prior to │ قبل كل شيء qabla kull šai’in first of all, above all; من قبل min qabli before, prior to; قبل ان (conj.) before\n\n\nقبل qubl, qubul fore part, front part, front, face │ من قبل (qubulin) in front; from the front, from in front\n\n\nقبل qibal power, ability; -- qibala (prep.) in the presence of, before. near; in the direction of, toward │ لا قبل له (qibala) he has no power over it, it is not in his power; he is incapable of accomplishing it; من قبل min qibali on the part of, from, by; من قبل نفسه by himself (or itself), of his (or its) own accord; لي قبله دين lī qibalahū dain he owes me a debt, he is indebted to me"
}