{
  "arabic": "قدم",
  "definition": "قدم qadama u (qadm, قدوم qadūm) to precede (ه s.o.); -- qadima a (قدوم qudūm, قدمان qidmān, مقدم maqdam) to arrive (هـ at a place); to come; to get (الى or على or ه to s.o.; هـ to a place). reach (الى or على, ه s.o.; هـ a place); to have the audacity to do s.th. (على); -- qaduma u (qidam) to be old, be ancient <b>II</b> to make or let (هـ, ه s.o., s.th.) precede, go before, or lead the way; to send forward, send ahead, send off, dispatch, send on in advance (هـ, ه s.o., s.th.); to set forth beforehand, premise (ل هـ s.th. as introductory to s.th., e.g., a preface to a book); to place (هـ, ه s.o., s.th.) at the head; to set forward, set ahead (هـ a clock); to do earlier, do beforehand, do before s.th. else (هـ s.th.); to give precedence (على هـ, ه to s.o., to s.th. before), give priority (على هـ to s.th. over); to prefer (على هـ, ه s.o., s.th. to s.o. or s.th. else), give preference (على هـ, ه to s.o., to s.th. over); (Tun.) to appoint as legal guardian (على ه s.o. for); to prepare, ready, keep ready, provide, set aside, earmark (ل ه s.th. for); to provide, 747 make provisions (ل for); to offer, proffer, tender, extend, present, produce, exhibit, display (هـ s.th., الى or ل to s.o.); to hand over, deliver (هـ s.th., الى or ل to s.o.); to submit, refer (o s.th., الى or ل to s.o.), lay s.th. (هـ) before s.o. (الى or ل); to give u a present (هـ s.th., الى or ل to s.o.), offer up, present (الى or ل هـ, ه s.o., s.th. to s.o., to s.th.); to dedicate (الى or ل هـ s.th., e.g., a book, to s.o.); to file, turn in (هـ s.th., e.g., a report), send in, submit (هـ s.th., e.g., an application, الى or ل to), lodge (هـ e.g., a complaint, الى or ل before); to give (o an answer); to take (o an examination); to bring s.o. (ه) before a proper authority, esp., before a tribunal (امام or الى), arraign s.o.; to introduce, present (ل or الى ه s.o. to s.o. else), make (ه s.o.) acquainted (ل or الى with s.o. else); (intr.) to precede; to be fast (clock) │ قدمه بين يديه (baina yadaihi) to send s.th. ahead of s.th. else, let s.th. precede s.th. else; قدم له الثمن (tamana) to pay the price to s.o. in advance, advance the price to s.o.; قدم خدمة (kidmatan) to render a service; قدم خطوة (kidmatan) to make a step forward; قدم الشكر له (šukra) to extend one’s thanks to s.o., thank s.o.; قدم نفسه الى البوليس to give o.s. up to the police; ما قدمت وما اخرت (akkartu) what I have ever committed; ما قدمت يداك (yadāka) what you have committed or perpetrated; يقدم رجلا ويؤخر أخرى yuqaddimu rijlan wa-yu’akkiru ukrā to hesitate, waver, be undecided; فرق شهور لا تقدم ولا تؤخر farqu šuhūrin lā tuqaddimu wa-lā tu’akkiru a difference of a few months which is of no consequence <b>IV</b> to be bold, audacious, daring; to make bold, have the audacity to do s.th. (على); to venture, risk, undertake, tackle (على s.th.), set about s.th. (على); to brave (على s.th.), embark boldly (على upon), dare to engage (على in), venture upon s.th. (على); to attack (على s.o., s.th.) <b>V</b> to precede (عن or على or هـ, ه s.o., s.th., in space and time), go before s.o. or s.th. (عن, على, هـ, ه); to head (على or هم a group of people), be at the head (على or هم of a group of people); to belong to an earlier, older time; to go forward, move (for, ward), proceed (نحو toward), advance march (نحو against, toward); to progress, make progress; to come on, come closer, move nearer (الى to); to approach (الى s.o. or s.th.), accost (الى s.o.); to step up (الى to); to present o.s. (بين يديه or الى to), step before (بين يديه or الى); o to meet, face (ل or الى an opposing team, in sports); to turn, apply (ب ل or الى to s.o. with a request); to submit (ل or الى to s.o. ب s.th., e.g., a request); to order, direct, commission (ب الى s.o. to do, to bring, etc., s.th.) │ تقدم به to further, advance, promote, improve s.th.; تقدمت به السن (sinnu) to get older, be advanced in years; كما تقدم already mentioned; غفر الله ما تقدم من ذنبه وما تأخر (danbihī, ta’akkara) God has forgiven all his sins; وقت بغداد متقدم ساعتين من وقت اوربا الوسطى waqtu bagdada mutaqaddimun sā‘ataini ‘an waqti ūrubbā l-wusṭā Baghdad time is two hours ahead of Central European time; تقدم نحوه (naḥwahū) to step up to s.o.; تقدم منه to approach s.o., head for s.o.; تقدم للامتحان to submit o.s. to an examination <b>VI</b> to become antiquated, grow obsolete, get out of date, become old, age │ تقادم (zamanu) much time has gone by (since); تقادم عهده (‘ahduhū) it happened long ago, it belongs to the put, it is of early date <b>X</b> to ask (ه s.o.) to come, send (ه for s.o.), summon (ه s.o.)\n\n\nقدم qidm time long since put, old times; قدما qidman in old(en) times, in former times, once, of old, of yore\n\n\nقدم qidam time long since put, old times; remote antiquity, time immemorial; oldness; ancientness; infinite 748 pre-existence, sempiternity, timelessness (of God); seniority │ منذ القدم from times of old, by long tradition, of long standing; قدم عهده ب (qidamu ‘ahdihī) his long, standing familiarity with\n\n\nقدم qadam (usually f.) pl. اقدام aqdām foot (also as a measure of length); step قدم مكعبة (muka‘‘aba) cubic foot; سمت القدم al-q. nadir (astron.); اصبع القدم iṣba‘ al-q. toe; على قدميه (qadamaihi) on foot (of several: على الأقدام): على اطرف قدميه on tiptoe; على قدم الحذر (q. al-ḥadar) anxious, timid, fearful; على قدم الاهبة والاستعداد (q. il-uhba) in a state of extreme alertness; جرى (قام) على قدم وساق (wa-sāqin) to become fully effective, be in full progress, be in full swing; ليس له قدم he has no part in ..., he is not involved in ...\n\n\nقدم qudum: مضى (سار) قدما (quduman) to go straight ahead or forward"
}