{
  "term": "قرب",
  "previous_term": "قراج",
  "next_term": "قربة",
  "definition": "قرب qaruba u (qurb, مقربة maqraba) to be near (الى or من to s.o., to s.th.); to come near, get close (الى or من to s.o., to s.th.), close in (الى or من on s.o., on s.th.), approach (الى or من s.o., s.th.); to approximate (الى or من s.th.); - qariba a to be near (هـ, ه to s.o., to s.th.); to come near, get close (هـ, ه to s.o., to s.th.), close in (هـ, ه on s.o., on s.th.), approach (هـ, ه s.o., s.th.); to approximate (هـ s.th.); to draw near, be coming on, approach │ ما يقرب من (yaqrubu) (with foll. figure) approximately, about, some, circa <b>II</b> to cause or allow (هـ, ه s.o., s.th.) to come near or get close (الى or من to s.th.), make or let (هـ, ه s.o., s.th.) approach (الى or من s.th.), bring close (هـ, ه s.o., s.th.; الى or من to s.th.), advance, move (هـ, ه s.o., s.th.; الى or من toward s.th.), approximate (o s.th.; الى or من to); to bring home (هـ من or الى to s.o. s.th., e.g., an idea); to take as associate or companion (من ه s.o. for o.s.); to bring closer to comprehension, reveal more fully (هـ s.th.), clarify the concept, facilitate the understanding (هـ of s.th.) ; to offer up, present (هـ ل to God as sacrifice); (Chr.) to administer Communion (ه to s.o.); to sheathe, put into the scabbard (هـ the sword) │ قرب بينهم to bring people closer together, make peace among people, reconcile people <b>III</b> to be near (هـ, ه to s.o., to s.th.); to come near, come close, get close (هـ, ه to s.o., to s.th.), close in (هـ, ه on s.o., on s.th.), approach (هـ, ه s.o., s.th.); to approximate (هـ s.th.); to be almost equivalent (هـ with s.th.), amount to almost the same thing (هـ as s.th.); to be on the point (ان of doing s.th.), be about (ان to do s.th.); to bring (close) together (بين – و different things) <b>V</b> to approach (من or الى s.o., s.th.), come or get near s.o., near s.th. (من or الى), come close, get close (من or الى to s.o.), gain access (من or الى to s.o.); to seek to gain s.o.’s (الى) favor, curry favor (الى with s.o.); (Chr.) to receive Communion <b>VI</b> to be or come near each other, approach one another, approximate each other <b>VIII</b> to approach (من s.o., s.th.), come, advance, or get near s.o. or s.th. (من), come close, get close (من to) <b>X</b> to find near, regard as near (هـ s.th.)\n\n\nقرب qurb nearness, closeness, proximity, vicinity; qurba (prep.) in the vicinity of, near, toward │ قرب الظهر qurba ẓ-ẓuhr toward noon; بقرب or بالقرب من in the vicinity of, near, close to; عن قرب from a short distance, from close up"
}