{
  "term": "قسم",
  "previous_term": "القسطنطينية",
  "next_term": "قسمة",
  "definition": "قسم qasama i (qasm) to divide, part, split (هـ s.th.); to distribute, deal out, parcel out (على هـ s.th. to, among), divide (على ه s.th. among); to let s.o. (ل) share (في s.th.). give s.o. (ل) a .hare of s.th. (في), allot (في ل to s.o. s.th.); to divide, subdivide, partition, portion, break up (الى هـ s.th. into), arrange, classify (الى ه s.th. in); to partition, to compartment (هـ s.th.); to assign, apportion, decree, destine, foreordain (هـ على or ل to s.o. s.th.; of God or of fate); to divide (هـ على a number by another) <b>II</b> to divide, part, split (هـ s.th.); to distribute, deal out, parcel out, divide (هـ بين s.th. among); to divide, subdivide, partition, portion, break up (هـ s.th., هـ or الى into), section (هـ s.th.), arrange, classify (هـ s.th., هـ or الى in); to partition, to compartment (هـ s.th.); (Chr.) to consecrate, ordain (هـ s.o.); to exorcise a devil or demon (على from s.o., by adjuration) <b>III</b> to share (هـ ه with s.o. s.th.); to bind o.s. by oath (على ه to s.o. to do s.th.) <b>IV</b> to take an oath, swear (ب by; على ل to s.o. s.th.; على ان to do s.th.) │ اقسم عليه الا فعله (illā fa‘alahū) to adjure or entreat s.o. to do s.th.; اقسموا جهد ايمانهم (jahda aimānihim) 762 they swore by all that is right and holy, they swore the most solemn oaths; اقسم بمقدساتا (muqadasātihī) to swear by all that’s holy <b>V</b> to be divided, be parted, be split; to be distributed, be parceled out; to share (ه, هـ a possession), divide among themselves (ه s.o., هـ s.th.); to scatter, disperse (هـ s.th.); to drive away, dispel (هـ s.th.); to beset grievously, harass or torment jointly (ه s.o.) │ تقسموه ضربا وجيعا (ḍarban) they took turns in dealing him painful blows, they gave him a severe beating <b>VI</b> to divide or distribute among themselves (هـ s.th.); to beset, harass, torment (ه s.o.; thoughts, worries, etc.) <b>VII</b> to be divided, be parted, be split; to be distributed, be dispersed, be separated; to be divided, be subdivided, be portioned, be broken up (الى into) <b>VIII</b> to divide or distribute among themselves (هـ s.th.) <b>X</b> to seek an oracle from the deity, cast lots\n\n\nقسم qism pl. اقسام aqsām part, share, allotment; portion; division, compartment; section; department; group, class; district, precinct; police precinct, police station (Eg.); administrative subdivision of a muḥāaẓa (Eg.); subcommittee; kind, sort, specimen, species\n\n\nقسم qasam pl. اقسام aqsām oath; قسما qasaman I swear! قسما ب I swear by …!"
}