{
  "term": "قضى",
  "previous_term": "الحيوانات القاضمة",
  "next_term": "قضاء",
  "definition": "قضى qaḍā i (قضاء qaḍā’) to settle (هـ s.th.); to finish, terminate, conclude, end, close, wind up, complete, consummate, accomplish, achieve (هـ s.th.); to carry out, execute, perform, effectuate (هـ s.th.); to fulfill (هـ a request), comply (هـ with); to do, perform (هـ one’s duty); to gratify (هـ a wish), provide (هـ for a need), satisfy, meet, answer, discharge (هـ a demand, a claim); to pay, settle (هـ a debt); to spend, pass (هـ time); to die (= قضى اجله); to fix, appoint, determine, decree, decide, rule (ب s.th., بان that); (of God) to foreordain, predestine; to judge, act as judge, decide judicially (بين between two litigants); to pass or pronounce judgment (ل in favor of s.o.; على against s.o.); to sentence, condemn (ب على s.o. to), impose, inflict (ب على upon s.o. a penalty); to impose or enjoin as a duty (ب على upon s.o. s.th.); to make necessary or requisite (ب على for s.o. s.th.), require s.o. (على) to do s.th. (ب), compel, force (على s.o. ب to do s.th.); to demand, require, necessitate (ب s.th.), call for s.th. (ب); to root out, extirpate, annihilate, exterminate (على s.o., s.th.); to kill, do in (على s.o.), do away (على with s.o., with s.th.), put an end (على to s.th.); to thwart, foil, frustrate (على s.th.) │ قضى اجله (ajalahū) to pass away, die; قضى العجب من (‘ajaba) to be full of amazement at, be very astonished at; قضى نحبه (naḥbahū) to fulfill one’s vow; to pass away, die; قضى وطره (waṭarahū) to attain one’s aim or end, see one’s wish fulfilled; قضى الأمر 771 quḍiya l-amru the matter is decided and done with, the die is cast; قضي امره quḍiya amruhū and قضي عليه quḍiya ‘alaihi it’s all over with him, he’s a goner <b>II</b> to carry out, execute, perform, effectuate (هـ s.th.) <b>III</b> to summon before a judge, bring before a court of justice, arraign (ه s.o.); to prosecute, sue (ه s.o.), take legal action, bring suit (ه against s.o.); to demand (ب ه from s.o. payment of s.th.), call in (ب ه from s.o. s.th.) <b>V</b> to be finished, completed; to peas, go by, elapse, expire, run out (time) <b>VI</b> to litigate, carry on a lawsuit; to demand (هـ s.th.; من هـ or ه from s.o. payment of s.th.; from s.o. s.th.), call in (هـ s.th., من or ه from s.o.), claim (هـ على for s.th. remuneration), lay claim (هـ to s.th.); to get, receive (هـ ه from s.o. s.th., also هـ من s.th. from, esp. money owed, emolument) <b>VII</b> to be completed, be finished, be done, be terminated, be concluded, come to an end, cease, stop; to pass, go by, elapse, expire, run out (time); to have expired, have elapsed, be over, be peat (time) <b>VIII</b> to demand, claim, exact, require (هـ ه from s.o. s.th.); to make necessary, make requisite, necessitate, require (هـ s.th.) <b>X</b> to demand, claim, exact, require (هـ ه from s.o. s.th.)\n\n\nقضى qaḍan judgment, sentence, (judicial) decision, (court) ruling"
}