{
  "arabic": "كون",
  "definition": "كان (كون) kāna u (kaun, كيان kiyān, كينونة kainīna) to be; to exist; to happen, occur, take place; with acc. of the predicate: to be s.th.; with foll. perf. denoting the pluperfect; with foll. imperf. expressing duration in the past = Engl. progressive past: was doing (often corresponding to Engl. “used to ...”, “would ...”); with ل: to belong to, be one’s own (كان له بيت he had or owned a house); with ل and s.th.: to be the right man for, be qualified for; with من: to belong to, pertain to; with على: to be incumbent on, be the duty of; with الى: to be assigned to, be the lot or share of, be left to, be due (s.o.) │ ما يكون foll. the elative: على اتم ما يكون (atammi) in the moat perfect manner conceivable, as perfect(ly) as possible; اقوالهم اقرب ما تكون الى الصواب (ṣawāb) what they said came quite close to the truth: لم يكن ل (lam yakun) or ما كان ل (with foll. subjunctive) he is (or was) not the right man for, he was not capable of, he was not in a position to ...; it is (or was) not apt to ...; لم يكن ليصعب عليه ان (li-yaṣ’uba) it wouldn’t have been difficult for him to …, there was no reason why he couldn’t have ...; ما كان منه الا ان (or لم يكن) (illā an) he had no other choice but to ..., there was nothing for him to do but to ...; he did no more than ...; ما كان له ان it is (or was) impossible for him to ...; he is (or was) unable to ...; اصبح في خبر كان aṣbaḥa fī kabari k. to disappear, become dated, belong to the past; كان وكان a popular form of poem consisting of quatrains <b>II</b> to make, create, produce, originate, bring forth, bring into being, form, shape, fashion (هـ s.th.) <b>V</b> to be created, be formed; to come into existence, form, arise, develop; to consist, be composed, be made up (من of), be formed (من by) <b>X</b> to become lowly, humble, miserable; to submit, yield, surrender, humble o.s., abase o.s., eat humble pie; to abandon o.s., give o.s. over (الى to s.th.)\n\n\nكون kaun pl. اكوان akwān being, esse; existence; event, occurrence, incident; الكون the existent, the existing, reality; the world; the cosmos, the universe │ الكون الأعلى (a‘lā) the Supreme Being, God; with foll. genit. or suffix of the logical subject and acc. of the predicate: the fact that s.o. or s.th. is ..., لكونه مجنونا li-kaunihī majnūnan because he is mad, مع كونه مجنونا although he is mad"
}