{
  "arabic": "ل",
  "definition": "ل la (intensifying particle) truly, verily; certainly, surely; frequently after ان inna, introducing the predicate: ان ربي لسميع الدعاء inna rabbī la-samī’ d-du’ā’ truly, my Lord hears the prayer; also as a correlative of لو lau and لولا lau-lā: لو كنت تفعل هذا لكان انفع (la-kāna anfa’a) if you did this it would be more useful; لولا تاب لهلك lau-lā tāba la-halaka if he had not repented he would have perished; (particle of oath) لعمرك la-’amruka by your life!\n\n\nل li 1. (prep.) for; on behalf of, in favor of; to (of the dative); because of; for the sake of; due to, owing to; for, for the purpose of; at the time of, when, as; by (designating the author or originator); occasionally substituting for الى; as to ل paraphrasing the genit. and acc. see grammar │ لي عليه مال he owes me money; ما له وما علبه his right and his duty; his credit and his debit, his assets and his liabilities; له ان he has a right to ..., he is entitled to ..., he may ...; it is possible for him to ..., he is able to ..., he can ...; ليس لي ان I have no right to ... , it does not behoove me to ...; لك هذا or لك ذلك you can have that! it’s up to you; it’s all right with me! all right! O.K.! agreed! هل لك في or الك في would you like ...? do you want ...? do you feel like ...? قرأت له كتابا I read a book by him, I read one of his books; لا تدوم له حال (tadūmu) no state is of any permanence with him, he is never the same for a very long timeقاموا لمعاونتنا (li-mu’āwanatinā) they set out in our support; لسبع ليال خلون من شعبان li-sab’i layālin kalauna min ša’bāna when seven nights of Shaban had passed; للمرة الأولى li-l-marrati l-ūlā for the first time; لأول وهلة li-awwali wahlatin at first sight, at once; اخوه لأبيه وأمه li-abīhi wa-ummihī his brother on the paternal and maternal side, his brother-german, his full brother 2. (conj. with the subjunctive) that, so that, in order that, in order to; (with apoc.) expressing an order. an invitation: ليكتب li-yaktub he shall write, let him write (with preceding و wa or ف fa contracted to wal- ... or fal ... with elision of the i)"
}