{
  "arabic": "لزم",
  "definition": "لزم lazima a (لزوم luzūm) to cling, adhere, belong (هـ to), attend, accompany (هـ s.th.); to persist, persevere (هـ in), stick, keep (هـ to), keep doing (هـ s.th.);to adhere, be attached, keep close, stick (ه to s.o.); to be inseparable (هـ, ه from s.o., from s.th.); to stay permanently (هـ in); to be necessary; to be requisite, imperative, indispensable (ه for s.o.); to be incumbent (ه upon s.o.), be s.o.’s (ه) duty │ لزم داره (فراشة) to stay at home (in bed); لزم الصمت (ṣamta) to keep went, maintain silence <b>III</b> to attend, accompany (هـ s.th.); to adhere, stick, keep (هـ to); to pursue or practice incessantly (هـ s.th.); to be constantly with s.o. or in s.o.’s company (ه), be constantly around s.o. (ه) to be assigned (ه to), accompany, attend (ه s.o.); to be inseparable (ه, هـ from s.th., from s.o.); to keep doing (هـ s.th.), persist, persevere (هـ in); to work with perseverance, display sustained activity (هـ for) <b>IV</b> to force, compel (هـ ه s.o. to); to force, press (هـ ه, also ب ه upon s.o. s.th.); to enjoin, impose as a duty (هـ ه, also ب ه on s.o. s.th.), obligate (هـ ه, also ب ه s.o. to or to do s.th.) │ الزمه الحجة (ḥujja) to force proof on s.o., force s.o. to accept an argument; الزمه الفراش to confine s.o. to bed, compel s.o. to my in bed (of a disease); الزمه المال (or بالمال) to impose the payment of a sum on s.o. <b>VI</b> to be attached or devoted to each other, be inseparable <b>VIII</b> to 864 adhere, stick, keep, hang on (هـ to); to keep doing (هـ s.th.), persist, persevere (هـ in), keep up, maintain preserve (هـ s.th.), abide (هـ by); to take upon o.s. (هـ s.th.); to make a rule (هـ of s.th.), make (هـ s.th.) one’s duty, impose upon o.s. (هـ s.th.); to assume as a duty (ب or هـ s.th.); to undertake, obligate o.s., bind o.s., pledge (ب or هـ to do s.th.); to be in duty bound, be obligated or under obligation, be or become liable (ب or هـ to do s.th.); to be forced, be compelled (ب or a to do s.th.); to be responsible (ب or هـ for); to take over the monopoly (هـ of s.th.), monopolize, farm (هـ e.g., the levying of tax..) <b>X</b> to deem necessary (هـ s.th.); to necessitate, make necessary or requisite (a s.th.); to require, need (هـ s.th.), call (هـ for), be in need (هـ of s.th.)"
}