{
  "term": "مثل",
  "previous_term": "مثاث",
  "next_term": "مثلما",
  "definition": "مثل matala u (مثول mutūl) to resemble (ه s.o.), be or look like s.o. (ه), boar a likeness (ه to); to imitate, copy (ه s.o.); to compare, liken (ب ه s.o. to); to represent, mean, signify (هـ s.th.), stand for (هـ); to stand erect (بين يديه baina yadaihī before s.o. in audience), appear before s.o.; to present o.s. to s.o.; to present itself to the eye, be on view; to plant o.s., stand; to step forth, come forward, enter, appear, make one’s appearance (esp. of an actor, on the stage) │ مثل بين يدي الملك (b. yadayyi l-malik) to have an audience with the king, be received in audience by the king; -- u (matl) to maim, mutilate (ب s.o.); -- u (matl, مثلة mutla) to make an example (ب of s.o.); -- matula u (مثول mutūl) to stand, appear (بين يديه baina yadaihi before s.o. in audience) <b>II</b> to make (هـ s.th.) like s.th. else (ب), make (هـ s.th.) similar. analogous (ب to); to assimilate (biol.); to give or quote as an example (ب ل s.th. of, also هـ s.th. على of), exemplify (ل ب with s.th. s.th.), use as a simile (ب هـ s.th. for); to compare, liken (ب هـ, ه s.o. s.th. to); to punish severely, treat harshly (ب s.o.); to maim, mutilate (ب s.o.); to represent pictorially or graphically, show (هـ, ه s.o., s.th.), picture, depict, describe (هـ, ه s.o., s.th.); to portray, paint (ه s.o.), sculpture a bust or statue (ه of s.o.); to represent (ه s.o., هـ s.th.); to act (on stage or screen), appear as an actor; to play, act (دورا dauran a part or role), star (دورا in a role); to stage, perform (هـ a play); to form, constitute (chem.) │ مثل به اشنع تمثيل (ašna‘ t.) to make a dreadful example of s.o., punish s.o. with utmost cruelty <b>III</b> to resemble (ه s.o., هـ s.th.), be or look like s.o. or s.th. (هـ, ه), be similar, bear a likeness (هـ, ه to); to correspond, be analogous (هـ, ه to s.o., to s.th.); to compare, liken (ب ه s.o. to) <b>V</b> to make o.s. similar, assimilate o.s. (ب to s.o.); to become similar (ب to), become like s.o. or s.th. (ب), follow (ب s.o. s.th.), take after s.o. or s.th. (ب); to take on the shape of s.o. (ب); to assimilate, absorb (هـ s.th.); to do likewise, imitate, copy (ب s.o., s.th.); to imagine, fancy (ب s.th., with ه and verb; s.o. to do s.th.); to get an idea (هـ of); to give or quote as an example, use as a simile (ب s.th.); to quote, cite (ب a verse); to present itself, be represented, be visible, find visual expression (في in); to embody, personify, (im)personate, typify (هـ s.th.); to stand erect, appear (بين يديه baina yadaihi before s.o.) <b>VI</b> to resemble each other, be alike, go together, agree, match; to recover (من from) │ الى الشفاء or تماثل للشفاء (šifā’) to be on the way to recovery <b>VIII</b> to take as a model or an example, imitate, copy, follow (هـ s.th.); to submit, subject o.s. (ل to s.o., to s.th.); to obey (هـ an order)\n\n\nمثل mitl pl. امثال amtāl s.th. similar, s.th. of the same kind; resemblance, similarity, similitude, likeness; image; equivalent; 891 (with foll. genit. or suffix) s.o. like ..., one like ...; s.th. like ...; مثل mitla (prep.) and كمثل ka-mitli similar to, like, just as; one like; s.th. like; the same as; (just) as much as │ هم مثله hum mitluhū they are like him, they are of his kind; بالمثل in the same manner, likewise, equally, also, too; مثل ما mitla mā just as, as well as; بمثل ما bi-mitl mā in the same manner as; اجر المثل ajr al-m. adequate payment or wages; عامله بالمثل (‘āmalahū) to repay s.o. like for like, treat s.o. in like manner; مبدأ المعاملة بالمثل (mabda’ al-mu‘āmala) principle of reciprocity; مقابلة المثل بالمثل (muqābalat al-m.) retaliation, reprisal; امثاله amtāluhū people like him, people of his kind; امثال ابي بكر people like Abū Bakr; الى ثلاثة امثاله up to three times as much\n\n\nمثل matal pl. امثال amtāl likeness; metaphor, simile, parable; proverb, adage; example; lesson, similar case; ideal, model; مثلا matalan for example, for instance, e.g. │ مثل كمثل he is comparable to ..., he is like ...; مثل اعلى (asmā) or مثل اعلى (a‘lā) ideal; ضرب الأمثال see ضرب; الأمثال السائرة proverbs; على رأي المثل (ra’yi l-m.) as the proverb says"
}