{
  "term": "مجلس",
  "previous_term": "جلوس",
  "next_term": "مجالسة",
  "definition": "مجلس majlis pl. مجالس majālis2 seat; session room, conference room; party, gathering, meeting; social gathering: session, sitting; council meeting; council; concilium; collegium, college: board, committee, commission; administrative board; court, tribunal│فى مجلسه in s.o.’s presence, in s.o.’s company; مجلس التأديب and مجلس تأديبى disciplinary board; مجلس تأسيسى constituent assembly; مجلس آفاقى regional court (tribunal régional; Tun.); مجلس الأمة m. al-umma parliament (Ir.); مجلس الأمن m. al-amn the Security Council; مجلس البلدية m. al-baladīya and مجلس بلدى (baladī) local council, municipal council; مجلس الحرب m. al-ḥarb war council; مجلس حسبى (ḥasbī) probate court (for Muslim; Eg.); مجلس مختلط (muḳtaliṯ) mixed court (eg.); مجلس الدفاع defense council; مجلس الادارة m. al-idāra administrative board, committee of management, directorate; board of directors (of a corporation or bank); مجلس المديرية m. al-mudīrīya provincial council, provincial parliament (Eg.); مجلس الدولة m. ad-daula Supreme Administrative Court (Eg.); مجلس روحى (rūḥī) religious court, clerical court (of the Coptic Church); مجلس شورى الدولة m. šūrā d-daula council of state; مجلس الشيوخ council of elders: Senate (Eg.); مجلس عدلى (‘adlī) court, tribunal (Syr.); (عسكرى or) مجلس عرفى (‘urfī, ‘askarī) court-martial; مجلس عصبة الأمم m. ‘uṣbat al-umam Council of the League of Nations; مجلس العموم the House of Commons; مجلس الأعيان m. al-a‘yān senate (Ir., Jord.); مجلس الاقتراع draft board, recruiting commission (mil.); مجلس قروى (qarawī) local council; مجلس اقتصادى (iqtiṣādī) economic council: مجلس قومى (qaumī) national assembly; مجلس قيادة الثورة m. qiyādat at-taura Supreme Revolutionary Tribunal (Eg.): المجلس الكبير and المجلس الاكبر (akbar) the Grand Council (= le Grand Conseil; Tun.); مجلس اللوردين the House of Lords: مجلس النواب m. an-nuwwāb lower house, chamber of deputies; مجلس نيابى (niyābī) parliament; مجلس الجهة m. al-jiha approx.: provincial council (= conseil de région; Tun.); مجلس الوزراء m. al-wuzarā’ cabinet, council of ministers"
}