{
  "term": "مر",
  "previous_term": "مذل",
  "next_term": "مرة",
  "definition": "مر marra u (marr, مرور murūr, ممر mamarr) to pass (ب or على s.o., s.th. or by s.o., by s.th.), go, walk, saunter, or stroll by or past (ب, على); to march past s.o. (امام), pass in review (امام before s.o.; mil.); to pass, elapse, go by, run out (time); to come, go, walk, or pass along s.th. (ب or على), skirt (ب or على s.th.); to pass, go, walk, move, march, travel (ب or من or على through), cross, traverse (من a place, a country, a room); to flow through, run through; to fly through; to lead, run, out (في through an area; border), pass (في over), cross (في an area); to go or pass (ب through a stage or phase), undergo (ب a state or phase); to cross (على a border, s. line, mountains, etc.); to fly (فوق over an area; airplane); to depart, go away, leave; to continue (يفعل to do s.th.), keep, or go on, doing s.th. │ مر ذكره (dikruhū) it has been discussed, it has been mentioned above; كما مر بنا as it has passed before us, as we have already mentioned; مر بالامتحان to pass the examination; مر بسلام (bi-salām) to turn out well, go off without mishap; مر عليه ببصره (bi-baṣarihī) to scan s.th., peruse s.th. hastily; مر مر البرق (marra l-barq) to pass swiftly, flash past, flit past; مر مر الكرام (marra l-k.) to pass as if nothing had happened, brush past; مر به (عليه) مر الكرام to overlook s.th. generously, pass over s.th. with dignity, treat s.th. with disdain <b>II</b> to let pass (هـ s.th.); to convey, carry or take through (هـ s.th.); to pass (هـ the ball, in soccer) │ مرر سفينة في القناة (qanāh) to pass or take a ship through the canal <b>IV</b> to let (ه s.o.) go by or past s.o. or s.th. (على or ب); to let (ه s.o.) pass (على or ب s.th.); to make (هـ, ه s.o., s.th.) go through s.th. (على or ب), lead, take or send (ه s.o.) through (على or ب), pass,stick (على or ب هـ s.th. through); to insert (على or ب هـ s.th. in) │ امر نظره على (naẓarahū) to pass one’s glance over, let one’s eyes wander over <b>X</b> to last, endure, continue, go on; to remain, stay; to continue (على or في s.th., يفعل to do s.th.), persist, persevere (على or في in s.th.), keep (على or في to s.th., يفعل doing s.th.), go on (يفعل doing s.th.), stick, adhere (على or في to s.th.)\n\n\nمر marr passing, going by; passage, transit; transition; crossing; progression, process, lapse, course (of time); iron shovel, spade; rope │ على مر الزمان (m. iz-zamān) in the course of time\n\n\nمر marra u a (مرارة marāra) to be or become bitter <b>II</b> to make bitter, embitter (هـ s.th.) <b>IV</b> to be or become bitter; to make bitter (هـ s.th.) <b>VI</b> to fight, contend, dispute (with each other) <b>X</b> to think bitter, find bitter (هـ s.th.)\n\n\nمر murr pl. امرار amrār bitter; severe; sharp; painful; bitterness; myrrh │ مر الصحاري m. aṣ-ṣaḥārī colocynth (bot.)"
}