{
  "arabic": "مسك",
  "definition": "مسك masaka u i (mask) to grab, grasp, clutch, clasp, seize (ب or هـ s.th.), take hold ب or هـ of); to hold, hold fast (ب or هـ s.th.); to stick, cling, cleave, adhere, hang on (ب to) │ مسك الحسابات (ḥisābāt) to keep the books, keep the accounts; مسك (daffata l-u.) to be at the helm, be in charge; مسك لسانه (lisānanahū) to keep one’s tongue in check <b>II</b> to scent with musk (هـ s.th.); to have (ه s.o.) seize or hold <b>IV</b> to seize, grip, grasp, clasp, clutch, hold (ب or هـ s.th.); to hold fast, grab (ب or هـ, ه s.o., s.th., من ه s.o. by his hair, and the like); to hold back, keep, detain, restrain (هـ, ه s.o., s.th., عن from); to withhold, not to expend (هـ s.th.); to refrain, abstain, keep, desist (عن from), forbear, cease, stop (عن doing s.th.), keep away, remain aloof (عن from); to keep, retain (على نفسه هـ s.th. for o.s.) │ امسك عليك (amsik) keep ...! امسك نفسه واقفا waqifan) to hold o.s. upright; امسك بيده (bi-yadihī) to take s.o. by the hand; امسك يده (yadahū) to take s.o.’s hand; امسكت عن الصدور to stop publication, fold up (newspaper); امسك لسانه (lisānahū) to keep one’s tongue in check; امسك البطن (baṭna) to constipate (med.) <b>V</b> to hold on, hold fast (ب to), clutch (ب s.th.); to stick, cling, cleave (ب to); to hang on (ب to), persist (ب in); to keep, adhere (ب to s.th.); to rise (prices), harden, firm up (quotations) │ تمسك باهدافه (bi-ahdābihī) to be most devoted to s.o., be at s.o.’s beck and call, be under s.o.’s thumb; تمسك بأهداب الشيءto adhere, cling to s.th.; تمسك برأيه (bi-ra’yihī) to stick to one’s opinion <b>VI</b> to hold together, be firmly connected, be interlocked; to compose o.s., pull o.s. together; to remain undaunted, remain calm, be 908 composed; to stay on one’s feet; to be in full possession of one’s strength; to refrain, abstain, keep (عن from) <b>X</b> to keep, stick, cling, adhere (ب to); to grab, seize (ب s.th.); to refrain, abstain, keep (عن from)\n\n\nمسك mask seizure, grip, hold; detention │ مسك الدفاتر bookkeeping; مسك الحسابات m. al-ḥisābāt keeping of accounts, accountancy\n\n\nمسك maska pl. masakāt grip, hold\n\n\nمسك misk (m. and f.) musk │ مسك الجن m. al-jinn a variety of goosefoot (Chenopodium Botrys; bot.); مسك الختام m. al-kitām lit.: the concluding musk (i.e., with which, originally, a letter was finally perfumed), the best following in the end, the crowning touch\n\n\nمسك musuk and مسكة musaka grasping, greedy, avaricious"
}