{
  "arabic": "ملك",
  "definition": "ملك malaka i (malk, mulk, milk) to take in possession, take over, acquire (هـ s.th.), seize, lay hands (هـ on), possess o.s., take possession, lay hold (هـ of); to possess, own, have (هـ s.th.), be the owner (هـ of); to dominate, control (هـ s.th.): to be master (هـ of); to role, reign, exercise power or authority, hold sway, lord it (على or هـ over); to be capable (هـ of), be 921 equal (هـ to); to be able, be in a position (ان or هـ to do s.th.) │ ملكه الغيظ (gaiẓ) anger overwhelmed him, got the better of him; ملك عليه جميع مشاعره (jamī‘a mašā‘irihī) to dominate s.o.’s every thought and deed, be uppermost in s.o.’s mind; ملك عليه حسه (ḥissahū) to take possession of s.o.’s feelings; ملك عليه لبه (lubbahū) to preoccupy s.o.’s heart; ملك عليه نفسه (nafsahū) to lay hold of s.o.’s soul, dominate s.o.’s thinking, affect s.o. deeply, stir up, arouse, excite s.o.; ملك على نفسه امرها (amrahā) to have o.s. under control, keep one’s temper; ملك العينين من البكاء (‘ainaini, bukā’) to hold back the tears; ملك نفسه (nafsahū) to control o.s., restrain o.s.; لم يملك ان he could not refrain from ..., he couldn’t help it, he had to ...; ما ملكت (يملك) يمينه (yamīnuhū) his fortune, his property, his possessions <b>II</b> and <b>IV</b> to make (ه s.o.) the owner; to put (ه s.o.) in possession (هـ of), transfer (ه to s.o.) ownership (هـ of); to transfer, assign, make over, convey (هـ ه to s.o. s.th.); to make (ه s.o.) king or sovereign (على over) <b>V</b> to take in possession, take over, appropriate, acquire (هـ s.th.), take possession (هـ of s.th., ه of s.o.), seize, lay hands (هـ on s.th.), lay hold (هـ of s.th.); to possess, own, have (هـ s.th.), be in possession (هـ of); to become king or sovereign (على over); to become prevalent, become fixed, take root (habit) <b>VI</b> to gain control (هـ over a feeling, نفسه nafsahū over o.s.); to control o.s., restrain o.s., hold back; to refrain, keep (عن from s.th.) │ ما تمالك عن he couldn’t help (doing s.th.), he couldn’t refrain from ... <b>VIII</b> to possess, own, have (هـ s.th.); to gain, win (هـ s.th.); to acquire (هـ s.th.) │ امتلك نواصي الشيء (nawāṣiya š-šai’) to b. master of s.th., rule over s.th. <b>X</b> to appropriate (هـ s.th.), take possession (هـ of); to dominate, control (هـ s.th.); to possess, own, have (هـ s.th.); to master (هـ s.th.)\n\n\nملك mulk rule, reign, supreme authority, dominion, domination, dominance, sway, power; sovereignty, kingship, royalty; monarchy; tenure, holding, right of possession, possessory right, ownership\n\n\nملك mill: pl. املاك amlāk property, possessions, goods and chattels, fortune, wealth; estate; landed property, real estate; pl. possessions (= colonies); lands, landed property, estates │ املاك اميرية (amīrīya) or املاك الحكومة government lands; ملك ثابت landed property, real property, real estate, realty, immovables; ملك منقول personal estate, personal property, personality, movables; املاك مبنية (mabnīya) developed lots, real estate developments; صاحب الأملاك, ذو الأملاك landowner; ملك اميري (amīrī) government property; ملك مطلق (muṭlaq) general property, fee simple (absolute) (Isl. Law); ملك شائع joint property, joint tenancy, co-ownership\n\n\nملك malik pl. ملوك mulūk, املاك amlāk king, sovereign, monarch\n\n\nملك malak (for ملأك) angel │ ملك حارس guardian angel"
}