{
  "term": "من",
  "previous_term": "ممن",
  "next_term": "منة",
  "definition": "من man 1. (interr. pron.) who? which one? which ones? 2. (relative pron.) who; the one who; those who; one who; whoever, whosoever, everyone who, he who\n\n\nمن min (prep.) 1. of; some, some of, (a) part of; belonging to, pertaining to, from among │ كان من to belong or pertain to, be among …, fall under ...; من ذلك ان (anna) among other things ...; منهم من (man) some of them; منهم من – ومنهم من some of them -- others ..., there are (were) those who -- and others who ...; رجل من قريش (rajul) a man of the Koreish tribe; يوم من الأيام (yaum, ayyām) some day, some day or other; امر من الأمور (amr) s.th. or other, some affair, some business; اكل من الطعام (ṭa‘ām) he ate (a little, some) of the food; ما رايته من الكتب mā ra’aituhū min saling-kutub (what I have seen of the books =) the books I have seen; ما رايته من كتب (what I have seen of books =) what(ever) books I have seen; ما لله من شريك God has no partner whatsoever; ما من احد يقدر (aḥadin yaqdiru) nobody can ...; ما من شخص (šakṣin) there ia absolutely none who ...  consisting of, made of, of (material) │ ثوب من حرير (taub) a garment of silk, a silk dress   at, on (time) │ من الليل (lail) at night; من يومه (yaumihī) on the very same day; من ساعته at that moment, at once, right away  at, on, by (place) │ هزه من منكبه (hazzahū, mankibihī) he shook him by the shoulder  like, as, such as, as for instance; namely, to wit │ صفات ازلية من العلم والقدرة والإرادة (ṣifāt azalīya, ‘ilm, qudra, irāda) eternal attributes such as knowledge, power, volition; اذا صح ما قالته الجرائد من ان (ṣaḥḥa) if what the newspapers say is true, namely that ...  in an exclamation: يا طولها من ليلة yā ṭūlahā min lailatin oh, the length of the night! what a long night it is! ما اخفه من حمل mā akaffahū min ḥimlin how light a burden it is! ويحه من مخبول (waiḥahū) woe to this fool!  in relation to, with respect to, toward │ مقاصد المانيا من تركيا Germany’s intentions as far as Turkey is concerned  substituting for an accusative (originally, in a partitive sense): اذكى ذلك من فضولها this kindled her curiosity  2. from, away from, out of, from the direction of │ اخرج من هنا ukruj min hunā get out of here! جاء من بغداد he came from Baghdad; من طرف (ṭarafi) and من قبل (qibal) on the part of, on the side of, from, by; من -- الى from -- (up) to; كان منه واليه (wa-ilaihi) to depend entirely on s.o., he inseparable from s.o., appertain to s.o.; ما كان منهم what share they had in ..., to what extent they were involved in ..., what part they played in …  from, beginning , starting ..., since, for; after │ من شهر (šahr) for a month (past), since one month ago; من مدة (mudda) for some time (in the past); بعد ايام من هذه الحوادث (ba‘da ayyāmin) a few days after these events  of, by, at, about (denoting the source of one’s fear, fright, alarm, apprehension, etc.). e.g., فزع من, خاف من etc.  through, by, via, (with verb, of motion to denote the way, route, or means) │ دخل من الباب he entered through the gate; من طريق الراديو by radio   than (with the comparative) │ اقوى من aqwā min an too strong as to ..., too strong for ...  due to, owing to, for, because of; at, about (with verbs denoting emotions; as, for instance, “be amazed”, “be delighted”, “he glad”, etc.), e.g., تعجب من, دهش من, etc. by, through (with the passive to indicate the doer, agent, perpetrator)  as to compounds such as من بعد, من حيث, من دون, من غير, من قبل see under the second word\n\n\nمن manna u (mann) to he kind, kindly, benign, gracious, benevolent, obliging (على to or toward, s.o.); to show, grant, or do s.o. (على) a favor, bestow blessings, benefits, favors (على upon s.o.); to grant, award, present, give (ب على to s.o. s.th.), confer, bestow graciously (ب على upon s.o. s.th.), bless (ب على s.o. with), inspire (ب على s.o. with; of God) <b>IV</b> to tire, fatigue, weaken (ه s.o.), sap the strength (على of s.o.) <b>V</b> do. <b>VIII</b> to be kind, kindly, benign, gracious, benevolent, obliging (على to or toward s.o.), to show, grant, or do s.o. (على) a favor, bestow blessings, benefits, favors (على upon s.o.); to bestow or confer most graciously (ب على upon s.o. s.th.), kindly grant, award, or give (ب على to s.o. s.th.)\n\n\nمن mann gracious bestowal; favor; benefit, blessing, boon; gift, present, largess; honeydew; manna; (pl. امنان amnān) a weight of 2 رطل raṭl │ بمنه تعالى by the grace of God\n\n\nمن munna pl. منن munan strength, vigor, stamina │ شديد المنة strong, vigorous, sturdy"
}