{
  "arabic": "منع",
  "definition": "منع mana‘a a (man‘) to stop, detain, keep from entering or passing (ه s.o.); to hinder, prevent (هـ s.th.; من or عن ه s.o. from), keep, restrain, hold back (ه s.o. من or عن from); to bar, block, obstruct (هـ ه s.o.’s way or access to); to withdraw, take away (من or عن or هـ ه from s.o. s.th.), deprive (من or عن or هـ ه s.o. of); to forbid, interdict (من or عن or هـ ه to s.o. s.th.), prohibit (من or عن or هـ ه s.o. from); to decline to accept, declare impossible or out of the question (ان that); to refuse, deny (عن هـ or ه هـ s.th. to s.o.), withhold (عن هـ or ه هـ s.th. from s.o.); to stop, cease (هـ doing s.th., عن with regard to s.o.), abstain, refrain (هـ from doing s.th., عن with regard to s.o.); to ward off, avert, keep, keep away (عن هـ s.th. from s.o.); to protect, guard (من ه s.o. from), defend (ه s.o., هـ s.th., عن against); -- manu‘a u (مناع manā‘, مناعة manā‘a) to be strongly fortified, inaccessible, impregnable; to be unconquerable, invincible, insurmountable <b>II</b> to fortify, strengthen, make inaccessible (هـ s.th.) <b>III</b> to put up resistance, act in opposition (ه to s.o.), oppose, counteract (ه s.o.), work against s.o. (ه); to stand up, rise (ه against s.o.); to resist, oppose (في s.th.), offer resistance, object, raise objections (في to s.th.), revolt, rebel (في against s.th.); to refuse, deny (هـ ه s.o. s.th.) <b>V</b> to refuse, decline (عن to do s.th.); to desist, refrain, abstain, keep (عن from s.th., from doing s.th.), forbear, leave off (عن s.th.), stop, cease (عن doing s.th.), avoid (عن s.th. or doing s.th.); to 926 be or become inaccessible, unassailable, impregnable; to strengthen, grow in strength; to seek protection (ب with or in) <b>VIII</b> to refrain, abstain, keep (عن from doing s.th.), forbear (عن s.th.), stop, cease (عن doing s.th.); to be prevented (عن from); to be impossible (على for s.o.); to refuse (عن to do s.th.), decline, turn down (عن s.th.); to refuse to have anything to do (على with), keep aloof (على from)\n\n\nمنع man‘ hindering, impeding, obstruction; prevention, obviation, preclusion; prohibition, interdiction, ban, injunction; closure, stop, discontinuation, embargo; withdrawal, deprival, dispossession; withholding, detention"
}