{
  "arabic": "نحو",
  "definition": "نحا (نحو) naḥā a u (naḥw) to wend one’s way (ه, هـ to), go, walk, move, turn (ه, هـ to, toward), take the road (هـ to), go in the direction (هـ of) │ نحا نحوه (naḥā naḥwahū) to follow s.o., follow s.o.’s example, be guided by s.o. or s.th.; to imitate s.o.; to be of the same nature, of the same kind, on the same line as ..., be like ...; نحا نحو الباب to walk toward the door; نحا به نحو الباب to show s.o. to the door <b>II</b> to put aside, push away, brush aside (هـ s.th.); to remove, take away (من هـ s.th. from) <b>IV</b> to turn away, avert (بصره عن baṣarahū ‘an one’s eyes from); to turn (على against s.o.), assail, overcome (ب على s.o. with); to help (ب على upon s.o. reproach, or the like), shower (ب على s.o. with); to turn, apply o.s. attend (على to s.th.) <b>V</b> to step aside, go away, withdraw, move away, fall back (من or من from); to turn away; to forgo, renounce, waive (من s.th.); to abandon, give up, surrender, yield, relinquish (عن s.th.); to retreat, retire (هـ to a place); to lean, rest, support o.s. (ل on) <b>VIII</b> to turn (هـ to, toward); to lean, support o.s. (ل on) │ انتحى ناحية to turn aside; انتحى جانبا do., step back, withdraw, retire\n\n\nنحو naḥw pl. انحاء anḥā’ direction; side; section, part; way, course, method, manner, mode, fashion; (with foll. genit.) corresponding to, analogous to, similar to, like, somewhat like; (gram.) grammar; syntax │ على نحو ما (naḥwi) in the manner of, as; على نحو ما (naḥwin) rather, pretty much; على هذا النحو in this manner, this way; in this respect; وعلى هذا النحو and so forth, and so on; في نحو الساعة السابعة at about the seventh hour, at about 7 o’clock, around seven; من نحوي as far as I am concerned, as for me, for my part, I for one; نحوا من (naḥwan) approximately, roughly, about, circa (with foll. figure); في انحاء الأرض (a. il-arḍ) all over the earth; في كل انحاء العالم (المعمورة) (‘ālam) all over the world; النحو المقارن (muqārin) comparative grammar\n\n\nنحو naḥwa (prep.) in the direction of, toward, to; according to, in analogy with, similar to, like, as, as for instance; approximately, roughly, about, around, circa"
}