{
  "arabic": "نزل",
  "definition": "نزل nazala i (نزول nuzūl) to dismount, alight; to descend, go down, come down, move down, get down, step down, climb down; to get off (من, e.g., a train), get out, step out (من, e.g., of a car), debark, disembark (من from a vessel); to put down, land (airplane); to fall (rain); to descend from heaven, be revealed (esp., the Koran); to fall, sink, sag (prices), drop (water level); to subside, abate, let up, decrease; to stop, or halt, for a rest, to camp; to stop, stop over, put up, take up quarters, take lodgings, lodge, room, stay to live (على or ب at s.o.’s home, also عند), live, dwell (هـ in a place), inhabit (هـ a place); to step into the arena, take the field, meet an opposing team (sports); to give in, yield (على e.g., to s.o.’s pleas); to give up, renounce, resign (عن ل s.th. in s.o.’s favor), cede, waive, relinquish, abandon (عن s.th.); to resign (عن from); to refrain (عن from), forgo (عن s.th.); to descend, come (ب upon s.o.; misfortune, punishment, etc.), befall, hit, afflict (ب s.o.; misfortune), happen, occur (ب to s.o.); to fall (على upon s.o.), attack, assail, assault (على s.o.); to enter, embark (على upon s.th.), set out (على to do s.th.), tackle, attack (على s.th.), pounce (على on s.th.); (with ب:) to take, bring, lead, etc., s.o. or s.th. down (الى to); -- nazila a (نزلة nazla) to have a cold │ نزل الى البر (barr) to disembark, go ashore, land; نزل الى الميدان (maidān) to take the field; نزل دون مننلته (manzilatihī) to sink below one’s level; نزل ضيفا على (ḍaifan) to avail o.s. of s.o.’s hospitality, stay as a guest with s.o.; نزل على حكمه (ḥukmihī) to defer, give in, yield, submit to s.o.; to comply with the standard of s.th.; نزل عند ارادته (irādatihī) to defer to s.o.’s will, do s.o.’s bidding; نزل عند رغبته (طلبه) (ragbatihī, ṭalabihī) to comply with, or fulfill, s.o.’s wish or demand; منزلا (manzilan) to occupy a place or position, get to a place or into a position; نزل منزله اللائق (manzilahū) to occupy one’s due place; نزل منزلة فلان (manzilata f.) to hold the position of, serve as <b>II</b> to cause to come down; to make (ه s.o.) descend, dismount, or step down; to lower, let down (هـ s.th., e.g., a bucket, a curtain, etc.); to send down (على هـ a revelation to a prophet), reveal (هـ s.th.); to take down, put down (هـ s.th.); to lower, decrease, diminish, lessen, minimize, curtail, reduce (هـ or من s.th.); to dip, tilt (هـ s.th.); to lower, strike (هـ a flag); to relieve, divest, discharge (عن هـ s.o. of), depose, dethrone (عن العرش ه s.o.); to unload (هـ s.th.); to grant hospitality (ه to s.o.). receive hospitably, take in, put up, lodge, accumulate (ه s.o.); to deduct subtract (هـ من s.th. from); to insert, inlay (في هـ s.th. in. e.g., ivory in wood); (Tun.) to cede (هـ s.th.) on the basis of inzāl (q.v.) │ نزل درجته (darajatahū) to demote s.o., reduce s.o. in rank <b>III</b> to get into a fight, join issue, clash (ه with s.o.) <b>IV</b> to bring down, take down; to cause to descend, dismount, or step down; to send down. reveal (على ه 956 s.th. to s.o.; of God); to bestow, grant, give (هـ s.th.; of God); to make (ه s.o.) alight, stop, halt, camp, put up, tab up quarters, live, stay, abide (هـ in a place); to unload (هـ s.th.); to take ashore (الى البر هـ ilā l-barr s.th. from a vessel); to land, put ashore, disembark, debark (هـ troops); to lower, strike (هـ a flag); to abase, degrade; to lower, decrease, diminish, reduce (الى هـ number, price, etc., to); to cause (هـ ب to s.o. loss), inflict (هـ ب upon s.o. a loss); to compel, force, coerce (على ه s.o. to) │ ما انزل الله به من سلطان (sulṭān) (lit.: God has given it no power, i.e.) futile, vain, fruitless, unavailing, unfounded, absurd, preposterous, completely arbitrary, random; انزل الى البحر (baḥr) to launch (هـ a ship); انزلوهم ضيوفا عليهم (ḍuyūfan) they took them in as guests; انزل به خسارة قادحة (kusāratan fāḍiḥatan) to inflict a heavy loss on s.o.; انزله منزلة فلان (manzilata f.) he had him occupy the same position as, gave him the same status as, made him equal in rank with <b>V</b> to lower o.s., stoop, condescend (الى to s.th.); to abase o.s., humble o.s., demean o.s., eat crow; to give up, renounce, resign, waive, forgo (عن s.th.), refrain (عن from) <b>VI</b> to give up, renounce, resign, waive, forgo (عن ل s.th. in favor of), refrain (عن from), yield, surrender, abandon, relinquish (عن s.th.); to cede (عن ل s.th. to); to leave, assign, transfer, make over (عن ل s.th. to); to lower o.s., stoop, condescend; to deign; to dismount, or line up, for battle │ تنازل (تنزل) عن العرش ل (‘arš) to abdicate in favor of; تنازل عن منصب (manṣib) to lay down an office, resign from office <b>X</b> to ask (ه s.o.) to step down; to call down, invoke (هـ s.th.); to make (ه s.o.) descend; to call upon s.o. (ه) to waive or forgo (عن s.th.); to force (ه the beleaguered) to surrender; to deduct, subtract (منه s.th. from)\n\n\nنزل nazl pl. نزول nuzūl, نزل nuzûl quarters, lodging; hotel, inn; -- (pl. نزول nuzūl) small tribal unit (of Bedouins); camp, camp site (of nomads, gypsies)\n\n\nنزل nuzl pl. انزال anzāl food served to a guest"
}