{
  "arabic": "نسب",
  "definition": "نسب nasaba u i (nasab, نسبة nisba) to relate, refer (الى هـ s.th. to), link, correlate, bring into relation (الى هـ s.th. with), to trace (الى هـ s.th. to s.o. as the originator, الى ه s.o.’s ancestry to); to ascribe, attribute, impute. lay (ل or الى هـ s.th. to s.o.), charge (ل or الى هـ with s.th. s.o.), accuse (ل or الى هـ of s.th. s.o.) <b>III</b> to stand in the same relationship (ه to s.o.); to correspond (هـ, ه to s.o., to s.th.), tally (هـ with s.th.), to suit, fit (هـ, ه s.o., s.th.), go (هـ, ه with), become, befit, behoove (ه s.o.); to harmonize, agree, be in keeping, be compatible, consistent (هـ with), to be similar (هـ, ه to s.o., to s.th.), resemble (هـ, ه s.o., s.th.), be like s.o. or s.th. (هـ, ه); to be in agreement, in conformity, in accordance. to tally, check (هـ with), be conformable (هـ to), to be of the same family (ه as), be or become related by marriage (ه to) <b>VI</b> to be related to one another, be relatives; to be alike, be akin, be mutually corresponding, be interrelated, be in agreement or conformity, be in the right proportion, be proportionate, match, fit together, go together; to be in agreement, in conformity, in accordance, to tally, check (مع with), be conformable (مع to) <b>VIII</b> to be related (الى to s.o.); to derive one’s origin (الى from), trace one’s ancestry (الى to), to derive one‘s name (الى from), be named (الى after), to belong, pertain, be relative (الى to), to be associated (الى with), belong (الى to a clan, a party, a faction, etc.); to attach o.s. (الى to), associate, affiliate (الى with), to join (الى e.g., a political party), to be admitted (الى to a community), be affiliated (الى with, esp., as an extraordinary, not a full, member) <b>X</b> to trace back the ancestry (ه of s.o.), to deem 959 proper (هـ s.th.), approve (هـ of), sanction, condone (هـ s.th.)\n\n\nنسب nasab pl. اناسب anāsib lineage, descent; origin. extraction, derivation, provenience; kinship, relationship, affinity, relationship by marriage │ سلسلة النسب silsilat an-n. family tree, pedigree, ancestral line, genealogy; علماء الأنساب ‘ulamā’ al-a. genealogists"
}