{
  "term": "نظر",
  "previous_term": "نطنط",
  "next_term": "نظرة",
  "definition": "نظر naẓara u (naẓar, منظر manẓar) to perceive with the eyes, see, view, eye, regard (هـ, ه or الى s.o., s.th.), look, gaze, glance (هـ, ه or الى at), watch, observe, notice (هـ, ه or الى s.o., s.th.), pay attention (هـ, ه or الى to); to expect (هـ s.th.); to envisages consider, contemplates purpose (هـ or في s.th.); to have in mind, have in view (الى s.th.), put one’s mind, direct one’s attention (الى to s.th.); to take up, try, hear (في a case; court), look into a case (في), examine (هـ or في a case); to judge, rule, decide (بين between two litigant parties); to take care (ل of s.o.), help (ل s.o.), stand by s.o. (ل), look after s.o. (ل) │ نظر اليه شزرا (šazran) to give s.o. a sidelong glances look askance at s.o.; نظر القضية (في القضية) (qaḍīya) to try a case (jurs); نظر في طلب فلان (ṭalabī f.) to process s.o.’s application, take care of s.o.’s application; نظر من فرجة المفتاح (فوهة المفتاح) (furjat l-miftāḥ, fūhati l-m.) to peep through the keyhole; انظر بعده unẓur ba’dahū see below! انظر ظهره (ẓahrahū) see reverse! please turn over! <b>II</b> to make comparisons, draw parallels (بين between) <b>III</b> to equal (هـ, ه s.o., s.th.), be equal (هـ, ه to s.o., to s.th.); to equalize, put on an equal footing (ب هـ, ه s.o., s.th. with), equate, liken, compare (ب هـ, ه s.o., s.th. to); to vie, compete, be in competition (s with s.o.), rival (ه s.o.); to argue, debate, dispute (ه with s.o.), point out (ب ه to s.o. s.th.) by way of argument or objection, confront (ب ه s.o. with); to superintend, supervise (هـ s.th.) <b>IV</b> to grant (ه s.o.) a delay or respite <b>V</b> to regard, watch or observe attentively (هـ, ه s.o., s.th.), look closely (هـ, ه at s.o., at s.th.), scrutinize (هـ, ه s.o., s.th.); to bide one’s time, wait <b>VI</b> to face each other, lie opposite; to he symmetrical (math.); to dispute, argue (with one another); to quarrel (على about), fight (على over s.th.); to contend (with each other) (على for s.th.), contest each other’s right (على to s.th.) <b>VIII</b> to wait (ه for s.o.), expect (هـ, ه s.o., s.th.), await, anticipate (هـ s.th.); to look closely (ه at s.o.); to look on expectantly, bide one’s time, wait │ انتظر الشيء الكبير من to expect much of …; انتظر من ورائه كل خير (wara’ihi kulla kairin) to set the greatest expectations in s.th. <b>X</b> to wait, await, expect; to have patience, be patient; to request a delay or respite; to ask (ه s.o.) to wait, keep (ه s.o.) waiting\n\n\nنظر naẓar pl. انظار anẓār seeing, eyesight, vision; look, glance, gaze; sight; outlook, prospect; view; aspect; appearance, evidence; insight, discernment, penetration; perception; contemplation; examination (في of); inspection, study, perusal; consideration, reflection; philosophical speculation; theory; handling (في of a 975 matter); trial, hearing (في of a case in court); supervision, control, surveillance; competence, jurisdiction; attention, heed, regard, notice, observance, respect, consideration, care │ (ل or) نظر in view of, with a view to, in regard to, with respect to, in consideration of, on the basis of, due to, because of, for; بالنظر ل do.; بصرف النظر عن (bi-ṣarfi n-n.) or بقطع النظر عن (bi-qaṭ‘i n-n.) regardless of, irrespective of; تحت النظر under considerations being studied, being dealt with; دون النظر الى irrespective of, regardless of; في نظري in my eyes, in my opinion; للنظر فى for the study of, for consideration, for further examination of, for handling …, for action on …; O النظر الى الحياة (ḥayāh) weltanschauung; اعادة النظر i‘ādat an-n. re-examination, reconsideration, resumption, retrial, revision; اهل النظر ahl an-n. speculative thinkers; theoreticians, theorists; بعيد النظر or طويل النظر farsighted; قصر النظر qiṣar an-n. shortsightedness; قصير النظر shortsighted; المحكمة ذات النظر (maḥkama) the court of competent jurisdiction; مسألة فيها نظر (mas’ala) an unsettled, open question, an unsolved problem; من له نظر (man) s.o. noteworthy, a distinguished man; the responsibles or authorized, person; اخذ بالنظر to catch the eye; ادار نظره في (adāra) to let one’s eyes roam over …; تابع (راجع) بالنظر ل falling to the responsibility of, under the jurisdiction of, subject to the authority of; سارق النظر اليه or سارقه النظر or استرق النظر اليه (naẓara) to glance furtively at s.o., give s.o. a surreptitious look; في هذا الأمر نظر this matter calls for careful study, will have to be considered; قطع النظر عن to take no account of, disregard s.th.; هو تحت نظر فلان he is under the protection of so-and-so, he is patronized by so-and-so\n\n\nنظر similar, like; equal │ عديم النظر unparalleled, unequaled, matchless, unique of his (its) kind"
}