{
  "arabic": "نفس",
  "definition": "نفس nafusa u (nafas, نفاس nifās, نفاسة nafāsa) to be precious, valuable, priceless; -- nafisa a (nafas) to be sparing, niggardly 984 (ب with s.th.); -- (نفاسة nafāsa) to envy, begrudge (ه على s.o. s.th.); -- nafisa a and pass. nufisa (نفاس nifās) to he in childbed <b>II</b> to cheer up, comfort, appease, reassure (ه s.o.); to relieve (عن s.o., of s.th., esp., of sorrow, cares), dispel, banish (عن s.o.’s هـ worries, anxieties); to air (عن one’s secret feelings), give vent (عن to one’s emotions), uncover, reveal, voice, get off one’s chest, get out of one’s system, abreact (عن one’s suppressed desires, frustrations, fears, etc.); to desist (عن from), cease (عن doing s.th.); pass. nuffisa to get lost (عن to s.o.); to let out air, leak; to be in childbed <b>III</b> to compete, vie (عن ه with s.o. in); to compete, fight, struggle (على for), seek. try to obtain, desire (على s.th.), strive, be out (على for), aspire (على to) <b>V</b> to breathe, inhale and exhale; to take breath, pause for breath. have a breather, have a break, take a rest │ تنفس الحسرات المؤلمة (al-ḥasarāti l-mu’lima) to heave painful sighs; تنفس الصعداء (ṣu‘adā’a) to sigh deeply; to breathe a sigh of relief, breathe again; تنفس النفس الأخير (nafasa) to be at one’s last gasp, be dying; تنفس عن الحياة (ḥayāh) to breathe one’s last, die <b>VI</b> to rival, compete, vie, contend (على for, في in s.th.)\n\n\nنفس nafs f., pl. نفوس nufūs, انفس anfus soul; psyche; spirit, mind; life; animate being, living creature, human being, person, individual (in this sense, masc.); essence, nature; inclination, liking, appetite, desire; personal identity, self (used to paraphrase the reflexive pronoun; see examples below) │ بنفسه he himself; personally, in person; نحن بنفسوسنا we ourselves; في نفس الأمر (n. il-amr) in reality, actually, in fact; في نفس الواقع do.; عند انفسهم in their own opinion; جأءني هو نفسه (بنفسه) he himself came to me, he came personally to see me; جاء من نفس he came of his own accord; ما وعدت به فيما بيني وبين نفسي what I had promised myself; نفس الأمر n. al-amr the essence of the matter, the nature of the affair; نفس الشيء the thing itself; the same thing, the very thing; الاعتماد على النفس and الثقة بالنفس (tiqa) self-confidence, self-reliance; بشق النفس bi-šiqqi n-n. or بشق الأنفس (following لا ... لا) with (the greatest) difficulty, barely; صغير النفس base-minded, low-minded; عفيف النفس unselfish, selfless, altruistic; علم النفس ‘ilm an-n. psychology; كبير النفس high-minded, proud; محبة النفس maḥabbat an-n. amour propre, selfishness; بذل النفس والنفيس to make every conceivable sacrifice, sacrifice all, give up all one’s possessions\n\n\nنفس nafas pl. انفاس anfās breath; whiff; puff (from a smoking pipe, from a cigarette); swallow, gulp, draught; style of an author; freedom, liberty, convenience, discretion │ حتى النفس الأخير to the last breath; ذو نفس enough to slake the thirst; refreshing (drink); ضيق النفس ḍīq an-n. labored breathing, asthma; هو في نفس من اموره he acts according to his own desires; انت في نفس من امرك (amrika) you can do as you please! امسك نفاسه (anfāsahū) to hold one’s breath; فاضت انفاسه (anfāsuhū) to give up the ghost"
}