{
  "term": "نقل",
  "previous_term": "نقف",
  "next_term": "نقلي",
  "definition": "نقل naqala u (naql) to move from its place, move away, displace (هـ s.th.); to remove, take away, carry away, carry, transport (الى هـ s.th. to); to transfer, transplant, shift, translocate, relocate (هـ من ... الى, ه s.o., s.th. from ... to); to transmit, convey, communicate, bring, deliver, make overt pass on, hand over (الى ه s.th. to s.o.); to remove, dismiss (ه s.o.); to move, remove (الى to); to copy (من from); to translate (من ... الى from one language into the other); to hand down, pass on, report, relate (الى هـ s.th. to s.o., عن from, or baaed. on, s.o. or a source); to quote (عن an author or a literary work); to render (هـ a text); to enter, post (هـ an item; in bookkeeping); to communicate, spread (الى هـ a disease to s.o.), infect (هـ الى s.o. with); to transfer, assign, convey, cede (الى هـ s.th., esp. a right, to s.o.) <b>II</b> to move, move away, displace, move on, move forward, advance, transport, move about, let wander, let roam (هـ s.th., esp., a great deal of s.th. or a great number of things, s.th. successively, one thing after the other) │ نقل خطاه (kuṭāhu) to stride along, move along <b>III</b> to exchange (هـ ه with s.o. words); to cast, shoot (هـ ه at s.o. glances); to report (هـ ه to s.o., s.th.), inform (هـ ه s.o. of); to hand, pass (هـ ه to s.o. s.th.) <b>V</b> to be carried, be carried away, be removed, be transported; to be transferred, be conveyed, be assigned; O to be transmitted (by radio); to shift, change its locality; to change one’s residence, remove, go elsewhere; to change position (mil.); to move about; to walk about; to rove, roam, migrate, wander, travel about │ تناقل في منازل البلاغة (m. al-balāga) to be versed in rhetoric <b>VI</b> to carry, transport (هـ s.th.); to report to one another, relate or tell each other (هـ s.th.); to exchange (هـ s.th.); to spread, report, relate (هـ a story, etc.), pass on, hand down (هـ s.th.); to spread by word of mouth (هـ s.th.) │ تناقلته الألسن (alsun) to pass from mouth to mouth, be on everybody’s lips, be the talk of the town; تناقلته الأيدي (aidī) to pass from hand to hand, change hands; تناقلت الجرائد الخبر (kabara) the report was taken up by the entire press; تناقل الكلام (kalama) to talk with one another, have a talk <b>VIII</b> to be carried, be carried away, be removed, be transported; to be transferred, be conveyed, be assigned; O to be transmitted (by radio); to shift, change its locality; to change one’s residence, remove, go elsewhere; to change position (mil.); to walk about; to rove, roam, migrate, wander, travel about; to be transferred (official); to be turned over, be delivered, be transferred (ship); to be communicated (disease), spread (الى to); to be spread, circulate, make the rounds (rumor); to be transplanted (الى into or to); to move, move along, travel; 994 to betake o.s., proceed, go, take the road (الى to). head (الى for), turn (الى to); to apply o.s., turn (الى to a field of interest); to turn, make a turn (الى into another street; of an automobile); to pass (من from one owner الى to the other); O to be propagated, spread (waves, etc.; الى to, occasionally also في); O to jump across (el. spark); to shift (from attack to defense); to go away, depart (من and عن from), leave a place (من and عن); to go around (في in or among), make the round (في of), visit (one after the other) │ انتقل به الى to shift, translocate, relocate s.th. to; انتقل الى رحمة الله (raḥmati llāh) lit.: to pass away into God’s mercy, i.e., to die; انتقل الى جوار ربه (j. rabbihī) lit.: to be transferred into the presence of the Lord, i.e., to die, pass away\n\n\nنقل naql carrying, carriage; conveyance, transportation, transport; removal; translocation, relocation, transplantation; transfer (also, e.g., of an official); change of residence, move, remove; transmission (also by radio); translation; transcription, transcript, copy; tradition; report, account; entry, posting (in an account book); conveyance, transfer, assignment, cession │ نقلا عن based on, according to; نقل الدم n. ad-dam and نقل الدماء blood transfusion; O نقل الصور باللاسلكي n. aṣ-ṣuwar bi-l-lā-silkī radio-photography; نقل ميكانيكي motor transport (of passengers and cargoes); اجرة النقل ujrat an-n. cartage, carriage, freight; سيارة النقل sayyārat an-n. truck, lorry; معالم النقل transfer fees, assignment fees; وسائل النقل means of transportation, conveyances\n\n\nنقل naql, nuql pl. نقول nuqūl candied almonds or nuts, candy, sweets, dried fruits, etc., as a dessert\n\n\nنقل naqal rubble, debris"
}