{
  "arabic": "ورد",
  "definition": "ورد warada يرد yaridu (ورود wurūd) to come, arrive; to appear, show up; to be found, be met with, be said (في in a book, letter, etc.), be mentioned (في in); to reach (الى or هـ a place), arrive (الى or هـ at), come to, get to, travel to; to be received (على by s.o.; letter, money, or the like), come to s.o.’s (على) hands; to accrue, come (على to s.o.; revenue, proceeds, etc.) <b>II</b> to make (هـ s.th.) reach (ب s.th. else or s.o.), get s.th. (هـ) to (ب); to bring in, import (هـ s.th.); to supply, furnish, feed (ب هـ s.th. to); to deposit (ب هـ s.th. in), pay (ب هـ s.th. into) <b>IV</b> to make or have (هـ, ه s.o., s.th.) come (هـ or على to), bring, take (الى or على هـ, ه s.o., s.th. to); to transfer, convey, transport, move (الى هـ s.th. to a place); to import (هـ s.th.); to deposit, pay in (هـ an amount); to produce, present (هـ s.th.); to supply, furnish (هـ s.th.); to mention, state, set forth, bring up, allege, adduce, cite, quota (هـ s.th.), interpose, introduce, mention casually, drop in passing, throw in (هـ s.th., .,. in one’s speech) <b>VI</b> to arrive successively, come one after the other; to succeed one another, be successive, consecutive; to arrive, come in, come to hand (news, dispatches); to coincide, happen to be identical (ideas, thoughts) <b>X</b> to have (هـ s.th.) supplied or furnished (من by or from), buy, draw, get, procure (من هـ s.th. from); to import (من هـ s.th. from)\n\n\nورد wird watering place; animals coming to the water; -- (pl. اوراد aurād) specified time of day or night devoted to private worship (in addition to the five prescribed prayers); a section of the Koran recited on this occasion │ الورد الذي طالما التسبيح به (ṭālamā) and الورد الذي يتلى في الغدو والآصال (yutlā fī l-gudūw wa-l-āṣāl) approx.: always the lame old story\n\n\nورد <b>II</b> to blossom, be in bloom (tree); to apply rouge (هـ to), rouge, make up (هـ s.th.); to dye or color red (هـ s.th.) <b>V</b> to be or become red; to take on a rosy color, glow, be aglow, be flushed (cheek) <b>VI</b> = V\n\n\nورد ward (coll.; n. un. ة) pl. ورود wurūd rose(s); blossoms, flowers, bloom"
}