{
  "arabic": "وسع",
  "definition": "وسع wasu‘a يوسع yausu‘u (وساعة wasā‘a) to be wide, roomy, spacious, vast, extensive; -- wasi‘a يسع yasa‘u (سعة sa‘a) to be wide, roomy, spacious; to be well-to-do, be well off; to hold, accommodate, house, seat, etc. (هـ, ه s.o., s.th.), have room, have capacity (هـ, ه for); to contain, comprise, comprehend, encompass, include (هـ s.th.); to be large enough, suffice, be sufficient, adequate, enough (هـ, ه for); wasi‘a yasa‘u (وسع wus‘, سعة sa‘a) esp. with negation: to be possible (ه for s.o.), be permitted, be allowed (ه to s.o.), be in s.o.’s (ه) power, be up to s.o. (ه); to be able (هـ to do s.th.), be capable (هـ of); to be allowed (هـ to do s.th.) │ لا يسعني ان اقول I cannot say; ما اسع ذلك I can’t do that <b>II</b> to make wider, roomier, more spacious (هـ s.th.); to extend expand (هـ s.th.); to widen, enlarge (هـ or من s.th.); to broaden (هـ s.th.); to be generous, liberal, openhanded (على toward s.o., هـ ه toward s.o. with s.th.); to make rich. enrich (على s.o.) │ وسع خطاه (kuṭāhu) to take longer strides, stride out, quicken one’s pace; وسع المكان ل (makāna) to make room for <b>IV</b> = II; to be or become rich │ اوسعه برا (birran) to 1067 treat s.o. with the greatest reverence, bestow ample favors upon s.o.: اوسعه شتما (šatman) to heap abuse on s.o.; اوسعه ضربا (ḍarban) to give s.o. a sound beating, wall s.o.; اوسع النفقة (nafaqata) to incur great expenses <b>V</b> to be extended, be expanded, be widened; to spread (out), expand, widen, expand; to have enough room, sit comfortably; to make o.s. comfortable, make o.s. at home (في in); to enlarge, expatiate (في on), talk or write at great length (في about); to proceed (في in); to continue (في s.th., in s.th.) │ توسع في النفقة (nafaqa) to incur great expenses <b>VIII</b> اتسع ittasa‘a to be extended, be expanded, be widened, be enlarged; to expand, widen, grow, increase; to stretch far and wide, be vast; to extend, range; to become rich; to be large or wide enough, suffice, be sufficient, adequate, enough (ل for); to hold, accommodate, house, seat, etc. (ل s.o., s.th.), have room (ل for); to be at s.o.’s (ل) disposal; to be susceptible (ل of); to be able (ه to do s.th.). be capable (هـ of) │ بكل ما تتسع له الكلمة من معنى (kalimatu, ma‘nan) in the widest sense of the word <b>X</b> to widen, expand, become wider; to become larger, increase in size; to find wide or large (هـ s.th.)\n\n\nوسع wus‘ ability, capability, faculty; capacity; power, strength; holding capacity │ وسعه wus‘uhū what he can do. what is in his power; في وسعه ان it is in his power to ..., he can …; في وسعي ان اقول I can, or I may, say; ليس في وسعه الا (illā) ha has no other possibility but ..., he cannot but ...; بذل وسعه to go to great pains, do one’s best or utmost\n\n\nوسع wasa‘ vastness, vast space"
}