{
  "term": "وصل",
  "previous_term": "مستوصف",
  "next_term": "وصلة",
  "definition": "وصل waṣala يصل yaṣilu (waṣl, صلة ṣila) to connect, join, unite, combine, link, interlock (ب هـ s.th. with), attach (ب هـ s.th. to); to establish (صلة ṣilatan a contact, a connection; a relation بين – و between -- and); to bring into relation (بين – و s.th. with s.th. else); to give (ب s.o. s.th.), bestow, confer (ب ه upon s.o. s.th.), award (ب ه to s.o. s.th.); -- (وصول wuṣūl) to arrive (الى or هـ at a place); to come to s.o.’s (الى or ه) hands; to reach (الى or هـ, ه s.o., s.th.); to come, get (الى or هـ, ه to); to reach (الى or هـ an amount), amount to (الى or هـ); to enter (الى a phase); to get (الى ب s.o. to or to the point where) │ وصلني خطاب I have received a letter; 1072 وصله الخبر (kabar)he received the news; يصل هذا الى حد كذا (ḥaddi k.) this gets to the point where ...; وصل الى الصفحة الحاصمة (ṣafḥa) to enter the decisive phase <b>II</b> to connect, join, unite, combine (ب هـ s.th. with); to make (هـ, ه s.o., s.th.) get (الى to), see that s.o. or s.th. (هـ, ه) gets to (هـ); to get, take, bring, move, lead, show, conduct, convey, channel (الى هـ, ه s.o., s.th. to); to give (ه s.o.) a ride, a lift; to carry, transport, transfer, convey (الى, هـ s.th. to); to deliver, transmit, communicate (الى هـ s.th. to); to conduct, act as a conductor (el.); to accompany, escort (الى ه s.o. to); to connect (الى هـ s.th. to an electric circuit, ب هـ one apparatus with another, an electric device with the main line), plug in (هـ s.th.); to turn on, switch on (هـ s.th.; el.) <b>III</b> to continue (في or هـ s.th.), proceed (في or هـ in or with); to persist, persevere (في or هـ in); to be connected (هـ with), bear (هـ on), belong, pertain (هـ to); to be close friends, maintain close relations (ه with s.o.); to have sexual intercourse (ها with a woman) │ واصل الليل بالنهار (laila, nahāri) to work day and night; واصل جهده (سعيه) في (jahdahū, sa‘yahū) to make untiring efforts for <b>IV</b> = II; O to put through (a long-distance call) │ اوصل كل ذي حق بحقه (kulla dī ḥaqqin bi-ḥaqqihī) to give everyone his due <b>V</b> to obtain access (الى to); to gain access by certain means (الى to), get (الى into) in come way or other; to attain (الى to), arrive (الى at), reach (الى s.th.), come by s.th. (الى) <b>VI</b> to be interconnected; to form an uninterrupted sequence <b>VIII</b> اتصل ittaṣala to be joined (ب to), be connected (ب with); to combine, unite (ب with); to get in touch (ب with s.o., also, e.g., by telephone); to contact (ب s.o.); to have relation (ب to), bear (ب on), be connected, have to do (ب with); to join (ب s.o. or s.th.); to be attached (ب to); to be near s.o. or a place (ب), be adjacent, continuous (ب to), adjoin (ب s.th.), border, abut (ب on), belong (ب to); to come to s.o.’s (ب) knowledge; to be continued, continue, go on; to be continuous, form a continuous chain; to be related (الى to); to trace one’s descent (الى to); to come, get (الى to), arrive (الى at), reach (الى s.th.) │ قد اتصل بنا ان it has come to our knowledge that ...; اتصل به تلفونيا to get in touch with s.o. by telephone, have o.s. connected with; اتصلت به النار to catch fire\n\n\nوصل waṣl junction, juncture, connection; union, combination; linkage, nexus; synopsis, summary; reunion of lovers; (pl. اوصال auṣāl) relation, link, tie, connection; contact (el.); (pl. وصولات wuṣūlāt) voucher, receipt │ وصل الفائت synopsis of the previous chapters of a newspaper serial; ليلة الوصل lailat al-w. last night of a lunar month\n\n\nوصل wuṣl, wiṣl pl. اوصال auṣāl limb, member (of the body); pl. articulations, joints │ حل اوصاله (ḥalla) or قطع اوصاله to dismember, dissect s.th."
}