{
  "arabic": "وفى",
  "definition": "وفى wafā يفي yafī to be perfect, integral, complete, unabridged; -- (وفاء wafā’) to live up (ب or هـ to a promise, an agreement, a vow, or the like), redeem, fulfill, carry out, keep (ب or هـ s.th.); to satisfy, gratify (ب a wish, a desire), supply (ب a need); to serve (ب a purpose); to meet, fulfill, discharge (ب an obligation, an engagement); to pay (a debt); to redeem (a pledge); to cover (costs, expenses); to be sufficient, be enough, suffice (ب for), be adequate (ب to); to make up, compensate fully (ب for), counterbalance (ب s.th.); to be equivalent (ب to s.th.), fulfill the function (ب of s.th.), substitute (ب for); to realize or carry out (fully, completely; ب s.th.) <b>II</b> to bring up to standard, complete, round out (هـ s.th.); to give (هـ ه s.o. s.th.) to the full extent, let s.o. (ه) have his full share of s.th. (هـ); to present, lit forth, or treat exhaustively (a topic) <b>III</b> to come (ه to s.o.), appear, show up (ه before s.o., in s.o.’s presence); to bring, lake, deliver (ب to s.o. s.th.), supply, provide, furnish (ب s.o. with); to fulfill (هـ s.o.’s wish), comply (هـ with s.o.’s request) │ وافاه اجله (ajaluhū) his fate overtook him <b>IV</b> to give to the full; to fulfill, keep (ب or هـ s.th.), live up (ب or هـ to); to come or draw near s.th. (علي), approach (علي s.th.); to exceed, transcend (علي s.th.), go beyond (علي) │ اوفى علي الانتهاء to draw to a close; عمره الآن قد اوفى علي التاسعة (‘umruhū) he is already past nine years of age <b>V</b> to exact fully (هـ s.th.), take one’s full share (هـ of), receive in full (هـ s.th.); توفاه الله God hal taken him unto Him; pass. tuwuffiya to die <b>VI</b> to be complete; to decide unanimously (علي for, in favor of) <b>X</b> to receive in full, exact (fully) (هـ s.th.); to give (fully) (هـ ل to s.o s.th.), let s.o. have his full share of; to complete, bring to a finish (هـ s.th.), go through with s.th. (هـ); to lit out, hear to the end (هـ a program); to bring to its full value (هـ s.th.); to treat exhaustively (هـ a topic); to exhaust (هـ s.th.); to present in detail. at great length (هـ s.th.); to fulfill (هـ the condition); to receive full compensation or indemnity"
}