{
  "term": "وقع",
  "previous_term": "وقظ",
  "next_term": "وقعة",
  "definition": "وقع waqa‘a يقع yaqa‘u (وقوع wuqū‘) to fall; to fall down, drop; to tumble; to come to pass, take place, occur; to happen (ل to s.o.), befall (ل s.o.); to get (في in a situation, also, e.g., in a fix); to get (الى to), arrive (الى at); to come, run (علي across), meet (علي with); to fall (علي to s.o., to s.o.’s lot or share); to slight, settle down (علي on: bird); to have sexual intercourse (علي with a woman); to be divided (في into), consist (في of); to be located, be situated, lie (geog.,); -- (وقيعة waqī‘a) to slander, backbite, defame, disparage (من or ب s.o.): -- (waq‘) to rush, pounce, fall (ب upon s.o.) │ وقعوا في بعضهم they fell to quarreling, they fell out with one another; وقع بايديهم (bi-aidīhim) he fell into their hands; وقع تحت حواسه (ḥawāssihī) to enter s.o.’s range of perception, become palpable, tangible for s.o.; وقعت في حبه (ḥubbihī) she fell in love with him; وقعت حرب (ḥarb) war broke out; وقع الحق (ḥaqq) the law has been determined; وقع الحق عليه he was found guilty; وقع في الفخ (fakk) to walk into the trap, get caught in the snare; وقع فريسته (farīsatahū) to fall victim to s.o., become a prey of s.o.; وقع من قلبه في مكان (min qalbihī fī makānin) to take s.th. to heart; to make s.th. one’s business, attend to s.th.; وقع القول عليه (qaul) he was called upon to speak, he was given the floor; وقع في نفسه ان it came to his mind, it occurred to him to ...; وقع الكلام في (kalām) the words impressed him, went to his heart, touched him; وقعت في (من) نفسه she has made an impression on him, she has bewitched him; وقع في هواها (hawāhā) he fell in love with her; وقع موقعه (mauqi‘ahū) to stand in place of, stand for; وقع في غير موقعه (fī gairi mauqi‘ihī) to be misplaced, stand in the wrong place, be used in the wrong context (word); وقع الكلام منه موقعا (kalāmu, mauqi‘an) the words moved or impressed him; وقع الأمر منه موقعا حسنا (mauqi‘an ḥasanan) the matter pleased him very much, was most welcome to him; وقع عنده موقع الرضا (mauqi‘a r-riḍā) it met his approval; وقع في النفوس موقعا جليلا to leave a strong, splendid impression; وقع ووقع الاستغراب to cause raised eyebrows, cause astonishment <b>II</b> to let fall, drop (هـ, ه s.o., s.th.); to cause to fall, bring down, throw down, overthrow (هـ, ه s.o., s.th.); to perform, carry out, execute (هـ s.th.); to enter, record, register (علي or في هـ s.th. in or on); to 1089 sign (هـ s.th.); to inflict (علي هـ a punishment on s.o.); to play (علي on a musical instrument); to sow dissension (بين between, among) │ وقع حجزا على (ḥajzan) to seize, confiscate, impound or distrain s.th.; وقعه بالأحرف الأولى (bi-l-aḥrufi l-ūlā) to initial s.th.; وقع نفسه (nafsahū) to give o.s. up; وقع على الوتر الحساس (al-watar al-ḥassās) to touch the sensitive spot <b>III</b> to attack (ه s.o.), fight (ه with); to have sexual intercourse (ها with a woman) <b>IV</b> to let fall, drop (هـ, ه s.o., s.th.); to cause to fall, bring down, throw down, overthrow (هـ, ه s.o., s.th.); to plunge (في ه s.o. into s.th., esp. fig.), get, land (في ه s.o. in a situation); to fall (ب upon s.o.), attack, assault (ب s.o.); to score a hit (ب on); to sow the seeds of discord, drive wedge (بين -- وبين between -- and); to project (هـ s.th.) │ اوقع الرعب في قلبه (ar-ru‘ba fī qalbihī) to strike terror to s.o.’s heart, frighten or scare s.o.; اوقع عقوبة علي to inflict a punishment on; اوقعه في كمين to let s.o. walk into an ambush <b>V</b> to expect, anticipate (هـ s.th.); to prepare o.s., wait (هـ for); to dread (هـ s.th.); to be inflicted (علي on s.o.; punishment), be passed (علي against s.o.; judgment) <b>X</b> to expect, anticipate, dread (هـ s.th.), feel uneasy, be concerned (هـ about), look forward with apprehension (هـ to)\n\n\nوقع waq‘ falling, dropping, tumbling; fall, drop, tumble; thump, thud, blow; happening, occurrence, incidence; impression (s.th. makes), effect; impact │ وقع الأقدام footfall, footsteps; وقع اقدام ثقلية heavy footfall; كان له احسن وقع في النفوس (aḥsanu waq‘in) to make the best impression on everyone"
}