{
  "term": "ولي",
  "previous_term": "ولولة",
  "next_term": "ولى",
  "definition": "ولي waliya يلي yalī to be near s.o. or s.th. (ه, هـ), be close (هـ, ه to), lie next (هـ to); to adjoin (هـ s.th.), be adjacent (هـ to); to follow (هـ, ه s.o., s.th.); to border (هـ on); -- (ولاء walā’, ولاية walāya) to be a friend (ه of s.o.), be friends (ه with); -- (ولاية walāya, wilāya) to be in charge (على or هـ of s.th.), manage, run, administer, govern, rule (على or هـ s.th.), have power, authority, or the command (على or هـ over) │ ما يلي the following, what follows; كما يلي as follows, like this; فيما يلي in what follows, in the following, in the sequel; ما يلي البدن من الملابس (badana) the underwear, the underclothes; غرفة تلي السقف (gurfa, saqf) a chamber under the roof; ولى الحكم (ḥukma) to take over the government, come into power <b>II</b> to turn (هـ ه to or toward s.o. s.th., e.g., the back, the face of s.th.); to turn away (عن or ه from s.th.), avoid, shun (عن or ه s.th.); to turn around, turn back, wheel around; to flee (عن or هـ from s.th.); to pass, go by, glide away (days, years); to appoint as manager, director, administrator, governor, or ruler (ه s.o.); to put (ه s.o.) in cbarge (هـ of), make s.o. (ه) the head of (هـ); to entrust (هـ ه s.o. with, to s.o. s.th.), commission, charge (هـ ه 1099 s.o. with), assign (ه هـ to s.o. s.th.) │ ولاه دبره (duburahū) or ولاه ظهره (ẓahrahū) to turn one’s back on s.o. or s.th.; ولوا عنه الأدبار they turned their backs on him, they turned away from him; ولى هاربا (hāriban) to wake to flight, run away; ولى وجهه (wajhahū) to turn, face (هـ toward) <b>III</b> to be a friend. a helper, a supporter, a patron, a protector; to help, aid, assist (ه s.o.); to do constantly, incessantly (هـ s.th.); to continue without interruption (هـ s.th., to do s.th.). go about s.th. (هـ) successively, systematically; to pursue, practice, cultivate (هـ s.th., e.g., arts); to follow immediately (هـ s.th.; time), be subsequent (هـ to) <b>IV</b> to bring close (هـ ه to s.o. a.th.); to turn (هـ ه toward s.o. one’s back. or the like); to commit (هـ ه to s.o. the care or responsibility for), entrust, commission, charge (هـ ه s.o. with); to do, render (هـ ه s.o. a favor); to do (هـ ه to s.o. s.th. harmful), bring (ه هـ upon s.o. s.th.); to display, evince (هـ ه toward. s.o. s.th., e.g., indifference) │ اولاه ثقته (tiqatahū) to have confidence in s.o.; اولاه معروفا to do s.o. a favor <b>V</b> to occupy, fill, hold (هـ an office), be entrusted (هـ with), be in charge (هـ of); to take possession, take charge (هـ of), take over, take upon o.s., undertake, take in hand (هـ an affair), attend (هـ to); to take care (هـ of), see (هـ to s.th.), arrange (هـ for s.th.); to assume the responsibility (هـ for), seize control (هـ of); to take over the government, come into power; to turn away, desist, refrain (عن from), forgo (عن s.th.) │ توالى الحكم (ḥukma) to be in power, hold supreme power; to seize power; تولاه اليأس (ya’su) he was seized (or overcome) by despair <b>VI</b> to follow in succession, without interruption; to come continually (على to), arrive constantly (على at); to progress, continue (e.g., an advance, a march) <b>X</b> to possess o.s., take possession (على of), seize (على s.th.), make 0.s. muter or (على); to receive as one’s own, take over, capture, confiscate, requisition, occupy (على s.th.); to overpower, overwhelm, overcome (على s.o.); to take prisoner, capture (على s.o.)"
}