{
  "term": "يد",
  "previous_term": "يخنة",
  "next_term": "يدوي",
  "definition": "يد yad f., pl. ايد aidin, اياد ayādin hand; foreleg; handle; power, control, influenoe, 1105 authority; assistance, help, aid; (Isl. Law) (personal) possession, actual control; benefit; favor │ l. With prepositions: يدا بيد yadan bi-yadin personal(ly), from hand to hand; بين يدي ... (yadai) in front of; بين يديه in front of him; in his presence; in his power; بأيدينا bi-aidīnā or بين ايدينا at our disposal; الكلام بين ايديكم (kalāmu) you have the floor, you may speak; ما بين ايدينا من what … are before us or present themselves to us; تحت اليد on hand, handy, available; تحت يده under his authority, in his power; على يد pl. على ايدي (with foll. genit.) at the hand(s) of; على يده or عن يده with his help, through his good offices; على ايدي الناس with the help of other people; at the hands of other people; في اليد in hand, on hand, availahle; -- 2. Construct forms: يد الجوزاء y. al-jauzā’ a bright star in Orion; لا افعله يد الدهر (yada d-dahr) I shall never do it; يد المظلة y. al-miẓalla umbrella handle; يد النكاح conjugal authority (Isl. Law); ذو اليد powerful, influential; holder of actual control, possessor (Isl. Law); ساعة اليد wrist watch; سبط اليدين sabiṭ al-y. liberal, openhanded, generous; شنطة اليد šanṭat al-y. handbag; شغل اليد šugl al-y. or عمل اليد ‘amal al-y. manual work; handwork; صفاد اليد handcuff; صفر اليدين ṣifr al-y. empty-handed; عربة اليد ‘arabat al-y. handcart; قنبلة اليد qunbulat al-y. hand grenade; -- 3. Other phrases: يد بيضاء pl. اياد بيضاء benefit, favor; skill, competence, capability, qualification, achievement; له يد بيضاء في to be skilled, versed, experienced in; to have the upper hand in; يد مبطلة (mubṭila) unrightful possession (Isl. Law); يد محقة (muḥiqqa) rightful possession (Isl. Law); بقي مكتوف الأيدي امام (baqiya) to stand helpless before ...; دق يدا بيد (daqqa) to clap one’s bands; ذهبوا ايدي (ايادي) سبا dahabū aidiya (ayādiya) sabā to be scattered in all directions; اسدى اليه يدا (asdā) to do s.o. a favor; سقط في يده (suqiṭa) to stand aghast, be embarrassed, be bewildered; اسقط في يده (usqiṭa) do.; شد يده على (šadda yadahū) to cling to s.th.; مشغول باليد or مصنوع باليد handmade; طلب يد المرأة (yada l-mar’a) to propose to a woman, ask her hand in marriage; اعطاه شيئا عن ظهر يد a‘ṭāhu ‘an ẓahri yadin to give s.o. s.th. for nothing, give s.o. s.th. as a present; اليد العاملة labor force, labor; الأيدي العاملة man power, labor, workmen, hands; قدمه باليد (qaddamahū) to band s.th. over personally, deliver s.th. in person; له عندي يد I am obliged to him (or a favor; له يد في he has a hand in ...; له اليد الطولى في (ṭūlā) to be powerful in, have decisive issuance on; له عند الناس يد he has great influence on other people, he can accomplish a great deal with other people;ما لي بذلك يدان that is not in my power; مد يد المساعدة (or العون or المعونة) madda yada l-musā‘ada (l-ma‘ūna, l-‘aun) to extend one’s help, lend a helping hand; هم يد واحد علي (‘alayya) they are in league against me; وضع يده على (yadahū) to take possession of; يده قصيرة he is incapable, his powers are limited"
}